#----
# Химический состав пищи:
    # https://en.wikipedia.org/wiki/Staple_food
    # Большой справочник калорийности продуктов питания и блюд
        # http://pbprog.ru/databases/foodmeals/
        # http://foodb.ca/

#----
# Пища (штучные --> грамм):
    # Соотношение массы и объема пищевых продуктов
        # http://www.skitalets.ru/food/articles/massa_shegol/massa.htm
        # https://1001retsept.ru/tablitsa-otnosheniya-vesa-i-objema-produktov.html
        # https://www.dovesfarm.co.uk/hints-tips/cheat-sheets/us-cups-conversion-table

metadict_detail['Перец острый отборный (штука)'] = {
        # Перец Чили
        'Перец острый отборный (грамм)':40,
        }

metadict_detail['Баклажан чищеный (штука)'] = {
        # Сорт Фиолетовое чудо
        'Баклажан чищеный (грамм)':200,
        }

metadict_detail['Томат отборный (штука)'] = {
        # Сорт Красно солнышко
        'Томат отборный (грамм)':100,
        }

metadict_detail['Оливки маринованные (штука)'] = {
        # Без косточек
        'Оливки маринованные (грамм)':10,
        }

metadict_detail['Вишня отборная (штука)'] = {
        # Вишня Жуковская
        # http://profermu.com/sad/derevia/vishnia/sorta-v/sorta.html
        'Вишня отборная (грамм)':5,
        }

metadict_detail['Банан чищенный местный (штука)'] = {
        'Банан чищенный местный (грамм)':120,
        }

metadict_detail['Лимон отборный (штука)'] = {
        'Лимон отборный (грамм)':120,
        }

metadict_detail['Земляника отборная (штука)'] = {
        # Мелкоплодная
        # https://nashzeleniymir.ru/земляника
        'Земляника отборная (грамм)':10,
        }

metadict_detail['Яблоко мочёное (штука)'] = {
        # Анисовка -- мелкие плоды
        # http://www.uhlib.ru/domovodstvo/jablonja/p4.php#metkadoc4
        'Яблоко мочёное (грамм)':60,
        }

metadict_detail['Слива чищеная (штука)'] = {
        # Косточка - 5-7 грамм.
        'Слива чищеная (грамм)':50,
        }

metadict_detail['Морковь чищеная (штука)'] = {
        # Сорт "Нандрин F1"
        'Морковь чищеная (грамм)':75,
        }

metadict_detail['Огурцы отборные (штука)'] = {
        'Огурцы отборные (грамм)':100,
        }

metadict_detail['Огурцы чищеные (штука)'] = {
        'Огурцы чищеные (грамм)':100,
        }

metadict_detail['Лук чищеный (луковица)'] = {
        # Краснодарский Г-35
        # http://www.udec.ru/ovoshhi/rep-luk-sorta.php
        'Лук чищеный (грамм)':75,
        }

metadict_detail['Лук-шалот (луковица)'] = {
        'Лук чищеный (грамм)':50,
        }

metadict_detail['Чеснок чищеный (зубчик)'] = {
        'Чеснок чищеный (грамм)':6,
        }

metadict_detail['Чеснок чищеный (головка)'] = {
        'Чеснок чищеный (грамм)':60,
        }

metadict_detail['Орех мускатный (штука)'] = {
        'Орех мускатный (грамм)':2,
        }

metadict_detail['Семена кориандра (штука)'] = {
        'Семена кориандра (грамм)':1 / 125,
        }

metadict_detail['Семена кунжута (штука)'] = {
        'Семена кунжута (грамм)':1 / 250,
        }

metadict_detail['Кардамон сушёный (капсула)'] = {
        'Кардамон сушёный (грамм)':1 / 5,
        }

metadict_detail['Лист лавра сушёный (штука)'] = {
        'Лист лавра сушёный (грамм)':1 / 3,
        }

metadict_detail['Перец душистый сушёный (горошина)'] = {
        'Перец душистый сушёный (грамм)':1 / 17,
        }

metadict_detail['Перец чёрный сушёный (горошина)'] = {
        # 1000 зерен черного перца хорошего качества должны весить 460 гр
        'Перец чёрный сушёный (грамм)':1 / 2,
        }

metadict_detail['Гвоздика сушёная (бутон)'] = {
        'Гвоздика сушёная (грамм)':1 / 15,
        }

metadict_detail['Корица палочкой (палочка)'] = {
        # На самом деле кассия
        'Корица палочкой (грамм)':8,
        }

#----
# Пища (грамм --> 100 грамм):

metadict_detail['Яйцо куриное (грамм)'] = {
        'Яйцо куриное (100 грамм)':1 / 100,
        }

metadict_detail['Яйцо куриное взбитое с солью и уксусом (грамм)'] = {
        'Яйцо куриное взбитое с солью и уксусом (100 грамм)':1 / 100,
        }

metadict_detail['Яйцо куриное белок (грамм)'] = {
        'Яйцо куриное белок (100 грамм)':1 / 100,
        }

metadict_detail['Яйцо куриное желток (грамм)'] = {
        'Яйцо куриное желток (100 грамм)':1 / 100,
        }

metadict_detail['Вымя говяжье чищенное (грамм)'] = {
        'Вымя говяжье чищенное (100 грамм)':1 / 100,
        }

metadict_detail['Диафрагма говяжья чищенная (грамм)'] = {
        'Диафрагма говяжья чищенная (100 грамм)':1 / 100,
        }

metadict_detail['Книжка говяжья чищенная (грамм)'] = {
        'Книжка говяжья чищенная (100 грамм)':1 / 100,
        }

metadict_detail['Лёгкие говяжьи чищенные (грамм)'] = {
        'Лёгкие говяжьи чищенные (100 грамм)':1 / 100,
        }

metadict_detail['Ноги говяжьи нарубленные (грамм)'] = {
        'Ноги говяжьи нарубленные (100 грамм)':1 / 100,
        }

metadict_detail['Заливное из говяжьих ног (грамм)'] = {
        'Заливное из говяжьих ног (100 грамм)':1 / 100,
        }

metadict_detail['Ноги говяжьи чищенные (грамм)'] = {
        'Ноги говяжьи чищенные (100 грамм)':1 / 100,
        }

metadict_detail['Печень говяжья чищенная (грамм)'] = {
        'Печень говяжья чищенная (100 грамм)':1 / 100,
        }

metadict_detail['Почки говяжьи чищенные (грамм)'] = {
        'Почки говяжьи чищенные (100 грамм)':1 / 100,
        }

metadict_detail['Рубец говяжий чищенный (грамм)'] = {
        'Рубец говяжий чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Селезёнка говяжья чищенная (грамм)'] = {
        'Селезёнка говяжья чищенная (100 грамм)':1 / 100,
        }

metadict_detail['Сердце говяжье чищенное (грамм)'] = {
        'Сердце говяжье чищенное (100 грамм)':1 / 100,
        }

metadict_detail['Сычуг говяжий чищенный (грамм)'] = {
        'Сычуг говяжий чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Хвост говяжий чищенный (грамм)'] = {
        'Хвост говяжий чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Уши говяжьи чищенные (грамм)'] = {
        'Уши говяжьи чищенные (100 грамм)':1 / 100,
        }

metadict_detail['Диафрагма баранья чищенная (грамм)'] = {
        'Диафрагма баранья чищенная (100 грамм)':1 / 100,
        }

metadict_detail['Лёгкие бараньи чищенные (грамм)'] = {
        'Лёгкие бараньи чищенные (100 грамм)':1 / 100,
        }

metadict_detail['Печень баранья чищенная (грамм)'] = {
        'Печень баранья чищенная (100 грамм)':1 / 100,
        }

metadict_detail['Почки бараньи чищенные (грамм)'] = {
        'Почки бараньи чищенные (100 грамм)':1 / 100,
        }

metadict_detail['Рубец бараний чищенный (грамм)'] = {
        'Рубец бараний чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Селезёнка баранья чищенная (грамм)'] = {
        'Селезёнка баранья чищенная (100 грамм)':1 / 100,
        }

metadict_detail['Сердце баранье чищенное (грамм)'] = {
        'Сердце баранье чищенное (100 грамм)':1 / 100,
        }

metadict_detail['Кости бараньи (грамм)'] = {
        'Кости бараньи (100 грамм)':1 / 100,
        }

metadict_detail['Кости бараньи запечённые (грамм)'] = {
        'Кости бараньи запечённые (100 грамм)':1 / 100,
        }

metadict_detail['Кости говяжьи (грамм)'] = {
        'Кости говяжьи (100 грамм)':1 / 100,
        }

metadict_detail['Кости говяжьи запечённые (грамм)'] = {
        'Кости говяжьи запечённые (100 грамм)':1 / 100,
        }

metadict_detail['Жир бараний курдючный топлёный (грамм)'] = {
        'Жир бараний курдючный топлёный (100 грамм)':1 / 100,
        }

metadict_detail['Ливер бараний нарезанный (грамм)'] = {
        'Ливер бараний нарезанный (100 грамм)':1 / 100,
        }

metadict_detail['Ливер говяжий нарезанный (грамм)'] = {
        'Ливер говяжий нарезанный (100 грамм)':1 / 100,
        }

metadict_detail['Говяжьи субпродукты варёные (грамм)'] = {
        'Говяжьи субпродукты варёные (100 грамм)':1 / 100,
        }

metadict_detail['Говяжьи субпродукты для хаша (грамм)'] = {
        'Говяжьи субпродукты для хаша (100 грамм)':1 / 100,
        }

metadict_detail['Жир бараний курдючный (грамм)'] = {
        'Жир бараний курдючный (100 грамм)':1 / 100,
        }

metadict_detail['Баранина запечённая с ливером, луком и пряностями (грамм)'] = {
        'Баранина запечённая с ливером, луком и пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Ноги говяжьи нарубленные (100 грамм)'] = {
        'Ноги говяжьи нарубленные (килограмм)':1 / 10,
        }

metadict_detail['Заливное из говяжьих ног (100 грамм)'] = {
        'Заливное из говяжьих ног (килограмм)':1 / 10,
        }

metadict_detail['Баранина вырезка (грамм)'] = {
        'Баранина вырезка (100 грамм)':1 / 100,
        }

metadict_detail['Говядина вырезка (грамм)'] = {
        'Говядина вырезка (100 грамм)':1 / 100,
        }

metadict_detail['Телятина вырезка (грамм)'] = {
        'Телятина вырезка (100 грамм)':1 / 100,
        }

metadict_detail['Форель филе (грамм)'] = {
        'Форель филе (100 грамм)':1 / 100,
        }

metadict_detail['Форель фаршированная рисом и изюмом (грамм)'] = {
        'Форель фаршированная рисом и изюмом (100 грамм)':1 / 100,
        }

metadict_detail['Белуга филе (грамм)'] = {
        'Белуга филе (100 грамм)':1 / 100,
        }

metadict_detail['Осётр филе (грамм)'] = {
        'Осётр филе (100 грамм)':1 / 100,
        }

metadict_detail['Севрюга филе (грамм)'] = {
        'Севрюга филе (100 грамм)':1 / 100,
        }

metadict_detail['Телятина нарезанная припущенная обжаренная (грамм)'] = {
        'Телятина нарезанная припущенная обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Телятина нарезанная припущенная (грамм)'] = {
        'Телятина нарезанная припущенная (100 грамм)':1 / 100,
        }

metadict_detail['Телятина нарезанная (грамм)'] = {
        'Телятина нарезанная (100 грамм)':1 / 100,
        }

metadict_detail['Говядина нарезанная солёная (грамм)'] = {
        'Говядина нарезанная солёная (100 грамм)':1 / 100,
        }

metadict_detail['Говядина нарезанная солёная замоченная (грамм)'] = {
        'Говядина нарезанная солёная замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Говядина нарезанная солёная тушёная (грамм)'] = {
        'Говядина нарезанная солёная тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Говядина нарезанная припущенная обжаренная (грамм)'] = {
        'Говядина нарезанная припущенная обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Говядина нарезанная припущенная (грамм)'] = {
        'Говядина нарезанная припущенная (100 грамм)':1 / 100,
        }

metadict_detail['Говядина нарезанная (грамм)'] = {
        'Говядина нарезанная (100 грамм)':1 / 100,
        }

metadict_detail['Телятина шинкованная (грамм)'] = {
        'Телятина шинкованная (100 грамм)':1 / 100,
        }

metadict_detail['Курица филе (грамм)'] = {
        'Курица филе (100 грамм)':1 / 100,
        }

metadict_detail['Курица нарезанная (грамм)'] = {
        'Курица нарезанная (100 грамм)':1 / 100,
        }

metadict_detail['Курица нарезанная варёная (грамм)'] = {
        'Курица нарезанная варёная (100 грамм)':1 / 100,
        }

metadict_detail['Хинкали с телятиной варёные (грамм)'] = {
        'Хинкали с телятиной варёные (100 грамм)':1 / 100,
        }

metadict_detail['Хинкали с телятиной (грамм)'] = {
        'Хинкали с телятиной (100 грамм)':1 / 100,
        }

metadict_detail['Фарш телячий для хинкали (грамм)'] = {
        'Фарш телячий для хинкали (100 грамм)':1 / 100,
        }

metadict_detail['Баранина нарезанная варёная обжаренная (грамм)'] = {
        'Баранина нарезанная варёная обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Баранина нарезанная варёная (грамм)'] = {
        'Баранина нарезанная варёная (100 грамм)':1 / 100,
        }

metadict_detail['Баранина нарезанная припущенная обжаренная (грамм)'] = {
        'Баранина нарезанная припущенная обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Баранина нарезанная припущенная (грамм)'] = {
        'Баранина нарезанная припущенная (100 грамм)':1 / 100,
        }

metadict_detail['Баранина нарезанная (грамм)'] = {
        'Баранина нарезанная (100 грамм)':1 / 100,
        }

metadict_detail['Баранина шинкованная (грамм)'] = {
        'Баранина шинкованная (100 грамм)':1 / 100,
        }

metadict_detail['Рыба морская красная вяленая (грамм)'] = {
        'Рыба морская красная вяленая (100 грамм)':1 / 100,
        }

metadict_detail['Белуга вяленая (грамм)'] = {
        'Белуга вяленая (100 грамм)':1 / 100,
        }

metadict_detail['Осётр вяленый (грамм)'] = {
        'Осётр вяленый (100 грамм)':1 / 100,
        }

metadict_detail['Севрюга вяленая (грамм)'] = {
        'Севрюга вяленая (100 грамм)':1 / 100,
        }

metadict_detail['Вино красное разбавленное (грамм)'] = {
        'Вино красное разбавленное (100 грамм)':1 / 100,
        }

metadict_detail['Каша пшеничная с говядиной (грамм)'] = {
        'Каша пшеничная с говядиной (100 грамм)':1 / 100,
        }

metadict_detail['Каша пшеничная с бараниной (грамм)'] = {
        'Каша пшеничная с бараниной (100 грамм)':1 / 100,
        }

metadict_detail['Каша перловая с овощами (грамм)'] = {
        'Каша перловая с овощами (100 грамм)':1 / 100,
        }

metadict_detail['Каша перловая с рыбой и овощами (грамм)'] = {
        'Каша перловая с рыбой и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Каша перловая с бараниной (грамм)'] = {
        'Каша перловая с бараниной (100 грамм)':1 / 100,
        }

metadict_detail['Каша перловая с солониной (грамм)'] = {
        'Каша перловая с солониной (100 грамм)':1 / 100,
        }

metadict_detail['Каша перловая с говядиной и овощами (грамм)'] = {
        'Каша перловая с говядиной и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Каша перловая с телятиной и овощами (грамм)'] = {
        'Каша перловая с телятиной и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Каша пшённая с фруктами (грамм)'] = {
        'Каша пшённая с фруктами (100 грамм)':1 / 100,
        }

metadict_detail['Каша пшённая с изюмом (грамм)'] = {
        'Каша пшённая с изюмом (100 грамм)':1 / 100,
        }

metadict_detail['Суп из курицы с яичной заправкой (грамм)'] = {
        'Суп из курицы с яичной заправкой (100 грамм)':1 / 100,
        }

metadict_detail['Суп из баранины с чечевицей и пряностями (грамм)'] = {
        'Суп из баранины с чечевицей и пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Суп из баранины с рисом и зеленью (грамм)'] = {
        'Суп из баранины с рисом и зеленью (100 грамм)':1 / 100,
        }

metadict_detail['Суп крупяно-бобовый с грецкими орехами (грамм)'] = {
        'Суп крупяно-бобовый с грецкими орехами (100 грамм)':1 / 100,
        }

metadict_detail['Лаваш пшеничный с пряной зеленью (грамм)'] = {
        'Лаваш пшеничный с пряной зеленью (100 грамм)':1 / 100,
        }

metadict_detail['Лаваш пшеничный (грамм)'] = {
        'Лаваш пшеничный (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки пшеничные на сыворотке (грамм)'] = {
        'Лепёшки пшеничные на сыворотке (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки пшеничные с изюмом (грамм)'] = {
        'Лепёшки пшеничные с изюмом (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки пшеничные с овечьим сыром (грамм)'] = {
        'Лепёшки пшеничные с овечьим сыром (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки пшеничные с творогом (грамм)'] = {
        'Лепёшки пшеничные с творогом (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки ячменные на сыворотке (грамм)'] = {
        'Лепёшки ячменные на сыворотке (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки ячменно-пшеничные на сыворотке (грамм)'] = {
        'Лепёшки ячменно-пшеничные на сыворотке (100 грамм)':1 / 100,
        }

metadict_detail['Творог овечий (грамм)'] = {
        'Творог овечий (100 грамм)':1 / 100,
        }

metadict_detail['Творог козий (грамм)'] = {
        'Творог козий (100 грамм)':1 / 100,
        }

metadict_detail['Творог коровий (грамм)'] = {
        'Творог коровий (100 грамм)':1 / 100,
        }

metadict_detail['Сыр овечий рассольный (грамм)'] = {
        'Сыр овечий рассольный (100 грамм)':1 / 100,
        }

metadict_detail['Сыр овечий толчёный с травами (грамм)'] = {
        'Сыр овечий толчёный с травами (100 грамм)':1 / 100,
        }

metadict_detail['Сыр овечий толчёный с чесноком (грамм)'] = {
        'Сыр овечий толчёный с чесноком (100 грамм)':1 / 100,
        }

metadict_detail['Сыр коровий рассольный (грамм)'] = {
        'Сыр коровий рассольный (100 грамм)':1 / 100,
        }

metadict_detail['Сыр козий рассольный (грамм)'] = {
        'Сыр козий рассольный (100 грамм)':1 / 100,
        }

metadict_detail['Молоко козье (грамм)'] = {
        'Молоко козье (100 грамм)':1 / 100,
        }

metadict_detail['Молоко овечье (грамм)'] = {
        'Молоко овечье (100 грамм)':1 / 100,
        }

metadict_detail['Молоко коровье (грамм)'] = {
        'Молоко коровье (100 грамм)':1 / 100,
        }

metadict_detail['Масло сливочное коровье (грамм)'] = {
        'Масло сливочное коровье (100 грамм)':1 / 100,
        }

metadict_detail['Сливки коровьи (грамм)'] = {
        'Сливки коровьи (100 грамм)':1 / 100,
        }

metadict_detail['Молоко коровье снятое (грамм)'] = {
        'Молоко коровье снятое (100 грамм)':1 / 100,
        }

metadict_detail['Молоко коровье кислое (грамм)'] = {
        'Молоко коровье кислое (100 грамм)':1 / 100,
        }

metadict_detail['Пахта сливочная коровья (грамм)'] = {
        'Пахта сливочная коровья (100 грамм)':1 / 100,
        }

metadict_detail['Сыворотка творожная коровья (грамм)'] = {
        'Сыворотка творожная коровья (100 грамм)':1 / 100,
        }

metadict_detail['Сыворотка творожная овечья (грамм)'] = {
        'Сыворотка творожная овечья (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре чечевичный с пряной зеленью (грамм)'] = {
        'Суп-пюре чечевичный с пряной зеленью (100 грамм)':1 / 100,
        }

metadict_detail['Суп чечевичный на молоке (грамм)'] = {
        'Суп чечевичный на молоке (100 грамм)':1 / 100,
        }

metadict_detail['Суп чечевичный на сыворотке (грамм)'] = {
        'Суп чечевичный на сыворотке (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре нутовый с пряной зеленью (грамм)'] = {
        'Суп-пюре нутовый с пряной зеленью (100 грамм)':1 / 100,
        }

metadict_detail['Фрукты закавказские летние (грамм)'] = {
        'Фрукты закавказские летние (100 грамм)':1 / 100,
        }

metadict_detail['Фрукты мочёные североморские (грамм)'] = {
        'Фрукты мочёные североморские (100 грамм)':1 / 100,
        }

metadict_detail['Фрукты летние североморские (грамм)'] = {
        'Фрукты летние североморские (100 грамм)':1 / 100,
        }

metadict_detail['Фрукты летние среднеземные (грамм)'] = {
        'Фрукты летние среднеземные (100 грамм)':1 / 100,
        }

metadict_detail['Фрукты летние южноморские (грамм)'] = {
        'Фрукты летние южноморские (100 грамм)':1 / 100,
        }

metadict_detail['Фрукты осенние североморские (грамм)'] = {
        'Фрукты осенние североморские (100 грамм)':1 / 100,
        }

metadict_detail['Фрукты осенние среднеземные (грамм)'] = {
        'Фрукты осенние среднеземные (100 грамм)':1 / 100,
        }

metadict_detail['Фрукты осенние южноморские (грамм)'] = {
        'Фрукты осенние южноморские (100 грамм)':1 / 100,
        }

metadict_detail['Порошок асафетиды (грамм)'] = {
        'Порошок асафетиды (100 грамм)':1 / 100,
        }

metadict_detail['Асафетида (грамм)'] = {
        'Асафетида (100 грамм)':1 / 100,
        }

metadict_detail['Зелень руколы отборная (грамм)'] = {
        'Зелень руколы отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень руколы сушёная (грамм)'] = {
        'Зелень руколы сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зверобой отборный (грамм)'] = {
        'Зверобой отборный (100 грамм)':1 / 100,
        }

metadict_detail['Таволга отборная (грамм)'] = {
        'Таволга отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень чабреца отборная (грамм)'] = {
        'Зелень чабреца отборная (100 грамм)':1 / 100,
        }

metadict_detail['Лаванда отборная (грамм)'] = {
        'Лаванда отборная (100 грамм)':1 / 100,
        }

metadict_detail['Любисток отборный (грамм)'] = {
        'Любисток отборный (100 грамм)':1 / 100,
        }

metadict_detail['Любисток сушёный (грамм)'] = {
        'Любисток сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Лаванда сушёная (грамм)'] = {
        'Лаванда сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зверобой сушёный (грамм)'] = {
        'Зверобой сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Клевер сушёный (грамм)'] = {
        'Клевер сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Иссоп сушёный (грамм)'] = {
        'Иссоп сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Крапива сушёная (грамм)'] = {
        'Крапива сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень мяты сушёная (грамм)'] = {
        'Зелень мяты сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень мяты отборная (грамм)'] = {
        'Зелень мяты отборная (100 грамм)':1 / 100,
        }

metadict_detail['Ромашка сушёная (грамм)'] = {
        'Ромашка сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Кипрей сушёный (грамм)'] = {
        'Кипрей сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Таволга сушёная (грамм)'] = {
        'Таволга сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень фенхеля сушёная (грамм)'] = {
        'Зелень фенхеля сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень чабреца сушёная (грамм)'] = {
        'Зелень чабреца сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для щей (грамм)'] = {
        'Пряности для щей (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для минестроне (грамм)'] = {
        'Пряности для минестроне (100 грамм)':1 / 100,
        }

metadict_detail['Пряности букета гарни с петрушкой (грамм)'] = {
        'Пряности букета гарни с петрушкой (100 грамм)':1 / 100,
        }

metadict_detail['Пряности букета гарни с розмарином (грамм)'] = {
        'Пряности букета гарни с розмарином (100 грамм)':1 / 100,
        }

metadict_detail['Пряности прованские (грамм)'] = {
        'Пряности прованские (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для бобовых североморские (грамм)'] = {
        'Пряности для бобовых североморские (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для бобовых южноморские (грамм)'] = {
        'Пряности для бобовых южноморские (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для тыквы (грамм)'] = {
        'Пряности для тыквы (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для овощного маринада с тмином (грамм)'] = {
        'Пряности для овощного маринада с тмином (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для овощного маринада (грамм)'] = {
        'Пряности для овощного маринада (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для фруктового маринада (грамм)'] = {
        'Пряности для фруктового маринада (100 грамм)':1 / 100,
        }

metadict_detail['Пряности нежного карри (грамм)'] = {
        'Пряности нежного карри (100 грамм)':1 / 100,
        }

metadict_detail['Пряности светлого карри (грамм)'] = {
        'Пряности светлого карри (100 грамм)':1 / 100,
        }

metadict_detail['Пряности гарам масала (грамм)'] = {
        'Пряности гарам масала (100 грамм)':1 / 100,
        }

metadict_detail['Пряности чат масала (грамм)'] = {
        'Пряности чат масала (100 грамм)':1 / 100,
        }

metadict_detail['Пряности самбар масала (грамм)'] = {
        'Пряности самбар масала (100 грамм)':1 / 100,
        }

metadict_detail['Пряности чили (грамм)'] = {
        'Пряности чили (100 грамм)':1 / 100,
        }

metadict_detail['Пряности кондитерские (грамм)'] = {
        'Пряности кондитерские (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для фалафели (грамм)'] = {
        'Пряности для фалафели (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для овощей из восьми растений (грамм)'] = {
        'Пряности для овощей из восьми растений (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для овощей из трёх растений (грамм)'] = {
        'Пряности для овощей из трёх растений (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для овощей из пяти растений (грамм)'] = {
        'Пряности для овощей из пяти растений (100 грамм)':1 / 100,
        }

metadict_detail['Пряности пряничные (грамм)'] = {
        'Пряности пряничные (100 грамм)':1 / 100,
        }

metadict_detail['Пряности хмели-сунели упрощённые (грамм)'] = {
        'Пряности хмели-сунели упрощённые (100 грамм)':1 / 100,
        }

metadict_detail['Пряности хмели-сунели (грамм)'] = {
        'Пряности хмели-сунели (100 грамм)':1 / 100,
        }

metadict_detail['Лист дуба отборный (грамм)'] = {
        'Лист дуба отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лист малины отборный (грамм)'] = {
        'Лист малины отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лист малины сушёный (грамм)'] = {
        'Лист малины сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Лист шиповника отборный (грамм)'] = {
        'Лист шиповника отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лист шиповника сушёный (грамм)'] = {
        'Лист шиповника сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Лист рябины отборный (грамм)'] = {
        'Лист рябины отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лист рябины сушёный (грамм)'] = {
        'Лист рябины сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Лист винограда отборный (грамм)'] = {
        'Лист винограда отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лист вишни отборный (грамм)'] = {
        'Лист вишни отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лист вишни сушёный (грамм)'] = {
        'Лист вишни сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Лист смородины отборный (грамм)'] = {
        'Лист смородины отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лист смородины сушёный (грамм)'] = {
        'Лист смородины сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Лист лавра (грамм)'] = {
        'Лист лавра (100 грамм)':1 / 100,
        }

metadict_detail['Лист карри (грамм)'] = {
        'Лист карри (100 грамм)':1 / 100,
        }

metadict_detail['Лист карри сушёный (грамм)'] = {
        'Лист карри сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Зелень чабера отборная (грамм)'] = {
        'Зелень чабера отборная (100 грамм)':1 / 100,
        }

metadict_detail['Лист хрена отборный (грамм)'] = {
        'Лист хрена отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лебеда отборная (грамм)'] = {
        'Лебеда отборная (100 грамм)':1 / 100,
        }

metadict_detail['Сныть отборная (грамм)'] = {
        'Сныть отборная (100 грамм)':1 / 100,
        }

metadict_detail['Щавель отборный (грамм)'] = {
        'Щавель отборный (100 грамм)':1 / 100,
        }

metadict_detail['Крапива отборная (грамм)'] = {
        'Крапива отборная (100 грамм)':1 / 100,
        }

metadict_detail['Черемша отборная (грамм)'] = {
        'Черемша отборная (100 грамм)':1 / 100,
        }

metadict_detail['Шпинат отборный (грамм)'] = {
        'Шпинат отборный (100 грамм)':1 / 100,
        }

metadict_detail['Шпинат шинкованный (грамм)'] = {
        'Шпинат шинкованный (100 грамм)':1 / 100,
        }

metadict_detail['Шпинат бланшированный (грамм)'] = {
        'Шпинат бланшированный (100 грамм)':1 / 100,
        }

metadict_detail['Щавель бланшированный (грамм)'] = {
        'Щавель бланшированный (100 грамм)':1 / 100,
        }

metadict_detail['Крапива бланшированная (грамм)'] = {
        'Крапива бланшированная (100 грамм)':1 / 100,
        }

metadict_detail['Черемша бланшированная (грамм)'] = {
        'Черемша бланшированная (100 грамм)':1 / 100,
        }

metadict_detail['Лебеда бланшированная (грамм)'] = {
        'Лебеда бланшированная (100 грамм)':1 / 100,
        }

metadict_detail['Сныть бланшированная (грамм)'] = {
        'Сныть бланшированная (100 грамм)':1 / 100,
        }

metadict_detail['Бадьян сушёный (грамм)'] = {
        'Бадьян сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Шафран сушёный (грамм)'] = {
        'Шафран сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Зелень весенняя с пряным соусом (грамм)'] = {
        'Зелень весенняя с пряным соусом (100 грамм)':1 / 100,
        }

metadict_detail['Зелень весенняя бланшированная шинкованная (грамм)'] = {
        'Зелень весенняя бланшированная шинкованная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень пряная шинкованная (грамм)'] = {
        'Зелень пряная шинкованная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень пряная сушёная (грамм)'] = {
        'Зелень пряная сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень мелиссы отборная (грамм)'] = {
        'Зелень мелиссы отборная (100 грамм)':1 / 100,
        }

metadict_detail['Мелисса сушёная (грамм)'] = {
        'Мелисса сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень кервеля отборная (грамм)'] = {
        'Зелень кервеля отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень базилика отборная (грамм)'] = {
        'Зелень базилика отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень базилика шинкованная (грамм)'] = {
        'Зелень базилика шинкованная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень базилика сушёная (грамм)'] = {
        'Зелень базилика сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Орегано сушёный (грамм)'] = {
        'Орегано сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Зелень петрушки сушёная (грамм)'] = {
        'Зелень петрушки сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень петрушки отборная (грамм)'] = {
        'Зелень петрушки отборная (100 грамм)':1 / 100,
        }

metadict_detail['Луковица фенхеля чищеная (грамм)'] = {
        'Луковица фенхеля чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Фенхель маринованный (грамм)'] = {
        'Фенхель маринованный (100 грамм)':1 / 100,
        }

metadict_detail['Зелень фенхеля отборная (грамм)'] = {
        'Зелень фенхеля отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень сельдерея отборная (грамм)'] = {
        'Зелень сельдерея отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень сельдерея сушёная (грамм)'] = {
        'Зелень сельдерея сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Черешок сельдерея чищеный (грамм)'] = {
        'Черешок сельдерея чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Черешок сельдерея шинкованный (грамм)'] = {
        'Черешок сельдерея шинкованный (100 грамм)':1 / 100,
        }

metadict_detail['Черешок сельдерея варёный (грамм)'] = {
        'Черешок сельдерея варёный (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея чищеный (грамм)'] = {
        'Корень сельдерея чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея шинкованный (грамм)'] = {
        'Корень сельдерея шинкованный (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея обжаренный (грамм)'] = {
        'Корень сельдерея обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея варёный (грамм)'] = {
        'Корень сельдерея варёный (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея тушёный с морковью (грамм)'] = {
        'Корень сельдерея тушёный с морковью (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея жареный брусками во фритюре (грамм)'] = {
        'Корень сельдерея жареный брусками во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея печёный с соевым соусом (грамм)'] = {
        'Корень сельдерея печёный с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Корень куркумы (грамм)'] = {
        'Корень куркумы (100 грамм)':1 / 100,
        }

metadict_detail['Корень пастернака чищеный (грамм)'] = {
        'Корень пастернака чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Корень пастернака обжаренный (грамм)'] = {
        'Корень пастернака обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Семена подсолнечника (грамм)'] = {
        'Семена подсолнечника (100 грамм)':1 / 100,
        }

metadict_detail['Семена мака (грамм)'] = {
        'Семена мака (100 грамм)':1 / 100,
        }

metadict_detail['Семена льна (грамм)'] = {
        'Семена льна (100 грамм)':1 / 100,
        }

metadict_detail['Семена конопли (грамм)'] = {
        'Семена конопли (100 грамм)':1 / 100,
        }

metadict_detail['Семена аниса (грамм)'] = {
        'Семена аниса (100 грамм)':1 / 100,
        }

metadict_detail['Семена кардамона (грамм)'] = {
        'Семена кардамона (100 грамм)':1 / 100,
        }

metadict_detail['Семена кориандра (грамм)'] = {
        'Семена кориандра (100 грамм)':1 / 100,
        }

metadict_detail['Семена кунжута (грамм)'] = {
        'Семена кунжута (100 грамм)':1 / 100,
        }

metadict_detail['Зелень кориандра отборная (грамм)'] = {
        'Зелень кориандра отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень кориандра сушёная (грамм)'] = {
        'Зелень кориандра сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень фенугрека отборная (грамм)'] = {
        'Зелень фенугрека отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень фенугрека сушёная (грамм)'] = {
        'Зелень фенугрека сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Семена фенхеля (грамм)'] = {
        'Семена фенхеля (100 грамм)':1 / 100,
        }

metadict_detail['Семена фенугрека (грамм)'] = {
        'Семена фенугрека (100 грамм)':1 / 100,
        }

metadict_detail['Тимьян сушёный (грамм)'] = {
        'Тимьян сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Майоран сушёный (грамм)'] = {
        'Майоран сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Розмарин сушёный (грамм)'] = {
        'Розмарин сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Шалфей сушёный (грамм)'] = {
        'Шалфей сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Цедра лимонная (грамм)'] = {
        'Цедра лимонная (100 грамм)':1 / 100,
        }

metadict_detail['Корень хрена чищеный (грамм)'] = {
        'Корень хрена чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Хрен тёртый (грамм)'] = {
        'Хрен тёртый (100 грамм)':1 / 100,
        }

metadict_detail['Корень петрушки чищеный (грамм)'] = {
        'Корень петрушки чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Спаржа чищеная (грамм)'] = {
        'Спаржа чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень эстрагона отборная (грамм)'] = {
        'Зелень эстрагона отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень эстрагона сушёная (грамм)'] = {
        'Зелень эстрагона сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Ревень отборный (грамм)'] = {
        'Ревень отборный (100 грамм)':1 / 100,
        }

metadict_detail['Ревень бланшированный (грамм)'] = {
        'Ревень бланшированный (100 грамм)':1 / 100,
        }

metadict_detail['Зелень укропа отборная (грамм)'] = {
        'Зелень укропа отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень укропа сушёная (грамм)'] = {
        'Зелень укропа сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень чабера сушёная (грамм)'] = {
        'Зелень чабера сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Кофе молотый (грамм)'] = {
        'Кофе молотый (100 грамм)':1 / 100,
        }

metadict_detail['Кофе (грамм)'] = {
        'Кофе (100 грамм)':1 / 100,
        }

metadict_detail['Культура грибов коджи (грамм)'] = {
        'Культура грибов коджи (100 грамм)':1 / 100,
        }

metadict_detail['Культура грибов для темпе (грамм)'] = {
        'Культура грибов для темпе (100 грамм)':1 / 100,
        }

metadict_detail['Солод пшеничный (грамм)'] = {
        'Солод пшеничный (100 грамм)':1 / 100,
        }

metadict_detail['Солод ржаной (грамм)'] = {
        'Солод ржаной (100 грамм)':1 / 100,
        }

metadict_detail['Солод ячменный (грамм)'] = {
        'Солод ячменный (100 грамм)':1 / 100,
        }

metadict_detail['Порошок горчичный (грамм)'] = {
        'Порошок горчичный (100 грамм)':1 / 100,
        }

metadict_detail['Горчица столовая (грамм)'] = {
        'Горчица столовая (100 грамм)':1 / 100,
        }

metadict_detail['Горчица медовая (грамм)'] = {
        'Горчица медовая (100 грамм)':1 / 100,
        }

metadict_detail['Крем маслено-горчичный (грамм)'] = {
        'Крем маслено-горчичный (100 грамм)':1 / 100,
        }

metadict_detail['Гвоздика сушёная (грамм)'] = {
        'Гвоздика сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Перец острый отборный (грамм)'] = {
        'Перец острый отборный (100 грамм)':1 / 100,
        }

metadict_detail['Перец острый молотый (грамм)'] = {
        'Перец острый молотый (100 грамм)':1 / 100,
        }

metadict_detail['Перец острый сушёный (грамм)'] = {
        'Перец острый сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Паприка сушёная (грамм)'] = {
        'Паприка сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Паприка молотая (грамм)'] = {
        'Паприка молотая (100 грамм)':1 / 100,
        }

metadict_detail['Кардамон молотый (грамм)'] = {
        'Кардамон молотый (100 грамм)':1 / 100,
        }

metadict_detail['Перец чёрный молотый (грамм)'] = {
        'Перец чёрный молотый (100 грамм)':1 / 100,
        }

metadict_detail['Перец чёрный сушёный (грамм)'] = {
        'Перец чёрный сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Перец душистый молотый (грамм)'] = {
        'Перец душистый молотый (100 грамм)':1 / 100,
        }

metadict_detail['Перец душистый сушёный (грамм)'] = {
        'Перец душистый сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Корица молотая (грамм)'] = {
        'Корица молотая (100 грамм)':1 / 100,
        }

metadict_detail['Корица палочкой (грамм)'] = {
        'Корица палочкой (100 грамм)':1 / 100,
        }

metadict_detail['Корень имбиря отборный (грамм)'] = {
        'Корень имбиря отборный (100 грамм)':1 / 100,
        }

metadict_detail['Корень имбиря шинкованный (грамм)'] = {
        'Корень имбиря шинкованный (100 грамм)':1 / 100,
        }

metadict_detail['Орех грецкий чищенный (грамм)'] = {
        'Орех грецкий чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Орех грецкий толчёный (грамм)'] = {
        'Орех грецкий толчёный (100 грамм)':1 / 100,
        }

metadict_detail['Орех грецкий шинкованный (грамм)'] = {
        'Орех грецкий шинкованный (100 грамм)':1 / 100,
        }

metadict_detail['Орех грецкий шинкованный обжаренный (грамм)'] = {
        'Орех грецкий шинкованный обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Орех мускатный (грамм)'] = {
        'Орех мускатный (100 грамм)':1 / 100,
        }

metadict_detail['Цвет мускатный (грамм)'] = {
        'Цвет мускатный (100 грамм)':1 / 100,
        }

metadict_detail['Орех кешью чищенный (грамм)'] = {
        'Орех кешью чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Орех кешью обжаренный (грамм)'] = {
        'Орех кешью обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Фисташки чищеные (грамм)'] = {
        'Фисташки чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Фисташки обжаренные (грамм)'] = {
        'Фисташки обжаренные (100 грамм)':1 / 100,
        }

metadict_detail['Каштан чищеный (грамм)'] = {
        'Каштан чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Орех карии чищенный (грамм)'] = {
        'Орех карии чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Орех пекана чищенный (грамм)'] = {
        'Орех пекана чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Миндаль чищенный (грамм)'] = {
        'Миндаль чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Миндаль обжаренный (грамм)'] = {
        'Миндаль обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Миндаль замоченный (грамм)'] = {
        'Миндаль замоченный (100 грамм)':1 / 100,
        }

metadict_detail['Мука миндальная (грамм)'] = {
        'Мука миндальная (100 грамм)':1 / 100,
        }

metadict_detail['Орешки кедровые (грамм)'] = {
        'Орешки кедровые (100 грамм)':1 / 100,
        }

metadict_detail['Ваниль сушёная (грамм)'] = {
        'Ваниль сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Семена тмина (грамм)'] = {
        'Семена тмина (100 грамм)':1 / 100,
        }

metadict_detail['Семена горчицы белой (грамм)'] = {
        'Семена горчицы белой (100 грамм)':1 / 100,
        }

metadict_detail['Семена горчицы коричневой (грамм)'] = {
        'Семена горчицы коричневой (100 грамм)':1 / 100,
        }

metadict_detail['Семена зиры (грамм)'] = {
        'Семена зиры (100 грамм)':1 / 100,
        }

metadict_detail['Травяной сбор (грамм)'] = {
        'Травяной сбор (100 грамм)':1 / 100,
        }

metadict_detail['Лист лавра сушёный (грамм)'] = {
        'Лист лавра сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Вёшенки отборные (грамм)'] = {
        'Вёшенки отборные (100 грамм)':1 / 100,
        }

metadict_detail['Вёшенки варёные (грамм)'] = {
        'Вёшенки варёные (100 грамм)':1 / 100,
        }

metadict_detail['Вёшенки тушёные (грамм)'] = {
        'Вёшенки тушёные (100 грамм)':1 / 100,
        }

metadict_detail['Вёшенки обжаренные (грамм)'] = {
        'Вёшенки обжаренные (100 грамм)':1 / 100,
        }

metadict_detail['Вёшенки обжаренные с соевым соусом (грамм)'] = {
        'Вёшенки обжаренные с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны чищеные (грамм)'] = {
        'Шампиньоны чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны варёные (грамм)'] = {
        'Шампиньоны варёные (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны обжаренные (грамм)'] = {
        'Шампиньоны обжаренные (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны тушёные (грамм)'] = {
        'Шампиньоны тушёные (100 грамм)':1 / 100,
        }

metadict_detail['Рагу овощное с шампиньонами (грамм)'] = {
        'Рагу овощное с шампиньонами (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны тушёные консервированные (грамм)'] = {
        'Шампиньоны тушёные консервированные (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны жареные с луком (грамм)'] = {
        'Шампиньоны жареные с луком (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны запечённые (грамм)'] = {
        'Шампиньоны запечённые (100 грамм)':1 / 100,
        }

metadict_detail['Соус томатный (грамм)'] = {
        'Соус томатный (100 грамм)':1 / 100,
        }

metadict_detail['Пюре томатное с луком и кешью (грамм)'] = {
        'Пюре томатное с луком и кешью (100 грамм)':1 / 100,
        }

metadict_detail['Соус кабачковый (грамм)'] = {
        'Соус кабачковый (100 грамм)':1 / 100,
        }

metadict_detail['Лютеница (грамм)'] = {
        'Лютеница (100 грамм)':1 / 100,
        }

metadict_detail['Лютеница консервированная (грамм)'] = {
        'Лютеница консервированная (100 грамм)':1 / 100,
        }

metadict_detail['Соус алычовый (грамм)'] = {
        'Соус алычовый (100 грамм)':1 / 100,
        }

metadict_detail['Соус пряный с грецкими орехами (грамм)'] = {
        'Соус пряный с грецкими орехами (100 грамм)':1 / 100,
        }

metadict_detail['Соус финиковый (грамм)'] = {
        'Соус финиковый (100 грамм)':1 / 100,
        }

metadict_detail['Соус соевый (грамм)'] = {
        'Соус соевый (100 грамм)':1 / 100,
        }

metadict_detail['Соус арахисовый острый (грамм)'] = {
        'Соус арахисовый острый (100 грамм)':1 / 100,
        }

metadict_detail['Соус томатный консервированный (грамм)'] = {
        'Соус томатный консервированный (100 грамм)':1 / 100,
        }

metadict_detail['Соус баклажанный (грамм)'] = {
        'Соус баклажанный (100 грамм)':1 / 100,
        }

metadict_detail['Соус баклажанный консервированный (грамм)'] = {
        'Соус баклажанный консервированный (100 грамм)':1 / 100,
        }

metadict_detail['Соус песто с томатами (грамм)'] = {
        'Соус песто с томатами (100 грамм)':1 / 100,
        }

metadict_detail['Соус песто с томатами консервированный (грамм)'] = {
        'Соус песто с томатами консервированный (100 грамм)':1 / 100,
        }

metadict_detail['Соус песто с темпе (грамм)'] = {
        'Соус песто с темпе (100 грамм)':1 / 100,
        }

metadict_detail['Соус песто с темпе консервированный (грамм)'] = {
        'Соус песто с темпе консервированный (100 грамм)':1 / 100,
        }

metadict_detail['Боровики сушёные (грамм)'] = {
        'Боровики сушёные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики замоченные (грамм)'] = {
        'Боровики замоченные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики чищеные (грамм)'] = {
        'Боровики чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики солёные (грамм)'] = {
        'Боровики солёные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики маринованные (грамм)'] = {
        'Боровики маринованные (100 грамм)':1 / 100,
        }

metadict_detail['Закуска из боровиков с луком (грамм)'] = {
        'Закуска из боровиков с луком (100 грамм)':1 / 100,
        }

metadict_detail['Боровики варёные (грамм)'] = {
        'Боровики варёные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики жареные с луком (грамм)'] = {
        'Боровики жареные с луком (100 грамм)':1 / 100,
        }

metadict_detail['Боровики обжаренные (грамм)'] = {
        'Боровики обжаренные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики обжаренные с тимьяном (грамм)'] = {
        'Боровики обжаренные с тимьяном (100 грамм)':1 / 100,
        }

metadict_detail['Боровики тушёные (грамм)'] = {
        'Боровики тушёные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики тушёные замоченные (грамм)'] = {
        'Боровики тушёные замоченные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики тушёные в вине (грамм)'] = {
        'Боровики тушёные в вине (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки сушёные (грамм)'] = {
        'Сморчки сушёные (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки варёные (грамм)'] = {
        'Сморчки варёные (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки обжаренные (грамм)'] = {
        'Сморчки обжаренные (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки тушёные (грамм)'] = {
        'Сморчки тушёные (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки отборные (грамм)'] = {
        'Сморчки отборные (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки жареные во фритюре (грамм)'] = {
        'Сморчки жареные во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки жареные с луком (грамм)'] = {
        'Сморчки жареные с луком (100 грамм)':1 / 100,
        }

metadict_detail['Сушёные чайные листья (грамм)'] = {
        'Сушёные чайные листья (100 грамм)':1 / 100,
        }

metadict_detail['Соль поваренная (грамм)'] = {
        'Соль поваренная (100 грамм)':1 / 100,
        }

metadict_detail['Соль чёрная (грамм)'] = {
        'Соль чёрная (100 грамм)':1 / 100,
        }

metadict_detail['Сода пищевая (грамм)'] = {
        'Сода пищевая (100 грамм)':1 / 100,
        }

metadict_detail['Агар-агар (грамм)'] = {
        'Агар-агар (100 грамм)':1 / 100,
        }

metadict_detail['Раствор крахмальный 10% (грамм)'] = {
        'Раствор крахмальный 10% (100 грамм)':1 / 100,
        }

metadict_detail['Арахис сухой (грамм)'] = {
        'Арахис сухой (100 грамм)':1 / 100,
        }

metadict_detail['Арахис замоченный (грамм)'] = {
        'Арахис замоченный (100 грамм)':1 / 100,
        }

metadict_detail['Бобы арахиса в шелухе (грамм)'] = {
        'Бобы арахиса в шелухе (100 грамм)':1 / 100,
        }

metadict_detail['Арахис обжаренный (грамм)'] = {
        'Арахис обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Арахис варёный (грамм)'] = {
        'Арахис варёный (100 грамм)':1 / 100,
        }

metadict_detail['Сухофрукты североморский замоченные (грамм)'] = {
        'Сухофрукты североморский замоченные (100 грамм)':1 / 100,
        }

metadict_detail['Сухофрукты североморские (грамм)'] = {
        'Сухофрукты североморские (100 грамм)':1 / 100,
        }

metadict_detail['Сухофрукты среднеземные (грамм)'] = {
        'Сухофрукты среднеземные (100 грамм)':1 / 100,
        }

metadict_detail['Виноград сушёный (грамм)'] = {
        'Виноград сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Черника сушёная (грамм)'] = {
        'Черника сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Смородина сушёная (грамм)'] = {
        'Смородина сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко сушёное (грамм)'] = {
        'Яблоко сушёное (100 грамм)':1 / 100,
        }

metadict_detail['Вишня сушёная (грамм)'] = {
        'Вишня сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Персик сушёный (грамм)'] = {
        'Персик сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Абрикос сушёный (грамм)'] = {
        'Абрикос сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Слива сушёная (грамм)'] = {
        'Слива сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Груша сушёная (грамм)'] = {
        'Груша сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень укропа сушёная (грамм)'] = {
        'Зелень укропа сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Трава луговая (грамм)'] = {
        'Трава луговая (100 грамм)':1 / 100,
        }

metadict_detail['Трава луговая для овец (грамм)'] = {
        'Трава луговая для овец (100 грамм)':1 / 100,
        }

metadict_detail['Сено луговое (грамм)'] = {
        'Сено луговое (100 грамм)':1 / 100,
        }

metadict_detail['Зерно пшеницы (грамм)'] = {
        'Зерно пшеницы (100 грамм)':1 / 100,
        }

metadict_detail['Крупа пшеничная варёная (грамм)'] = {
        'Крупа пшеничная варёная (100 грамм)':1 / 100,
        }

metadict_detail['Зерно овса (грамм)'] = {
        'Зерно овса (100 грамм)':1 / 100,
        }

metadict_detail['Зерно ячменя (грамм)'] = {
        'Зерно ячменя (100 грамм)':1 / 100,
        }

metadict_detail['Зерно просо (грамм)'] = {
        'Зерно просо (100 грамм)':1 / 100,
        }

metadict_detail['Зерно ржи (грамм)'] = {
        'Зерно ржи (100 грамм)':1 / 100,
        }

metadict_detail['Мука пшеничная (грамм)'] = {
        'Мука пшеничная (100 грамм)':1 / 100,
        }

metadict_detail['Мука пшеничная прокаленная (грамм)'] = {
        'Мука пшеничная прокаленная (100 грамм)':1 / 100,
        }

metadict_detail['Мука панировочная (грамм)'] = {
        'Мука панировочная (100 грамм)':1 / 100,
        }

metadict_detail['Мука чечевичная (грамм)'] = {
        'Мука чечевичная (100 грамм)':1 / 100,
        }

metadict_detail['Мука рисовая (грамм)'] = {
        'Мука рисовая (100 грамм)':1 / 100,
        }

metadict_detail['Мука кукурузная (грамм)'] = {
        'Мука кукурузная (100 грамм)':1 / 100,
        }

metadict_detail['Мука гречневая (грамм)'] = {
        'Мука гречневая (100 грамм)':1 / 100,
        }

metadict_detail['Мука гороховая (грамм)'] = {
        'Мука гороховая (100 грамм)':1 / 100,
        }

metadict_detail['Мука ячменная (грамм)'] = {
        'Мука ячменная (100 грамм)':1 / 100,
        }

metadict_detail['Мука просяная (грамм)'] = {
        'Мука просяная (100 грамм)':1 / 100,
        }

metadict_detail['Мука ржаная (грамм)'] = {
        'Мука ржаная (100 грамм)':1 / 100,
        }

metadict_detail['Мука овсяная (грамм)'] = {
        'Мука овсяная (100 грамм)':1 / 100,
        }

metadict_detail['Мука соевая (грамм)'] = {
        'Мука соевая (100 грамм)':1 / 100,
        }

metadict_detail['Темпе (грамм)'] = {
        'Темпе (100 грамм)':1 / 100,
        }

metadict_detail['Темпе обжаренный (грамм)'] = {
        'Темпе обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Соя варёная (грамм)'] = {
        'Соя варёная (100 грамм)':1 / 100,
        }

metadict_detail['Соя замоченная (грамм)'] = {
        'Соя замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Мука льняная (грамм)'] = {
        'Мука льняная (100 грамм)':1 / 100,
        }

metadict_detail['Крупа овсяная (грамм)'] = {
        'Крупа овсяная (100 грамм)':1 / 100,
        }

metadict_detail['Зерно кукурузы (грамм)'] = {
        'Зерно кукурузы (100 грамм)':1 / 100,
        }

metadict_detail['Крупа кукурузная (грамм)'] = {
        'Крупа кукурузная (100 грамм)':1 / 100,
        }

metadict_detail['Крупа гречневая (грамм)'] = {
        'Крупа гречневая (100 грамм)':1 / 100,
        }

metadict_detail['Крупа гречневая прокаленная (грамм)'] = {
        'Крупа гречневая прокаленная (100 грамм)':1 / 100,
        }

metadict_detail['Крупа пшённая (грамм)'] = {
        'Крупа пшённая (100 грамм)':1 / 100,
        }

metadict_detail['Крупа пшённая промытая (грамм)'] = {
        'Крупа пшённая промытая (100 грамм)':1 / 100,
        }

metadict_detail['Продел гречневый (грамм)'] = {
        'Продел гречневый (100 грамм)':1 / 100,
        }

metadict_detail['Крупа ячневая (грамм)'] = {
        'Крупа ячневая (100 грамм)':1 / 100,
        }

metadict_detail['Крупа ячневая промытая (грамм)'] = {
        'Крупа ячневая промытая (100 грамм)':1 / 100,
        }

metadict_detail['Крупа ячневая замоченная (грамм)'] = {
        'Крупа ячневая замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Крупа перловая (грамм)'] = {
        'Крупа перловая (100 грамм)':1 / 100,
        }

metadict_detail['Крупа пшеничная (грамм)'] = {
        'Крупа пшеничная (100 грамм)':1 / 100,
        }

metadict_detail['Крупа пшеничная замоченная (грамм)'] = {
        'Крупа пшеничная замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Крупа перловая замоченная (грамм)'] = {
        'Крупа перловая замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Крупа перловая замоченная прокаленная (грамм)'] = {
        'Крупа перловая замоченная прокаленная (100 грамм)':1 / 100,
        }

metadict_detail['Крупа пшённая замоченная (грамм)'] = {
        'Крупа пшённая замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Просо замоченное (грамм)'] = {
        'Просо замоченное (100 грамм)':1 / 100,
        }

metadict_detail['Пшено варёное (грамм)'] = {
        'Пшено варёное (100 грамм)':1 / 100,
        }

metadict_detail['Зерно риса посевного (грамм)'] = {
        'Зерно риса посевного (100 грамм)':1 / 100,
        }

metadict_detail['Рис нешлифованный (грамм)'] = {
        'Рис нешлифованный (100 грамм)':1 / 100,
        }

metadict_detail['Рис прокаленный (грамм)'] = {
        'Рис прокаленный (100 грамм)':1 / 100,
        }

metadict_detail['Рис замоченный (грамм)'] = {
        'Рис замоченный (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный (грамм)'] = {
        'Рис варёный (100 грамм)':1 / 100,
        }

metadict_detail['Рис тушёный с боровиками (грамм)'] = {
        'Рис тушёный с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Рис тушёный с овощами (грамм)'] = {
        'Рис тушёный с овощами (100 грамм)':1 / 100,
        }

metadict_detail['Рис тушёный с овощами и шампиньонами (грамм)'] = {
        'Рис тушёный с овощами и шампиньонами (100 грамм)':1 / 100,
        }

metadict_detail['Рис тушёный со свекольным кремом (грамм)'] = {
        'Рис тушёный со свекольным кремом (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный с соевым соусом (грамм)'] = {
        'Рис варёный с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный с томатным соусом (грамм)'] = {
        'Рис варёный с томатным соусом (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный с консервированными овощами (грамм)'] = {
        'Рис варёный с консервированными овощами (100 грамм)':1 / 100,
        }

metadict_detail['Рис тушёный с вёшенками и овощами (грамм)'] = {
        'Рис тушёный с вёшенками и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Рис тушёный с фасолью (грамм)'] = {
        'Рис тушёный с фасолью (100 грамм)':1 / 100,
        }

metadict_detail['Рис тушёный с сельдереем и кукурузой (грамм)'] = {
        'Рис тушёный с сельдереем и кукурузой (100 грамм)':1 / 100,
        }

metadict_detail['Рис тушёный с тыквой и кукурузой (грамм)'] = {
        'Рис тушёный с тыквой и кукурузой (100 грамм)':1 / 100,
        }

metadict_detail['Рис обжарено-варёный (грамм)'] = {
        'Рис обжарено-варёный (100 грамм)':1 / 100,
        }

metadict_detail['Рис тушёный с чечевицей и луком (грамм)'] = {
        'Рис тушёный с чечевицей и луком (100 грамм)':1 / 100,
        }

metadict_detail['Рис обжаренный с квашеной капустой (грамм)'] = {
        'Рис обжаренный с квашеной капустой (100 грамм)':1 / 100,
        }

metadict_detail['Рис обжаренный с капустой и спаржей (грамм)'] = {
        'Рис обжаренный с капустой и спаржей (100 грамм)':1 / 100,
        }

metadict_detail['Рис обжаренный с капустой и овощами (грамм)'] = {
        'Рис обжаренный с капустой и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Рис обжаренный с капустой и грибами (грамм)'] = {
        'Рис обжаренный с капустой и грибами (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль стручковая варёная (грамм)'] = {
        'Фасоль стручковая варёная (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль стручковая тушёная (грамм)'] = {
        'Фасоль стручковая тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль стручковая отборная (грамм)'] = {
        'Фасоль стручковая отборная (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль сухая (грамм)'] = {
        'Фасоль сухая (100 грамм)':1 / 100,
        }

metadict_detail['Урд сухой (грамм)'] = {
        'Урд сухой (100 грамм)':1 / 100,
        }

metadict_detail['Урд замоченный (грамм)'] = {
        'Урд замоченный (100 грамм)':1 / 100,
        }

metadict_detail['Чечевица сухая (грамм)'] = {
        'Чечевица сухая (100 грамм)':1 / 100,
        }

metadict_detail['Чечевица замоченная (грамм)'] = {
        'Чечевица замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Чечевица варёная (грамм)'] = {
        'Чечевица варёная (100 грамм)':1 / 100,
        }

metadict_detail['Чечевица тушёная (грамм)'] = {
        'Чечевица тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Горох сухой (грамм)'] = {
        'Горох сухой (100 грамм)':1 / 100,
        }

metadict_detail['Горох варёный (грамм)'] = {
        'Горох варёный (100 грамм)':1 / 100,
        }

metadict_detail['Горох замоченный (грамм)'] = {
        'Горох замоченный (100 грамм)':1 / 100,
        }

metadict_detail['Горошек зелёный (грамм)'] = {
        'Горошек зелёный (100 грамм)':1 / 100,
        }

metadict_detail['Нут тушёный с томатами и пряностями (грамм)'] = {
        'Нут тушёный с томатами и пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Нут варёный (грамм)'] = {
        'Нут варёный (100 грамм)':1 / 100,
        }

metadict_detail['Нут замоченный (грамм)'] = {
        'Нут замоченный (100 грамм)':1 / 100,
        }

metadict_detail['Нут сухой (грамм)'] = {
        'Нут сухой (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль замоченная (грамм)'] = {
        'Фасоль замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль свежая (грамм)'] = {
        'Фасоль свежая (100 грамм)':1 / 100,
        }

metadict_detail['Соя сухая шлифованная (грамм)'] = {
        'Соя сухая шлифованная (100 грамм)':1 / 100,
        }

metadict_detail['Ростки соевые (грамм)'] = {
        'Ростки соевые (100 грамм)':1 / 100,
        }

metadict_detail['Брокколи чищеная (грамм)'] = {
        'Брокколи чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Брокколи бланшированная (грамм)'] = {
        'Брокколи бланшированная (100 грамм)':1 / 100,
        }

metadict_detail['Брокколи обжаренная (грамм)'] = {
        'Брокколи обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Ромашка отборная (грамм)'] = {
        'Ромашка отборная (100 грамм)':1 / 100,
        }

metadict_detail['Кипрей отборный (грамм)'] = {
        'Кипрей отборный (100 грамм)':1 / 100,
        }

metadict_detail['Клевер отборный (грамм)'] = {
        'Клевер отборный (100 грамм)':1 / 100,
        }

metadict_detail['Иссоп отборный (грамм)'] = {
        'Иссоп отборный (100 грамм)':1 / 100,
        }

metadict_detail['Одуванчик чищеный (грамм)'] = {
        'Одуванчик чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Спаржа бланшированная (грамм)'] = {
        'Спаржа бланшированная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень бланшированная для щей (грамм)'] = {
        'Зелень бланшированная для щей (100 грамм)':1 / 100,
        }

metadict_detail['Зелень одуванчика бланшированная (грамм)'] = {
        'Зелень одуванчика бланшированная (100 грамм)':1 / 100,
        }

metadict_detail['Одуванчики жареные во фритюре (грамм)'] = {
        'Одуванчики жареные во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Одуванчик сушёный (грамм)'] = {
        'Одуванчик сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Батат чищеный (грамм)'] = {
        'Батат чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Каштан печёный (грамм)'] = {
        'Каштан печёный (100 грамм)':1 / 100,
        }

metadict_detail['Батат печёный (грамм)'] = {
        'Батат печёный (100 грамм)':1 / 100,
        }

metadict_detail['Батат обжаренный (грамм)'] = {
        'Батат обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Батат печёный в медовой глазури (грамм)'] = {
        'Батат печёный в медовой глазури (100 грамм)':1 / 100,
        }

metadict_detail['Батат печёный со шпинатом и соевым соусом (грамм)'] = {
        'Батат печёный со шпинатом и соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Батат печёный дольками (грамм)'] = {
        'Батат печёный дольками (100 грамм)':1 / 100,
        }

metadict_detail['Топинамбур чищеный (грамм)'] = {
        'Топинамбур чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Топинамбур печёный (грамм)'] = {
        'Топинамбур печёный (100 грамм)':1 / 100,
        }

metadict_detail['Топинамбур печёный дольками (грамм)'] = {
        'Топинамбур печёный дольками (100 грамм)':1 / 100,
        }

metadict_detail['Топинамбур тушёный с фасолью (грамм)'] = {
        'Топинамбур тушёный с фасолью (100 грамм)':1 / 100,
        }

metadict_detail['Топинамбур тушёный с боровиками (грамм)'] = {
        'Топинамбур тушёный с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Топинамбур печёный с чесноком (грамм)'] = {
        'Топинамбур печёный с чесноком (100 грамм)':1 / 100,
        }

metadict_detail['Топинамбур печёный со спаржей (грамм)'] = {
        'Топинамбур печёный со спаржей (100 грамм)':1 / 100,
        }

metadict_detail['Пастернак печёный дольками (грамм)'] = {
        'Пастернак печёный дольками (100 грамм)':1 / 100,
        }

metadict_detail['Пастернак запечённый с томатами (грамм)'] = {
        'Пастернак запечённый с томатами (100 грамм)':1 / 100,
        }

metadict_detail['Пастернак варёный (грамм)'] = {
        'Пастернак варёный (100 грамм)':1 / 100,
        }

metadict_detail['Пастернак бланшированный (грамм)'] = {
        'Пастернак бланшированный (100 грамм)':1 / 100,
        }

metadict_detail['Турнепс чищеный (грамм)'] = {
        'Турнепс чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Турнепс варёный (грамм)'] = {
        'Турнепс варёный (100 грамм)':1 / 100,
        }

metadict_detail['Турнепс тушёный с капустой (грамм)'] = {
        'Турнепс тушёный с капустой (100 грамм)':1 / 100,
        }

metadict_detail['Крахмал (грамм)'] = {
        'Крахмал (100 грамм)':1 / 100,
        }

metadict_detail['Крахмал картофельный (грамм)'] = {
        'Крахмал картофельный (100 грамм)':1 / 100,
        }

metadict_detail['Картофель чищеный (грамм)'] = {
        'Картофель чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный с морковью (грамм)'] = {
        'Картофель тушёный с морковью (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный с боровиками (грамм)'] = {
        'Картофель тушёный с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный в соевом соусе (грамм)'] = {
        'Картофель тушёный в соевом соусе (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный с горошком и пряностями (грамм)'] = {
        'Картофель тушёный с горошком и пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный с оливками и лимоном (грамм)'] = {
        'Картофель тушёный с оливками и лимоном (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный с яблоками (грамм)'] = {
        'Картофель тушёный с яблоками (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный со спаржей (грамм)'] = {
        'Картофель тушёный со спаржей (100 грамм)':1 / 100,
        }

metadict_detail['Картофель варёный (грамм)'] = {
        'Картофель варёный (100 грамм)':1 / 100,
        }

metadict_detail['Картофель бланшированный (грамм)'] = {
        'Картофель бланшированный (100 грамм)':1 / 100,
        }

metadict_detail['Картофель жареный кусками во фритюре (грамм)'] = {
        'Картофель жареный кусками во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Картофель жареный в томатном соусе (грамм)'] = {
        'Картофель жареный в томатном соусе (100 грамм)':1 / 100,
        }

metadict_detail['Картофель жареный брусками во фритюре (грамм)'] = {
        'Картофель жареный брусками во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Картофель печёный (грамм)'] = {
        'Картофель печёный (100 грамм)':1 / 100,
        }

metadict_detail['Картофель печёный с розмарином (грамм)'] = {
        'Картофель печёный с розмарином (100 грамм)':1 / 100,
        }

metadict_detail['Картофель печёный дольками (грамм)'] = {
        'Картофель печёный дольками (100 грамм)':1 / 100,
        }

metadict_detail['Запеканка бататная с курагой (грамм)'] = {
        'Запеканка бататная с курагой (100 грамм)':1 / 100,
        }

metadict_detail['Запеканка картофельная с луком и капустой (грамм)'] = {
        'Запеканка картофельная с луком и капустой (100 грамм)':1 / 100,
        }

metadict_detail['Запеканка картофельная с боровиками (грамм)'] = {
        'Запеканка картофельная с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Запеканка картофельная со свёклой (грамм)'] = {
        'Запеканка картофельная со свёклой (100 грамм)':1 / 100,
        }

metadict_detail['Шарики картофельные жареные во фритюре (грамм)'] = {
        'Шарики картофельные жареные во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Шарики овощные жареные во фритюре (грамм)'] = {
        'Шарики овощные жареные во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Шарики нутовые жареные во фритюре (грамм)'] = {
        'Шарики нутовые жареные во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Шарики фасолевые жареные во фритюре (грамм)'] = {
        'Шарики фасолевые жареные во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Шарики чечевичные жареные во фритюре (грамм)'] = {
        'Шарики чечевичные жареные во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки ржаные с жареным луком (грамм)'] = {
        'Лепёшки ржаные с жареным луком (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла чищеная (грамм)'] = {
        'Свёкла чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Ботвинья-свекольник (грамм)'] = {
        'Ботвинья-свекольник (100 грамм)':1 / 100,
        }

metadict_detail['Заправка зелёная для ботвиньи (грамм)'] = {
        'Заправка зелёная для ботвиньи (100 грамм)':1 / 100,
        }

metadict_detail['Заправка овощная для ботвиньи (грамм)'] = {
        'Заправка овощная для ботвиньи (100 грамм)':1 / 100,
        }

metadict_detail['Основа квасная для ботвиньи (грамм)'] = {
        'Основа квасная для ботвиньи (100 грамм)':1 / 100,
        }

metadict_detail['Заправка овощная для щей (грамм)'] = {
        'Заправка овощная для щей (100 грамм)':1 / 100,
        }

metadict_detail['Заправка овощная для рассольника (грамм)'] = {
        'Заправка овощная для рассольника (100 грамм)':1 / 100,
        }

metadict_detail['Овощи жареные для томатного супа (грамм)'] = {
        'Овощи жареные для томатного супа (100 грамм)':1 / 100,
        }

metadict_detail['Корнеплоды пряные обжаренные для бульона (грамм)'] = {
        'Корнеплоды пряные обжаренные для бульона (100 грамм)':1 / 100,
        }

metadict_detail['Овощи пряные шинкованные обжаренные (грамм)'] = {
        'Овощи пряные шинкованные обжаренные (100 грамм)':1 / 100,
        }

metadict_detail['Овощи пряные шинкованные запечённые (грамм)'] = {
        'Овощи пряные шинкованные запечённые (100 грамм)':1 / 100,
        }

metadict_detail['Овощи пряные шинкованные (грамм)'] = {
        'Овощи пряные шинкованные (100 грамм)':1 / 100,
        }

metadict_detail['Овощи пряные нарезанные для бульона (грамм)'] = {
        'Овощи пряные нарезанные для бульона (100 грамм)':1 / 100,
        }

metadict_detail['Корнеплоды крахмалистые нарезанные для бульона (грамм)'] = {
        'Корнеплоды крахмалистые нарезанные для бульона (100 грамм)':1 / 100,
        }

metadict_detail['Овощи сезонные нарезанные для бульона (грамм)'] = {
        'Овощи сезонные нарезанные для бульона (100 грамм)':1 / 100,
        }

metadict_detail['Овощи обжаренные для минестроне (грамм)'] = {
        'Овощи обжаренные для минестроне (100 грамм)':1 / 100,
        }

metadict_detail['Овощи обжаренные для супа-лапши (грамм)'] = {
        'Овощи обжаренные для супа-лапши (100 грамм)':1 / 100,
        }

metadict_detail['Заправка овощная для рагу (грамм)'] = {
        'Заправка овощная для рагу (100 грамм)':1 / 100,
        }

metadict_detail['Корнеплоды обжаренные для рагу (грамм)'] = {
        'Корнеплоды обжаренные для рагу (100 грамм)':1 / 100,
        }

metadict_detail['Овощи сезонные обжаренные для рагу (грамм)'] = {
        'Овощи сезонные обжаренные для рагу (100 грамм)':1 / 100,
        }

metadict_detail['Овощи обжаренные для рассольника (грамм)'] = {
        'Овощи обжаренные для рассольника (100 грамм)':1 / 100,
        }

metadict_detail['Овощи обжаренные для борща (грамм)'] = {
        'Овощи обжаренные для борща (100 грамм)':1 / 100,
        }

metadict_detail['Овощи пряные нарезанные для похлёбки (грамм)'] = {
        'Овощи пряные нарезанные для похлёбки (100 грамм)':1 / 100,
        }

metadict_detail['Ботва морковная отборная (грамм)'] = {
        'Ботва морковная отборная (100 грамм)':1 / 100,
        }

metadict_detail['Ботва морковная бланшированная (грамм)'] = {
        'Ботва морковная бланшированная (100 грамм)':1 / 100,
        }

metadict_detail['Ботва свекольная отборная (грамм)'] = {
        'Ботва свекольная отборная (100 грамм)':1 / 100,
        }

metadict_detail['Ботва свекольная бланшированная (грамм)'] = {
        'Ботва свекольная бланшированная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь чищеная (грамм)'] = {
        'Морковь чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь шинкованная (грамм)'] = {
        'Морковь шинкованная (100 грамм)':1 / 100,
        }

metadict_detail['Редис чищеный (грамм)'] = {
        'Редис чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Редис шинкованный (грамм)'] = {
        'Редис шинкованный (100 грамм)':1 / 100,
        }

metadict_detail['Редис печёный (грамм)'] = {
        'Редис печёный (100 грамм)':1 / 100,
        }

metadict_detail['Редька чищеная (грамм)'] = {
        'Редька чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Редька тёртая (грамм)'] = {
        'Редька тёртая (100 грамм)':1 / 100,
        }

metadict_detail['Репа чищеная (грамм)'] = {
        'Репа чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Репа квашеная (грамм)'] = {
        'Репа квашеная (100 грамм)':1 / 100,
        }

metadict_detail['Репа квашеная томлёная (грамм)'] = {
        'Репа квашеная томлёная (100 грамм)':1 / 100,
        }

metadict_detail['Репа варёная (грамм)'] = {
        'Репа варёная (100 грамм)':1 / 100,
        }

metadict_detail['Репа пареная (грамм)'] = {
        'Репа пареная (100 грамм)':1 / 100,
        }

metadict_detail['Репа печёная (грамм)'] = {
        'Репа печёная (100 грамм)':1 / 100,
        }

metadict_detail['Репа фаршированная горохом (грамм)'] = {
        'Репа фаршированная горохом (100 грамм)':1 / 100,
        }

metadict_detail['Салат из печёной репы с черникой (грамм)'] = {
        'Салат из печёной репы с черникой (100 грамм)':1 / 100,
        }

metadict_detail['Брюква чищеная (грамм)'] = {
        'Брюква чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Брюква печёная (грамм)'] = {
        'Брюква печёная (100 грамм)':1 / 100,
        }

metadict_detail['Салат томатный со стручковой фасолью (грамм)'] = {
        'Салат томатный со стручковой фасолью (100 грамм)':1 / 100,
        }

metadict_detail['Салат огуречный с лимонно-соевым соусом (грамм)'] = {
        'Салат огуречный с лимонно-соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Салат огуречно-томатный со сладким перцем (грамм)'] = {
        'Салат огуречно-томатный со сладким перцем (100 грамм)':1 / 100,
        }

metadict_detail['Салат из печёной брюквы с кедровыми орешками (грамм)'] = {
        'Салат из печёной брюквы с кедровыми орешками (100 грамм)':1 / 100,
        }

metadict_detail['Перец сладкий чищеный (грамм)'] = {
        'Перец сладкий чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Перец нежгучий отборный (грамм)'] = {
        'Перец нежгучий отборный (100 грамм)':1 / 100,
        }

metadict_detail['Овощи запечённые в кабачковом соусе (грамм)'] = {
        'Овощи запечённые в кабачковом соусе (100 грамм)':1 / 100,
        }

metadict_detail['Рагу овощное с горошком (грамм)'] = {
        'Рагу овощное с горошком (100 грамм)':1 / 100,
        }

metadict_detail['Лечо со сладким перцем (грамм)'] = {
        'Лечо со сладким перцем (100 грамм)':1 / 100,
        }

metadict_detail['Лечо со сладким перцем консервированное (грамм)'] = {
        'Лечо со сладким перцем консервированное (100 грамм)':1 / 100,
        }

metadict_detail['Шпинат обжаренный с чесноком (грамм)'] = {
        'Шпинат обжаренный с чесноком (100 грамм)':1 / 100,
        }

metadict_detail['Перец фаршированный овощами (грамм)'] = {
        'Перец фаршированный овощами (100 грамм)':1 / 100,
        }

metadict_detail['Перец сладкий печёный (грамм)'] = {
        'Перец сладкий печёный (100 грамм)':1 / 100,
        }

metadict_detail['Перец сладкий шинкованный (грамм)'] = {
        'Перец сладкий шинкованный (100 грамм)':1 / 100,
        }

metadict_detail['Перец сладкий обжаренный (грамм)'] = {
        'Перец сладкий обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Баклажан печёный (грамм)'] = {
        'Баклажан печёный (100 грамм)':1 / 100,
        }

metadict_detail['Баклажан тушёный со стручковой фасолью (грамм)'] = {
        'Баклажан тушёный со стручковой фасолью (100 грамм)':1 / 100,
        }

metadict_detail['Баклажан тушёный с томатами (грамм)'] = {
        'Баклажан тушёный с томатами (100 грамм)':1 / 100,
        }

metadict_detail['Баклажан обжаренный (грамм)'] = {
        'Баклажан обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Овощи обжаренные в соевом соусе (грамм)'] = {
        'Овощи обжаренные в соевом соусе (100 грамм)':1 / 100,
        }

metadict_detail['Баклажан жареный с томатами (грамм)'] = {
        'Баклажан жареный с томатами (100 грамм)':1 / 100,
        }

metadict_detail['Кабачок печёный (грамм)'] = {
        'Кабачок печёный (100 грамм)':1 / 100,
        }

metadict_detail['Кабачок обжаренный (грамм)'] = {
        'Кабачок обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Голубцы фаршированные овощами (грамм)'] = {
        'Голубцы фаршированные овощами (100 грамм)':1 / 100,
        }

metadict_detail['Голубцы с гречкой и луком (грамм)'] = {
        'Голубцы с гречкой и луком (100 грамм)':1 / 100,
        }

metadict_detail['Фарш овощной тушёный (грамм)'] = {
        'Фарш овощной тушёный (100 грамм)':1 / 100,
        }

metadict_detail['Фарш пряный картофельный обжаренный (грамм)'] = {
        'Фарш пряный картофельный обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Фарш пряный овощной обжаренный (грамм)'] = {
        'Фарш пряный овощной обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Начинка с протёртым маком (грамм)'] = {
        'Начинка с протёртым маком (100 грамм)':1 / 100,
        }

metadict_detail['Начинка из овечьего сыра с черемшой (грамм)'] = {
        'Начинка из овечьего сыра с черемшой (100 грамм)':1 / 100,
        }

metadict_detail['Начинка из баранины с луком и пряностями (грамм)'] = {
        'Начинка из баранины с луком и пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Зелёный горошек протёртый тушёный в сливках (грамм)'] = {
        'Зелёный горошек протёртый тушёный в сливках (100 грамм)':1 / 100,
        }

metadict_detail['Начинка капустная с грецкими орехами (грамм)'] = {
        'Начинка капустная с грецкими орехами (100 грамм)':1 / 100,
        }

metadict_detail['Начинка для лепёшек на овечьем сыре (грамм)'] = {
        'Начинка для лепёшек на овечьем сыре (100 грамм)':1 / 100,
        }

metadict_detail['Начинка для лепёшек на твороге (грамм)'] = {
        'Начинка для лепёшек на твороге (100 грамм)':1 / 100,
        }

metadict_detail['Начинка на твороге с зеленью и яйцом (грамм)'] = {
        'Начинка на твороге с зеленью и яйцом (100 грамм)':1 / 100,
        }

metadict_detail['Лимон отборный (грамм)'] = {
        'Лимон отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лимон отборный импортный (грамм)'] = {
        'Лимон отборный импортный (100 грамм)':1 / 100,
        }

metadict_detail['Лук чищеный (грамм)'] = {
        'Лук чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Лук шинкованный (грамм)'] = {
        'Лук шинкованный (100 грамм)':1 / 100,
        }

metadict_detail['Лук томлёный с томатами (грамм)'] = {
        'Лук томлёный с томатами (100 грамм)':1 / 100,
        }

metadict_detail['Лук сушёный (грамм)'] = {
        'Лук сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Зелень лука отборная (грамм)'] = {
        'Зелень лука отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень лука шинкованная (грамм)'] = {
        'Зелень лука шинкованная (100 грамм)':1 / 100,
        }

metadict_detail['Чеснок чищеный (грамм)'] = {
        'Чеснок чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Чеснок чищеный печёный (грамм)'] = {
        'Чеснок чищеный печёный (100 грамм)':1 / 100,
        }

metadict_detail['Чеснок давленый (грамм)'] = {
        'Чеснок давленый (100 грамм)':1 / 100,
        }

metadict_detail['Чеснок давленый обжаренный (грамм)'] = {
        'Чеснок давленый обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Чеснок сушёный (грамм)'] = {
        'Чеснок сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Тыква чищеная (грамм)'] = {
        'Тыква чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Томаты отборные (грамм)'] = {
        'Томаты отборные (100 грамм)':1 / 100,
        }

metadict_detail['Томаты припущенные (грамм)'] = {
        'Томаты припущенные (100 грамм)':1 / 100,
        }

metadict_detail['Томаты печёные для террина (грамм)'] = {
        'Томаты печёные для террина (100 грамм)':1 / 100,
        }

metadict_detail['Томаты шинкованные (грамм)'] = {
        'Томаты шинкованные (100 грамм)':1 / 100,
        }

metadict_detail['Томаты чищеные (грамм)'] = {
        'Томаты чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Оливки чищеные (грамм)'] = {
        'Оливки чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Оливки маринованные (грамм)'] = {
        'Оливки маринованные (100 грамм)':1 / 100,
        }

metadict_detail['Каперсы отборные (грамм)'] = {
        'Каперсы отборные (100 грамм)':1 / 100,
        }

metadict_detail['Каперсы замоченные (грамм)'] = {
        'Каперсы замоченные (100 грамм)':1 / 100,
        }

metadict_detail['Каперсы маринованные (грамм)'] = {
        'Каперсы маринованные (100 грамм)':1 / 100,
        }

metadict_detail['Томаты сушёные (грамм)'] = {
        'Томаты сушёные (100 грамм)':1 / 100,
        }

metadict_detail['Томаты вяленые (грамм)'] = {
        'Томаты вяленые (100 грамм)':1 / 100,
        }

metadict_detail['Баклажан чищеный (грамм)'] = {
        'Баклажан чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Кабачок чищеный (грамм)'] = {
        'Кабачок чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Огурцы отборные (грамм)'] = {
        'Огурцы отборные (100 грамм)':1 / 100,
        }

metadict_detail['Огурцы чищеные (грамм)'] = {
        'Огурцы чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Зелень кресса отборная (грамм)'] = {
        'Зелень кресса отборная (100 грамм)':1 / 100,
        }

metadict_detail['Салат-латук отборный (грамм)'] = {
        'Салат-латук отборный (100 грамм)':1 / 100,
        }

metadict_detail['Артишоки отборные (грамм)'] = {
        'Артишоки отборные (100 грамм)':1 / 100,
        }

metadict_detail['Артишоки обжаренные (грамм)'] = {
        'Артишоки обжаренные (100 грамм)':1 / 100,
        }

metadict_detail['Артишоки бланшированные (грамм)'] = {
        'Артишоки бланшированные (100 грамм)':1 / 100,
        }

metadict_detail['Артишоки тушёные с сельдереем (грамм)'] = {
        'Артишоки тушёные с сельдереем (100 грамм)':1 / 100,
        }

metadict_detail['Морская капуста отборная (грамм)'] = {
        'Морская капуста отборная (100 грамм)':1 / 100,
        }

metadict_detail['Морская капуста обжаренная (грамм)'] = {
        'Морская капуста обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Морская капуста замоченная (грамм)'] = {
        'Морская капуста замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Морская капуста сушёная (грамм)'] = {
        'Морская капуста сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста чищеная (грамм)'] = {
        'Капуста чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста шинкованная (грамм)'] = {
        'Капуста шинкованная (100 грамм)':1 / 100,
        }

metadict_detail['Банан чищенный местный (грамм)'] = {
        'Банан чищенный местный (100 грамм)':1 / 100,
        }

metadict_detail['Банан чищенный импортный (грамм)'] = {
        'Банан чищенный импортный (100 грамм)':1 / 100,
        }

metadict_detail['Банан сушёный (грамм)'] = {
        'Банан сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Банан печёный (грамм)'] = {
        'Банан печёный (100 грамм)':1 / 100,
        }

metadict_detail['Банан жареный кусками во фритюре (грамм)'] = {
        'Банан жареный кусками во фритюре (100 грамм)':1 / 100,
        }

metadict_detail['Банан жареный в карамели (грамм)'] = {
        'Банан жареный в карамели (100 грамм)':1 / 100,
        }

metadict_detail['Дыня чищеная (грамм)'] = {
        'Дыня чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Арбуз чищеный (грамм)'] = {
        'Арбуз чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Гранат чищеный (грамм)'] = {
        'Гранат чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Гранат отборный (грамм)'] = {
        'Гранат отборный (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко чищеное (грамм)'] = {
        'Яблоко чищеное (100 грамм)':1 / 100,
        }

metadict_detail['Мезга яблочная чистая (грамм)'] = {
        'Мезга яблочная чистая (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко отборное (грамм)'] = {
        'Яблоко отборное (100 грамм)':1 / 100,
        }

metadict_detail['Груша печёная (грамм)'] = {
        'Груша печёная (100 грамм)':1 / 100,
        }

metadict_detail['Груша чищеная (грамм)'] = {
        'Груша чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Груша отборная (грамм)'] = {
        'Груша отборная (100 грамм)':1 / 100,
        }

metadict_detail['Персик отборный (грамм)'] = {
        'Персик отборный (100 грамм)':1 / 100,
        }

metadict_detail['Абрикос отборный (грамм)'] = {
        'Абрикос отборный (100 грамм)':1 / 100,
        }

metadict_detail['Слива отборная (грамм)'] = {
        'Слива отборная (100 грамм)':1 / 100,
        }

metadict_detail['Слива чищеная (грамм)'] = {
        'Слива чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Вишня отборная (грамм)'] = {
        'Вишня отборная (100 грамм)':1 / 100,
        }

metadict_detail['Вишня мочёная (грамм)'] = {
        'Вишня мочёная (100 грамм)':1 / 100,
        }

metadict_detail['Инжир сушёный (грамм)'] = {
        'Инжир сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Алыча сушёная (грамм)'] = {
        'Алыча сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Алыча уваренная протёртая (грамм)'] = {
        'Алыча уваренная протёртая (100 грамм)':1 / 100,
        }

metadict_detail['Алыча отборная (грамм)'] = {
        'Алыча отборная (100 грамм)':1 / 100,
        }

metadict_detail['Финики без косточек (грамм)'] = {
        'Финики без косточек (100 грамм)':1 / 100,
        }

metadict_detail['Манго сушёный (грамм)'] = {
        'Манго сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Манго чищенный местный (грамм)'] = {
        'Манго чищенный местный (100 грамм)':1 / 100,
        }

metadict_detail['Манго чищенный импортный (грамм)'] = {
        'Манго чищенный импортный (100 грамм)':1 / 100,
        }

metadict_detail['Авокадо чищенный местный (грамм)'] = {
        'Авокадо чищенный местный (100 грамм)':1 / 100,
        }

metadict_detail['Авокадо чищенный импортный (грамм)'] = {
        'Авокадо чищенный импортный (100 грамм)':1 / 100,
        }

metadict_detail['Инжир отборный (грамм)'] = {
        'Инжир отборный (100 грамм)':1 / 100,
        }

metadict_detail['Виноград отборный (грамм)'] = {
        'Виноград отборный (100 грамм)':1 / 100,
        }

metadict_detail['Черника отборная (грамм)'] = {
        'Черника отборная (100 грамм)':1 / 100,
        }

metadict_detail['Земляника отборная (грамм)'] = {
        'Земляника отборная (100 грамм)':1 / 100,
        }

metadict_detail['Малина отборная (грамм)'] = {
        'Малина отборная (100 грамм)':1 / 100,
        }

metadict_detail['Малина сушёная (грамм)'] = {
        'Малина сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Морошка отборная (грамм)'] = {
        'Морошка отборная (100 грамм)':1 / 100,
        }

metadict_detail['Крыжовник отборный (грамм)'] = {
        'Крыжовник отборный (100 грамм)':1 / 100,
        }

metadict_detail['Крыжовник мочёный (грамм)'] = {
        'Крыжовник мочёный (100 грамм)':1 / 100,
        }

metadict_detail['Смородина отборная (грамм)'] = {
        'Смородина отборная (100 грамм)':1 / 100,
        }

metadict_detail['Клюква отборная (грамм)'] = {
        'Клюква отборная (100 грамм)':1 / 100,
        }

metadict_detail['Клюква сушёная (грамм)'] = {
        'Клюква сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Рябина отборная (грамм)'] = {
        'Рябина отборная (100 грамм)':1 / 100,
        }

metadict_detail['Рябина сушёная (грамм)'] = {
        'Рябина сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Шиповник отборный (грамм)'] = {
        'Шиповник отборный (100 грамм)':1 / 100,
        }

metadict_detail['Шиповник сушёный (грамм)'] = {
        'Шиповник сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Кукуруза чищеная (грамм)'] = {
        'Кукуруза чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Кукуруза варёная (грамм)'] = {
        'Кукуруза варёная (100 грамм)':1 / 100,
        }

metadict_detail['Кукуруза печёная с соевым соусом (грамм)'] = {
        'Кукуруза печёная с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Булочки пшеничные с маком (грамм)'] = {
        'Булочки пшеничные с маком (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб пшеничный домашний (грамм)'] = {
        'Хлеб пшеничный домашний (100 грамм)':1 / 100,
        }

metadict_detail['Брускетта обжаренная (грамм)'] = {
        'Брускетта обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Брускетта со свежими томатами (грамм)'] = {
        'Брускетта со свежими томатами (100 грамм)':1 / 100,
        }

metadict_detail['Брускетта с баклажанным соусом (грамм)'] = {
        'Брускетта с баклажанным соусом (100 грамм)':1 / 100,
        }

metadict_detail['Брускетта с луком и оливками (грамм)'] = {
        'Брускетта с луком и оливками (100 грамм)':1 / 100,
        }

metadict_detail['Брускетта с солёными боровиками (грамм)'] = {
        'Брускетта с солёными боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Брускетта с консервированными шампиньонами (грамм)'] = {
        'Брускетта с консервированными шампиньонами (100 грамм)':1 / 100,
        }

metadict_detail['Брускетта с консервированным лечо (грамм)'] = {
        'Брускетта с консервированным лечо (100 грамм)':1 / 100,
        }

metadict_detail['Брускетта с печёным перцем и песто (грамм)'] = {
        'Брускетта с печёным перцем и песто (100 грамм)':1 / 100,
        }

metadict_detail['Брускетта с солёными томатами (грамм)'] = {
        'Брускетта с солёными томатами (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб кукурузный домашний (грамм)'] = {
        'Хлеб кукурузный домашний (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб соевый домашний (грамм)'] = {
        'Хлеб соевый домашний (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб ржаной домашний (грамм)'] = {
        'Хлеб ржаной домашний (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб ржаной с семечками и клюквой (грамм)'] = {
        'Хлеб ржаной с семечками и клюквой (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб ячменный домашний (грамм)'] = {
        'Хлеб ячменный домашний (100 грамм)':1 / 100,
        }

metadict_detail['Сэндвич с арахисовой пастой (грамм)'] = {
        'Сэндвич с арахисовой пастой (100 грамм)':1 / 100,
        }

metadict_detail['Сэндвич с пекановой пастой (грамм)'] = {
        'Сэндвич с пекановой пастой (100 грамм)':1 / 100,
        }

metadict_detail['Сэндвич с фасолевой пастой (грамм)'] = {
        'Сэндвич с фасолевой пастой (100 грамм)':1 / 100,
        }

metadict_detail['Сэндвич с нутовой пастой (грамм)'] = {
        'Сэндвич с нутовой пастой (100 грамм)':1 / 100,
        }

metadict_detail['Сэндвич с яблочным джемом (грамм)'] = {
        'Сэндвич с яблочным джемом (100 грамм)':1 / 100,
        }

metadict_detail['Сэндвич с мёдом (грамм)'] = {
        'Сэндвич с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Сухари панировочные (грамм)'] = {
        'Сухари панировочные (100 грамм)':1 / 100,
        }

metadict_detail['Сухари пшеничные (грамм)'] = {
        'Сухари пшеничные (100 грамм)':1 / 100,
        }

metadict_detail['Сухари ржаные (грамм)'] = {
        'Сухари ржаные (100 грамм)':1 / 100,
        }

metadict_detail['Печенье овсяное с изюмом (грамм)'] = {
        'Печенье овсяное с изюмом (100 грамм)':1 / 100,
        }

metadict_detail['Пряники медовые (грамм)'] = {
        'Пряники медовые (100 грамм)':1 / 100,
        }

metadict_detail['Блины пшенично-ореховые (грамм)'] = {
        'Блины пшенично-ореховые (100 грамм)':1 / 100,
        }

metadict_detail['Блины пшенично-ореховые с боровиками (грамм)'] = {
        'Блины пшенично-ореховые с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Блины пшенично-ореховые со сморчками (грамм)'] = {
        'Блины пшенично-ореховые со сморчками (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки кукурузные (грамм)'] = {
        'Лепёшки кукурузные (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки пшеничные (грамм)'] = {
        'Лепёшки пшеничные (100 грамм)':1 / 100,
        }

metadict_detail['Блины ржаные (грамм)'] = {
        'Блины ржаные (100 грамм)':1 / 100,
        }

metadict_detail['Блины пшенично-гречневые (грамм)'] = {
        'Блины пшенично-гречневые (100 грамм)':1 / 100,
        }

metadict_detail['Блины рисовые (грамм)'] = {
        'Блины рисовые (100 грамм)':1 / 100,
        }

metadict_detail['Блины рисовые с нутовой пастой (грамм)'] = {
        'Блины рисовые с нутовой пастой (100 грамм)':1 / 100,
        }

metadict_detail['Блины рисовые с арахисовой пастой (грамм)'] = {
        'Блины рисовые с арахисовой пастой (100 грамм)':1 / 100,
        }

metadict_detail['Блины рисовые с финиковой пастой (грамм)'] = {
        'Блины рисовые с финиковой пастой (100 грамм)':1 / 100,
        }

metadict_detail['Блины рисовые с картофелем (грамм)'] = {
        'Блины рисовые с картофелем (100 грамм)':1 / 100,
        }

metadict_detail['Блины рисовые с темпе (грамм)'] = {
        'Блины рисовые с темпе (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки рисовые паровые (грамм)'] = {
        'Лепёшки рисовые паровые (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки рисово-просяные паровые (грамм)'] = {
        'Лепёшки рисово-просяные паровые (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки рисово-ячменные паровые (грамм)'] = {
        'Лепёшки рисово-ячменные паровые (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки рисовые с финиковым соусом (грамм)'] = {
        'Лепёшки рисовые с финиковым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки рисовые с алычовым соусом (грамм)'] = {
        'Лепёшки рисовые с алычовым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки рисовые с яблочным сиропом (грамм)'] = {
        'Лепёшки рисовые с яблочным сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Лепёшки рисовые с лимонным сиропом (грамм)'] = {
        'Лепёшки рисовые с лимонным сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Кубики рисовые в сахарной глазури (грамм)'] = {
        'Кубики рисовые в сахарной глазури (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи гречневые (грамм)'] = {
        'Оладьи гречневые (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи картофельные (грамм)'] = {
        'Оладьи картофельные (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи картофельные с пряностями (грамм)'] = {
        'Оладьи картофельные с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки картофельные с боровиками (грамм)'] = {
        'Пирожки картофельные с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки картофельные со сморчками (грамм)'] = {
        'Пирожки картофельные со сморчками (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи кабачковые (грамм)'] = {
        'Оладьи кабачковые (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные (грамм)'] = {
        'Оладьи овсяные (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные с клюквенным вареньем (грамм)'] = {
        'Оладьи овсяные с клюквенным вареньем (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные с вишнёвым вареньем (грамм)'] = {
        'Оладьи овсяные с вишнёвым вареньем (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные с рябиновым вареньем (грамм)'] = {
        'Оладьи овсяные с рябиновым вареньем (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные с одуванчиковым вареньем (грамм)'] = {
        'Оладьи овсяные с одуванчиковым вареньем (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные со смородиновым вареньем (грамм)'] = {
        'Оладьи овсяные со смородиновым вареньем (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные с кленовым сиропом (грамм)'] = {
        'Оладьи овсяные с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные с яблочным сиропом (грамм)'] = {
        'Оладьи овсяные с яблочным сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные с мёдом (грамм)'] = {
        'Оладьи овсяные с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи кукурузные (грамм)'] = {
        'Оладьи кукурузные (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи кукурузные с клюквенным сиропом (грамм)'] = {
        'Оладьи кукурузные с клюквенным сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи кукурузные с кленовым сиропом (грамм)'] = {
        'Оладьи кукурузные с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи кукурузные с яблочным сиропом (грамм)'] = {
        'Оладьи кукурузные с яблочным сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи кукурузные с мёдом (грамм)'] = {
        'Оладьи кукурузные с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Пончики с глазурью (грамм)'] = {
        'Пончики с глазурью (100 грамм)':1 / 100,
        }

metadict_detail['Пончики с мёдом и корицей (грамм)'] = {
        'Пончики с мёдом и корицей (100 грамм)':1 / 100,
        }

metadict_detail['Крендельки в сахарной глазури (грамм)'] = {
        'Крендельки в сахарной глазури (100 грамм)':1 / 100,
        }

metadict_detail['Чурчхела с грецкими орехами (грамм)'] = {
        'Чурчхела с грецкими орехами (100 грамм)':1 / 100,
        }

metadict_detail['Чурчхела с миндалем (грамм)'] = {
        'Чурчхела с миндалем (100 грамм)':1 / 100,
        }

metadict_detail['Козинаки медовые с фисташками (грамм)'] = {
        'Козинаки медовые с фисташками (100 грамм)':1 / 100,
        }

metadict_detail['Козинаки медовые с грецкими орехами (грамм)'] = {
        'Козинаки медовые с грецкими орехами (100 грамм)':1 / 100,
        }

metadict_detail['Козинаки медовые с миндалем (грамм)'] = {
        'Козинаки медовые с миндалем (100 грамм)':1 / 100,
        }

metadict_detail['Козинаки медовые с кунжутом и кешью (грамм)'] = {
        'Козинаки медовые с кунжутом и кешью (100 грамм)':1 / 100,
        }

metadict_detail['Капкейки миндальные (грамм)'] = {
        'Капкейки миндальные (100 грамм)':1 / 100,
        }

metadict_detail['Капкейки кукурузные (грамм)'] = {
        'Капкейки кукурузные (100 грамм)':1 / 100,
        }

metadict_detail['Капкейки с брокколи (грамм)'] = {
        'Капкейки с брокколи (100 грамм)':1 / 100,
        }

metadict_detail['Капкейки морковные (грамм)'] = {
        'Капкейки морковные (100 грамм)':1 / 100,
        }

metadict_detail['Капкейки тыквенные (грамм)'] = {
        'Капкейки тыквенные (100 грамм)':1 / 100,
        }

metadict_detail['Капкейки вишнёвые (грамм)'] = {
        'Капкейки вишнёвые (100 грамм)':1 / 100,
        }

metadict_detail['Капкейки с джемом из ревеня (грамм)'] = {
        'Капкейки с джемом из ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Капкейки с яблочным джемом (грамм)'] = {
        'Капкейки с яблочным джемом (100 грамм)':1 / 100,
        }

metadict_detail['Капкейки с сухофруктами (грамм)'] = {
        'Капкейки с сухофруктами (100 грамм)':1 / 100,
        }

metadict_detail['Темпе запечённый с сахаром (грамм)'] = {
        'Темпе запечённый с сахаром (100 грамм)':1 / 100,
        }

metadict_detail['Пудинг хлебный с земляникой (грамм)'] = {
        'Пудинг хлебный с земляникой (100 грамм)':1 / 100,
        }

metadict_detail['Пудинг бататно-смородиновый (грамм)'] = {
        'Пудинг бататно-смородиновый (100 грамм)':1 / 100,
        }

metadict_detail['Пудинг варёный смородиновый (грамм)'] = {
        'Пудинг варёный смородиновый (100 грамм)':1 / 100,
        }

metadict_detail['Пудинг варёный сливовый (грамм)'] = {
        'Пудинг варёный сливовый (100 грамм)':1 / 100,
        }

metadict_detail['Пудинг кукурузно-миндальный с изюмом (грамм)'] = {
        'Пудинг кукурузно-миндальный с изюмом (100 грамм)':1 / 100,
        }

metadict_detail['Пудинг кукурузно-миндальный (грамм)'] = {
        'Пудинг кукурузно-миндальный (100 грамм)':1 / 100,
        }

metadict_detail['Халва морковная (грамм)'] = {
        'Халва морковная (100 грамм)':1 / 100,
        }

metadict_detail['Халва тыквенная (грамм)'] = {
        'Халва тыквенная (100 грамм)':1 / 100,
        }

metadict_detail['Пирог закрытый с бараниной (грамм)'] = {
        'Пирог закрытый с бараниной (100 грамм)':1 / 100,
        }

metadict_detail['Пирог закрытый с овечьим сыром и черемшой (грамм)'] = {
        'Пирог закрытый с овечьим сыром и черемшой (100 грамм)':1 / 100,
        }

metadict_detail['Пирог закрытый со сливками и зелёным горошком (грамм)'] = {
        'Пирог закрытый со сливками и зелёным горошком (100 грамм)':1 / 100,
        }

metadict_detail['Пирог закрытый с творогом, зеленью и яйцом (грамм)'] = {
        'Пирог закрытый с творогом, зеленью и яйцом (100 грамм)':1 / 100,
        }

metadict_detail['Пирог закрытый с капустой и грецкими орехами (грамм)'] = {
        'Пирог закрытый с капустой и грецкими орехами (100 грамм)':1 / 100,
        }

metadict_detail['Пирог закрытый овощной с шампиньонами (грамм)'] = {
        'Пирог закрытый овощной с шампиньонами (100 грамм)':1 / 100,
        }

metadict_detail['Пирог закрытый черничный (грамм)'] = {
        'Пирог закрытый черничный (100 грамм)':1 / 100,
        }

metadict_detail['Пирог закрытый яблочный (грамм)'] = {
        'Пирог закрытый яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Пирог закрытый бататный (грамм)'] = {
        'Пирог закрытый бататный (100 грамм)':1 / 100,
        }

metadict_detail['Пирог закрытый тыквенный (грамм)'] = {
        'Пирог закрытый тыквенный (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый кленовый (грамм)'] = {
        'Пирог открытый кленовый (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый пекановый (грамм)'] = {
        'Пирог открытый пекановый (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый лимонный (грамм)'] = {
        'Пирог открытый лимонный (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый тыквенный (грамм)'] = {
        'Пирог открытый тыквенный (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый с тыквой и пеканом (грамм)'] = {
        'Пирог открытый с тыквой и пеканом (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый вишнёвый (грамм)'] = {
        'Пирог открытый вишнёвый (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый сливовый (грамм)'] = {
        'Пирог открытый сливовый (100 грамм)':1 / 100,
        }

metadict_detail['Пицца с кабачком и шампиньонами (грамм)'] = {
        'Пицца с кабачком и шампиньонами (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки жареные с маком (грамм)'] = {
        'Пирожки жареные с маком (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки тыквенные (грамм)'] = {
        'Пирожки тыквенные (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки гороховые (грамм)'] = {
        'Пирожки гороховые (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки морковные (грамм)'] = {
        'Пирожки морковные (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с ревенем (грамм)'] = {
        'Пирожки с ревенем (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с щавелем (грамм)'] = {
        'Пирожки с щавелем (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с боровиками (грамм)'] = {
        'Пирожки с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с грушей (грамм)'] = {
        'Пирожки с грушей (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки земляничные (грамм)'] = {
        'Пирожки земляничные (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки черничные (грамм)'] = {
        'Пирожки черничные (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с капустой (грамм)'] = {
        'Пирожки с капустой (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с картофелем (грамм)'] = {
        'Пирожки с картофелем (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с картофелем и спаржей (грамм)'] = {
        'Пирожки с картофелем и спаржей (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки яблочные (грамм)'] = {
        'Пирожки яблочные (100 грамм)':1 / 100,
        }

metadict_detail['Шарлотка яблочная (грамм)'] = {
        'Шарлотка яблочная (100 грамм)':1 / 100,
        }

metadict_detail['Шарлотка земляничная (грамм)'] = {
        'Шарлотка земляничная (100 грамм)':1 / 100,
        }

metadict_detail['Желе миндальное (грамм)'] = {
        'Желе миндальное (100 грамм)':1 / 100,
        }

metadict_detail['Желе лимонное (грамм)'] = {
        'Желе лимонное (100 грамм)':1 / 100,
        }

metadict_detail['Желе виноградное (грамм)'] = {
        'Желе виноградное (100 грамм)':1 / 100,
        }

metadict_detail['Желе яблочное (грамм)'] = {
        'Желе яблочное (100 грамм)':1 / 100,
        }

metadict_detail['Желе из ревеня (грамм)'] = {
        'Желе из ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Кисель овсяной густой (грамм)'] = {
        'Кисель овсяной густой (100 грамм)':1 / 100,
        }

metadict_detail['Кисель гороховый (грамм)'] = {
        'Кисель гороховый (100 грамм)':1 / 100,
        }

metadict_detail['Морс клюквенный (грамм)'] = {
        'Морс клюквенный (100 грамм)':1 / 100,
        }

metadict_detail['Молоко из орехов карии (грамм)'] = {
        'Молоко из орехов карии (100 грамм)':1 / 100,
        }

metadict_detail['Молоко из орехов карии с мёдом (грамм)'] = {
        'Молоко из орехов карии с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Мусс клюквенный (грамм)'] = {
        'Мусс клюквенный (100 грамм)':1 / 100,
        }

metadict_detail['Мусс лимонный (грамм)'] = {
        'Мусс лимонный (100 грамм)':1 / 100,
        }

metadict_detail['Мусс вишнёвый (грамм)'] = {
        'Мусс вишнёвый (100 грамм)':1 / 100,
        }

metadict_detail['Мусс из орехов карии с мёдом (грамм)'] = {
        'Мусс из орехов карии с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Молоко рисовое (грамм)'] = {
        'Молоко рисовое (100 грамм)':1 / 100,
        }

metadict_detail['Молоко миндальное (грамм)'] = {
        'Молоко миндальное (100 грамм)':1 / 100,
        }

metadict_detail['Кисель овсяной жидкий (грамм)'] = {
        'Кисель овсяной жидкий (100 грамм)':1 / 100,
        }

metadict_detail['Кисель овсяной с мёдом (грамм)'] = {
        'Кисель овсяной с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Тесто рисово-чечевичное для кляра (грамм)'] = {
        'Тесто рисово-чечевичное для кляра (100 грамм)':1 / 100,
        }

metadict_detail['Тесто рисово-урдовое ферментированное (грамм)'] = {
        'Тесто рисово-урдовое ферментированное (100 грамм)':1 / 100,
        }

metadict_detail['Тесто просо-рисово-урдовое ферментированное (грамм)'] = {
        'Тесто просо-рисово-урдовое ферментированное (100 грамм)':1 / 100,
        }

metadict_detail['Тесто ячменно-рисово-урдовое ферментированное (грамм)'] = {
        'Тесто ячменно-рисово-урдовое ферментированное (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пряничное медовое заварное (грамм)'] = {
        'Тесто пряничное медовое заварное (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное дрожжевое (грамм)'] = {
        'Тесто пшеничное дрожжевое (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-ореховое для блинов (грамм)'] = {
        'Тесто пшенично-ореховое для блинов (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное для пончиков (грамм)'] = {
        'Тесто пшеничное для пончиков (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-соевое дрожжевое (грамм)'] = {
        'Тесто пшенично-соевое дрожжевое (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-кукурузное дрожжевое (грамм)'] = {
        'Тесто пшенично-кукурузное дрожжевое (100 грамм)':1 / 100,
        }

metadict_detail['Тесто кукурузное для тортильи (грамм)'] = {
        'Тесто кукурузное для тортильи (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-овсяное для пудинга (грамм)'] = {
        'Тесто пшенично-овсяное для пудинга (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-миндальное для капкейков (грамм)'] = {
        'Тесто пшенично-миндальное для капкейков (100 грамм)':1 / 100,
        }

metadict_detail['Тесто кукурузно-пшеничное для капкейков (грамм)'] = {
        'Тесто кукурузно-пшеничное для капкейков (100 грамм)':1 / 100,
        }

metadict_detail['Тесто кукурузно-пшеничное бездрожжевое (грамм)'] = {
        'Тесто кукурузно-пшеничное бездрожжевое (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-ячменное дрожжевое (грамм)'] = {
        'Тесто пшенично-ячменное дрожжевое (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-гречневое для блинов (грамм)'] = {
        'Тесто пшенично-гречневое для блинов (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное дрожжевое для пирогов (грамм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное дрожжевое для булок (грамм)'] = {
        'Тесто пшеничное дрожжевое для булок (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное бездрожжевое для лаваша (грамм)'] = {
        'Тесто пшеничное бездрожжевое для лаваша (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное бездрожжевое с яйцом (грамм)'] = {
        'Тесто пшеничное бездрожжевое с яйцом (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное бездрожжевое на сыворотке (грамм)'] = {
        'Тесто пшеничное бездрожжевое на сыворотке (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное бездрожжевое на кислом молоке (грамм)'] = {
        'Тесто пшеничное бездрожжевое на кислом молоке (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное бездрожжевое для хачапури (грамм)'] = {
        'Тесто пшеничное бездрожжевое для хачапури (100 грамм)':1 / 100,
        }

metadict_detail['Тесто ячменно-пшеничное бездрожжевое на сыворотке (грамм)'] = {
        'Тесто ячменно-пшеничное бездрожжевое на сыворотке (100 грамм)':1 / 100,
        }

metadict_detail['Тесто ячменное бездрожжевое на сыворотке (грамм)'] = {
        'Тесто ячменное бездрожжевое на сыворотке (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное бездрожжевое для пирогов (грамм)'] = {
        'Тесто пшеничное бездрожжевое для пирогов (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное бездрожжевое для лапши (грамм)'] = {
        'Тесто пшеничное бездрожжевое для лапши (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-овсяное для оладий (грамм)'] = {
        'Тесто пшенично-овсяное для оладий (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-овсяное для печенья (грамм)'] = {
        'Тесто пшенично-овсяное для печенья (100 грамм)':1 / 100,
        }

metadict_detail['Тесто кукурузно-овсяное для оладий (грамм)'] = {
        'Тесто кукурузно-овсяное для оладий (100 грамм)':1 / 100,
        }

metadict_detail['Тесто ржаное на закваске (грамм)'] = {
        'Тесто ржаное на закваске (100 грамм)':1 / 100,
        }

metadict_detail['Тесто ржаное бездрожжевое (грамм)'] = {
        'Тесто ржаное бездрожжевое (100 грамм)':1 / 100,
        }

metadict_detail['Опара овсяная (грамм)'] = {
        'Опара овсяная (100 грамм)':1 / 100,
        }

metadict_detail['Опара пшенично-гречневая (грамм)'] = {
        'Опара пшенично-гречневая (100 грамм)':1 / 100,
        }

metadict_detail['Опара ржаная (грамм)'] = {
        'Опара ржаная (100 грамм)':1 / 100,
        }

metadict_detail['Заварка ржаная (грамм)'] = {
        'Заварка ржаная (100 грамм)':1 / 100,
        }

metadict_detail['Заварка пшеничная (грамм)'] = {
        'Заварка пшеничная (100 грамм)':1 / 100,
        }

metadict_detail['Закваска ржаная (грамм)'] = {
        'Закваска ржаная (100 грамм)':1 / 100,
        }

metadict_detail['Дрожжи жидкие (грамм)'] = {
        'Дрожжи жидкие (100 грамм)':1 / 100,
        }

metadict_detail['Опара пшеничная густая (грамм)'] = {
        'Опара пшеничная густая (100 грамм)':1 / 100,
        }

metadict_detail['Опара пшеничная жидкая (грамм)'] = {
        'Опара пшеничная жидкая (100 грамм)':1 / 100,
        }

metadict_detail['Рассольник с грибами (грамм)'] = {
        'Рассольник с грибами (100 грамм)':1 / 100,
        }

metadict_detail['Борщ с фасолью и томатами (грамм)'] = {
        'Борщ с фасолью и томатами (100 грамм)':1 / 100,
        }

metadict_detail['Щи зелёные с гречкой (грамм)'] = {
        'Щи зелёные с гречкой (100 грамм)':1 / 100,
        }

metadict_detail['Щи из квашеной капусты (грамм)'] = {
        'Щи из квашеной капусты (100 грамм)':1 / 100,
        }

metadict_detail['Щи из квашеной капусты с грибами (грамм)'] = {
        'Щи из квашеной капусты с грибами (100 грамм)':1 / 100,
        }

metadict_detail['Щи томатно-луковые с грибами (грамм)'] = {
        'Щи томатно-луковые с грибами (100 грамм)':1 / 100,
        }

metadict_detail['Щи из квашеной репы (грамм)'] = {
        'Щи из квашеной репы (100 грамм)':1 / 100,
        }

metadict_detail['Пюре из обжаренной фасоли (грамм)'] = {
        'Пюре из обжаренной фасоли (100 грамм)':1 / 100,
        }

metadict_detail['Пюре картофельное (грамм)'] = {
        'Пюре картофельное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре картофельно-редисовое (грамм)'] = {
        'Пюре картофельно-редисовое (100 грамм)':1 / 100,
        }

metadict_detail['Пюре брюквенное (грамм)'] = {
        'Пюре брюквенное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре брюквенно-морковное (грамм)'] = {
        'Пюре брюквенно-морковное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре морковное (грамм)'] = {
        'Пюре морковное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре бататное (грамм)'] = {
        'Пюре бататное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре тыквенное (грамм)'] = {
        'Пюре тыквенное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре тыквенное для пирога (грамм)'] = {
        'Пюре тыквенное для пирога (100 грамм)':1 / 100,
        }

metadict_detail['Пюре яблочное (грамм)'] = {
        'Пюре яблочное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре яблочное уваренное с мёдом (грамм)'] = {
        'Пюре яблочное уваренное с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Суфле яблочно-медовое (грамм)'] = {
        'Суфле яблочно-медовое (100 грамм)':1 / 100,
        }

metadict_detail['Пюре сливовое (грамм)'] = {
        'Пюре сливовое (100 грамм)':1 / 100,
        }

metadict_detail['Пюре сливовое уваренное с мёдом (грамм)'] = {
        'Пюре сливовое уваренное с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Суфле сливово-медовое (грамм)'] = {
        'Суфле сливово-медовое (100 грамм)':1 / 100,
        }

metadict_detail['Пастила яблочная (грамм)'] = {
        'Пастила яблочная (100 грамм)':1 / 100,
        }

metadict_detail['Пастила сливовая (грамм)'] = {
        'Пастила сливовая (100 грамм)':1 / 100,
        }

metadict_detail['Террин овощной (грамм)'] = {
        'Террин овощной (100 грамм)':1 / 100,
        }

metadict_detail['Суп из сезонных овощей с фасолью (грамм)'] = {
        'Суп из сезонных овощей с фасолью (100 грамм)':1 / 100,
        }

metadict_detail['Суп-лапша с бататом и солёными томатами (грамм)'] = {
        'Суп-лапша с бататом и солёными томатами (100 грамм)':1 / 100,
        }

metadict_detail['Суп-лапша с кабачком и свежими томатами (грамм)'] = {
        'Суп-лапша с кабачком и свежими томатами (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре арахисовый с бататом и томатами (грамм)'] = {
        'Суп-пюре арахисовый с бататом и томатами (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре чечевичный с пряной зеленью (грамм)'] = {
        'Суп-пюре чечевичный с пряной зеленью (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре пряный чечевичный с тыквой (грамм)'] = {
        'Суп-пюре пряный чечевичный с тыквой (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре пряный чечевичный со шпинатом (грамм)'] = {
        'Суп-пюре пряный чечевичный со шпинатом (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре пряный шпинатный с темпе (грамм)'] = {
        'Суп-пюре пряный шпинатный с темпе (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре пряный фасолевый (грамм)'] = {
        'Суп-пюре пряный фасолевый (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре пряный гороховый (грамм)'] = {
        'Суп-пюре пряный гороховый (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре пряный нутово-томатный (грамм)'] = {
        'Суп-пюре пряный нутово-томатный (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре пряный нутовый с луком-пореем (грамм)'] = {
        'Суп-пюре пряный нутовый с луком-пореем (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре томатный (грамм)'] = {
        'Суп-пюре томатный (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре томатный с гренками (грамм)'] = {
        'Суп-пюре томатный с гренками (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре пряный бататный (грамм)'] = {
        'Суп-пюре пряный бататный (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из корня сельдерея (грамм)'] = {
        'Суп-пюре из корня сельдерея (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из корня сельдерея с гренками (грамм)'] = {
        'Суп-пюре из корня сельдерея с гренками (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из моркови (грамм)'] = {
        'Суп-пюре из моркови (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре пряный морковный (грамм)'] = {
        'Суп-пюре пряный морковный (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из моркови с кремом (грамм)'] = {
        'Суп-пюре из моркови с кремом (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из свёклы (грамм)'] = {
        'Суп-пюре из свёклы (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из свёклы с кремом (грамм)'] = {
        'Суп-пюре из свёклы с кремом (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из спаржи (грамм)'] = {
        'Суп-пюре из спаржи (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из спаржи с кремом (грамм)'] = {
        'Суп-пюре из спаржи с кремом (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре перловый (грамм)'] = {
        'Суп-пюре перловый (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре перловый с кремом (грамм)'] = {
        'Суп-пюре перловый с кремом (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из картофеля и лука-порея (грамм)'] = {
        'Суп-пюре из картофеля и лука-порея (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из картофеля и лука-порея с гренками (грамм)'] = {
        'Суп-пюре из картофеля и лука-порея с гренками (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из картофеля и лука-порея с шампиньонами (грамм)'] = {
        'Суп-пюре из картофеля и лука-порея с шампиньонами (100 грамм)':1 / 100,
        }

metadict_detail['Аквафаба чечевичная (грамм)'] = {
        'Аквафаба чечевичная (100 грамм)':1 / 100,
        }

metadict_detail['Аквафаба фасолевая (грамм)'] = {
        'Аквафаба фасолевая (100 грамм)':1 / 100,
        }

metadict_detail['Бульон чечевичный (грамм)'] = {
        'Бульон чечевичный (100 грамм)':1 / 100,
        }

metadict_detail['Бульон фасолевый (грамм)'] = {
        'Бульон фасолевый (100 грамм)':1 / 100,
        }

metadict_detail['Бульон нутовый (грамм)'] = {
        'Бульон нутовый (100 грамм)':1 / 100,
        }

metadict_detail['Бульон костный бараний (грамм)'] = {
        'Бульон костный бараний (100 грамм)':1 / 100,
        }

metadict_detail['Бульон костный говяжий (грамм)'] = {
        'Бульон костный говяжий (100 грамм)':1 / 100,
        }

metadict_detail['Бульон мясной бараний (грамм)'] = {
        'Бульон мясной бараний (100 грамм)':1 / 100,
        }

metadict_detail['Бульон мясной куриный (грамм)'] = {
        'Бульон мясной куриный (100 грамм)':1 / 100,
        }

metadict_detail['Бульон мясной говяжий (грамм)'] = {
        'Бульон мясной говяжий (100 грамм)':1 / 100,
        }

metadict_detail['Бульон овощной сезонный (грамм)'] = {
        'Бульон овощной сезонный (100 грамм)':1 / 100,
        }

metadict_detail['Бульон овощной из корнеплодов (грамм)'] = {
        'Бульон овощной из корнеплодов (100 грамм)':1 / 100,
        }

metadict_detail['Бульон грибной (грамм)'] = {
        'Бульон грибной (100 грамм)':1 / 100,
        }

metadict_detail['Окрошка с варёными грибами (грамм)'] = {
        'Окрошка с варёными грибами (100 грамм)':1 / 100,
        }

metadict_detail['Окрошка с солёными грибами (грамм)'] = {
        'Окрошка с солёными грибами (100 грамм)':1 / 100,
        }

metadict_detail['Тюря с луком (грамм)'] = {
        'Тюря с луком (100 грамм)':1 / 100,
        }

metadict_detail['Тюря с одуванчиком (грамм)'] = {
        'Тюря с одуванчиком (100 грамм)':1 / 100,
        }

metadict_detail['Тюря с редькой (грамм)'] = {
        'Тюря с редькой (100 грамм)':1 / 100,
        }

metadict_detail['Тюря томатная с сельдереем (грамм)'] = {
        'Тюря томатная с сельдереем (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль тушёная с корнеплодами (грамм)'] = {
        'Фасоль тушёная с корнеплодами (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль тушёная со свежей кукурузой (грамм)'] = {
        'Фасоль тушёная со свежей кукурузой (100 грамм)':1 / 100,
        }

metadict_detail['Суп томатный с фасолью (грамм)'] = {
        'Суп томатный с фасолью (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре холодный томатно-огуречный (грамм)'] = {
        'Суп-пюре холодный томатно-огуречный (100 грамм)':1 / 100,
        }

metadict_detail['Суп чечевичный (грамм)'] = {
        'Суп чечевичный (100 грамм)':1 / 100,
        }

metadict_detail['Похлёбка гороховая (грамм)'] = {
        'Похлёбка гороховая (100 грамм)':1 / 100,
        }

metadict_detail['Похлёбка картофельная со свежей зеленью (грамм)'] = {
        'Похлёбка картофельная со свежей зеленью (100 грамм)':1 / 100,
        }

metadict_detail['Суп-лапша с морской капустой (грамм)'] = {
        'Суп-лапша с морской капустой (100 грамм)':1 / 100,
        }

metadict_detail['Похлёбка репяная (грамм)'] = {
        'Похлёбка репяная (100 грамм)':1 / 100,
        }

metadict_detail['Похлёбка луковая (грамм)'] = {
        'Похлёбка луковая (100 грамм)':1 / 100,
        }

metadict_detail['Лапша варёная (грамм)'] = {
        'Лапша варёная (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с лютеницей (грамм)'] = {
        'Лапша с лютеницей (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с баклажанным соусом (грамм)'] = {
        'Лапша с баклажанным соусом (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с соусом песто (грамм)'] = {
        'Лапша с соусом песто (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с кабачковым соусом (грамм)'] = {
        'Лапша с кабачковым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с песто и шампиньонами (грамм)'] = {
        'Лапша с песто и шампиньонами (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с песто и сморчками (грамм)'] = {
        'Лапша с песто и сморчками (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с белыми грибами (грамм)'] = {
        'Лапша с белыми грибами (100 грамм)':1 / 100,
        }

metadict_detail['Лапша сушёная (грамм)'] = {
        'Лапша сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Каша пшённая на молоке (грамм)'] = {
        'Каша пшённая на молоке (100 грамм)':1 / 100,
        }

metadict_detail['Каша рисовая (грамм)'] = {
        'Каша рисовая (100 грамм)':1 / 100,
        }

metadict_detail['Каша рисовая с телятиной и овощами (грамм)'] = {
        'Каша рисовая с телятиной и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Каша пшённая с чечевицей (грамм)'] = {
        'Каша пшённая с чечевицей (100 грамм)':1 / 100,
        }

metadict_detail['Каша пшённая с чечевицей и спаржей (грамм)'] = {
        'Каша пшённая с чечевицей и спаржей (100 грамм)':1 / 100,
        }

metadict_detail['Каша пшённая с чечевицей и горошком (грамм)'] = {
        'Каша пшённая с чечевицей и горошком (100 грамм)':1 / 100,
        }

metadict_detail['Каша пшённая с чечевицей и овощами (грамм)'] = {
        'Каша пшённая с чечевицей и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Каша овсяная (грамм)'] = {
        'Каша овсяная (100 грамм)':1 / 100,
        }

metadict_detail['Каша овсяная с мёдом (грамм)'] = {
        'Каша овсяная с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Каша овсяная с кленовым сиропом (грамм)'] = {
        'Каша овсяная с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль тушёная с морковью (грамм)'] = {
        'Фасоль тушёная с морковью (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль тушёная с луком (грамм)'] = {
        'Фасоль тушёная с луком (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль томлёная с патокой (грамм)'] = {
        'Фасоль томлёная с патокой (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль варёная (грамм)'] = {
        'Фасоль варёная (100 грамм)':1 / 100,
        }

metadict_detail['Каша гречневая (грамм)'] = {
        'Каша гречневая (100 грамм)':1 / 100,
        }

metadict_detail['Каша гречневая размазня (грамм)'] = {
        'Каша гречневая размазня (100 грамм)':1 / 100,
        }

metadict_detail['Каша гречневая с грибами (грамм)'] = {
        'Каша гречневая с грибами (100 грамм)':1 / 100,
        }

metadict_detail['Каша горохово-гречневая (грамм)'] = {
        'Каша горохово-гречневая (100 грамм)':1 / 100,
        }

metadict_detail['Каша перловая (грамм)'] = {
        'Каша перловая (100 грамм)':1 / 100,
        }

metadict_detail['Каша перловая на бульоне (грамм)'] = {
        'Каша перловая на бульоне (100 грамм)':1 / 100,
        }

metadict_detail['Каша перловая на ореховом молоке (грамм)'] = {
        'Каша перловая на ореховом молоке (100 грамм)':1 / 100,
        }

metadict_detail['Каша ячневая (грамм)'] = {
        'Каша ячневая (100 грамм)':1 / 100,
        }

metadict_detail['Каша ячневая с овощами (грамм)'] = {
        'Каша ячневая с овощами (100 грамм)':1 / 100,
        }

metadict_detail['Каша ячневая с рыбой и овощами (грамм)'] = {
        'Каша ячневая с рыбой и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Каша ячневая со сливочным маслом (грамм)'] = {
        'Каша ячневая со сливочным маслом (100 грамм)':1 / 100,
        }

metadict_detail['Каша ячневая с изюмом (грамм)'] = {
        'Каша ячневая с изюмом (100 грамм)':1 / 100,
        }

metadict_detail['Каша ячневая с арахисом (грамм)'] = {
        'Каша ячневая с арахисом (100 грамм)':1 / 100,
        }

metadict_detail['Каша ячнево-гороховая (грамм)'] = {
        'Каша ячнево-гороховая (100 грамм)':1 / 100,
        }

metadict_detail['Каша гороховая (грамм)'] = {
        'Каша гороховая (100 грамм)':1 / 100,
        }

metadict_detail['Пюре гороховое с пряностями (грамм)'] = {
        'Пюре гороховое с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Каша чечевичная (грамм)'] = {
        'Каша чечевичная (100 грамм)':1 / 100,
        }

metadict_detail['Каша фасолевая (грамм)'] = {
        'Каша фасолевая (100 грамм)':1 / 100,
        }

metadict_detail['Каша кукурузно-мучная (грамм)'] = {
        'Каша кукурузно-мучная (100 грамм)':1 / 100,
        }

metadict_detail['Каша кукурузная (грамм)'] = {
        'Каша кукурузная (100 грамм)':1 / 100,
        }

metadict_detail['Каша кукурузная с фруктами (грамм)'] = {
        'Каша кукурузная с фруктами (100 грамм)':1 / 100,
        }

metadict_detail['Каша кукурузная с сухофруктами (грамм)'] = {
        'Каша кукурузная с сухофруктами (100 грамм)':1 / 100,
        }

metadict_detail['Крем заварной (грамм)'] = {
        'Крем заварной (100 грамм)':1 / 100,
        }

metadict_detail['Крем кленовый (грамм)'] = {
        'Крем кленовый (100 грамм)':1 / 100,
        }

metadict_detail['Крем лимонный (грамм)'] = {
        'Крем лимонный (100 грамм)':1 / 100,
        }

metadict_detail['Крем масленый (грамм)'] = {
        'Крем масленый (100 грамм)':1 / 100,
        }

metadict_detail['Маргарин соевый (грамм)'] = {
        'Маргарин соевый (100 грамм)':1 / 100,
        }

metadict_detail['Масло арахисовое (грамм)'] = {
        'Масло арахисовое (100 грамм)':1 / 100,
        }

metadict_detail['Пассеровка пшенично-арахисовая (грамм)'] = {
        'Пассеровка пшенично-арахисовая (100 грамм)':1 / 100,
        }

metadict_detail['Паста горчичная (грамм)'] = {
        'Паста горчичная (100 грамм)':1 / 100,
        }

metadict_detail['Паста томатная (грамм)'] = {
        'Паста томатная (100 грамм)':1 / 100,
        }

metadict_detail['Пюре томатное (грамм)'] = {
        'Пюре томатное (100 грамм)':1 / 100,
        }

metadict_detail['Паста томатная консервированная (грамм)'] = {
        'Паста томатная консервированная (100 грамм)':1 / 100,
        }

metadict_detail['Паста томатная обжаренная (грамм)'] = {
        'Паста томатная обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Паста морковно-чесночная (грамм)'] = {
        'Паста морковно-чесночная (100 грамм)':1 / 100,
        }

metadict_detail['Паста чесночно-кинзовая (грамм)'] = {
        'Паста чесночно-кинзовая (100 грамм)':1 / 100,
        }

metadict_detail['Паста имбирно-чесночная (грамм)'] = {
        'Паста имбирно-чесночная (100 грамм)':1 / 100,
        }

metadict_detail['Паста арахисовая (грамм)'] = {
        'Паста арахисовая (100 грамм)':1 / 100,
        }

metadict_detail['Паста пекановая (грамм)'] = {
        'Паста пекановая (100 грамм)':1 / 100,
        }

metadict_detail['Паста фасолевая (грамм)'] = {
        'Паста фасолевая (100 грамм)':1 / 100,
        }

metadict_detail['Паста нутовая (грамм)'] = {
        'Паста нутовая (100 грамм)':1 / 100,
        }

metadict_detail['Паста финиково-шоколадная (грамм)'] = {
        'Паста финиково-шоколадная (100 грамм)':1 / 100,
        }

metadict_detail['Паста кунжутная (грамм)'] = {
        'Паста кунжутная (100 грамм)':1 / 100,
        }

metadict_detail['Масло соевое (грамм)'] = {
        'Масло соевое (100 грамм)':1 / 100,
        }

metadict_detail['Масло подсолнечное (грамм)'] = {
        'Масло подсолнечное (100 грамм)':1 / 100,
        }

metadict_detail['Масло оливковое (грамм)'] = {
        'Масло оливковое (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для щей (грамм)'] = {
        'Масло ароматизированное для щей (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для палак панира (грамм)'] = {
        'Масло ароматизированное для палак панира (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное перечно-имбирное для жарения (грамм)'] = {
        'Масло ароматизированное перечно-имбирное для жарения (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное горчицей для жарения (грамм)'] = {
        'Масло ароматизированное горчицей для жарения (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для тушения овощей (грамм)'] = {
        'Масло ароматизированное для тушения овощей (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для бобов v1 (грамм)'] = {
        'Масло ароматизированное для бобов v1 (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для бобов v2 (грамм)'] = {
        'Масло ароматизированное для бобов v2 (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для картофеля v1 (грамм)'] = {
        'Масло ароматизированное для картофеля v1 (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для картофеля v2 (грамм)'] = {
        'Масло ароматизированное для картофеля v2 (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для запекания картофеля (грамм)'] = {
        'Масло ароматизированное для запекания картофеля (100 грамм)':1 / 100,
        }

metadict_detail['Масло льняное (грамм)'] = {
        'Масло льняное (100 грамм)':1 / 100,
        }

metadict_detail['Масло льняное прокаленное (грамм)'] = {
        'Масло льняное прокаленное (100 грамм)':1 / 100,
        }

metadict_detail['Масло кунжутное (грамм)'] = {
        'Масло кунжутное (100 грамм)':1 / 100,
        }

metadict_detail['Масло кунжутное прокаленное (грамм)'] = {
        'Масло кунжутное прокаленное (100 грамм)':1 / 100,
        }

metadict_detail['Масло конопляное (грамм)'] = {
        'Масло конопляное (100 грамм)':1 / 100,
        }

metadict_detail['Масло соевое (грамм)'] = {
        'Масло соевое (100 грамм)':1 / 100,
        }

metadict_detail['Патока чёрная (грамм)'] = {
        'Патока чёрная (100 грамм)':1 / 100,
        }

metadict_detail['Сахарная пудра (грамм)'] = {
        'Сахарная пудра (100 грамм)':1 / 100,
        }

metadict_detail['Сахар свекловичный (грамм)'] = {
        'Сахар свекловичный-сырец (100 грамм)':1 / 100,
        }

metadict_detail['Сахар тростниковый (грамм)'] = {
        'Сахар тростниковый (100 грамм)':1 / 100,
        }

metadict_detail['Сахар-песок (грамм)'] = {
        'Сахар-песок (100 грамм)':1 / 100,
        }

metadict_detail['Сахар-сырец тростниковый (грамм)'] = {
        'Сахар-сырец тростниковый (100 грамм)':1 / 100,
        }

metadict_detail['Сироп сахарный (грамм)'] = {
        'Сироп сахарный (100 грамм)':1 / 100,
        }

metadict_detail['Карамель сахарная (грамм)'] = {
        'Карамель сахарная (100 грамм)':1 / 100,
        }

metadict_detail['Сироп лимонный (грамм)'] = {
        'Сироп лимонный (100 грамм)':1 / 100,
        }

metadict_detail['Сироп клюквенный (грамм)'] = {
        'Сироп клюквенный (100 грамм)':1 / 100,
        }

metadict_detail['Сироп яблочный (грамм)'] = {
        'Сироп яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Сок яблочный (грамм)'] = {
        'Сок яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Сок лимонный (грамм)'] = {
        'Сок лимонный (100 грамм)':1 / 100,
        }

metadict_detail['Сок гранатовый (грамм)'] = {
        'Сок гранатовый (100 грамм)':1 / 100,
        }

metadict_detail['Сок виноградный (грамм)'] = {
        'Сок виноградный (100 грамм)':1 / 100,
        }

metadict_detail['Сок виноградный уваренный с мукой (грамм)'] = {
        'Сок виноградный уваренный с мукой (100 грамм)':1 / 100,
        }

metadict_detail['Сок вишнёвый (грамм)'] = {
        'Сок вишнёвый (100 грамм)':1 / 100,
        }

metadict_detail['Сок клюквенный (грамм)'] = {
        'Сок клюквенный (100 грамм)':1 / 100,
        }

metadict_detail['Сок ревеня (грамм)'] = {
        'Сок ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Сок томатный (грамм)'] = {
        'Сок томатный (100 грамм)':1 / 100,
        }

metadict_detail['Сок кленовый (грамм)'] = {
        'Сок кленовый (100 грамм)':1 / 100,
        }

metadict_detail['Сок сахарного тростника (грамм)'] = {
        'Сок сахарного тростника (100 грамм)':1 / 100,
        }

metadict_detail['Сироп кленовый (грамм)'] = {
        'Сироп кленовый (100 грамм)':1 / 100,
        }

metadict_detail['Шоколад горький (грамм)'] = {
        'Шоколад горький (100 грамм)':1 / 100,
        }

metadict_detail['Шоколад ванильный (грамм)'] = {
        'Шоколад ванильный (100 грамм)':1 / 100,
        }

metadict_detail['Шоколад с изюмом (грамм)'] = {
        'Шоколад с изюмом (100 грамм)':1 / 100,
        }

metadict_detail['Какао-порошок (грамм)'] = {
        'Какао-порошок (100 грамм)':1 / 100,
        }

metadict_detail['Какао-масло (грамм)'] = {
        'Какао-масло (100 грамм)':1 / 100,
        }

metadict_detail['Какао-бобы (грамм)'] = {
        'Какао-бобы (100 грамм)':1 / 100,
        }

metadict_detail['Медовуха вишнёвая (грамм)'] = {
        'Медовуха вишнёвая (100 грамм)':1 / 100,
        }

metadict_detail['Карамель медовая (грамм)'] = {
        'Карамель медовая (100 грамм)':1 / 100,
        }

metadict_detail['Мёд луговой (грамм)'] = {
        'Мёд луговой (100 грамм)':1 / 100,
        }

metadict_detail['Мёд засахаренный (грамм)'] = {
        'Мёд засахаренный (100 грамм)':1 / 100,
        }

metadict_detail['Кисель яблочный (грамм)'] = {
        'Кисель яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Кисель из ревеня (грамм)'] = {
        'Кисель из ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Варенье одуванчиковое (грамм)'] = {
        'Варенье одуванчиковое (100 грамм)':1 / 100,
        }

metadict_detail['Варенье земляничное (грамм)'] = {
        'Варенье земляничное (100 грамм)':1 / 100,
        }

metadict_detail['Варенье смородиновое (грамм)'] = {
        'Варенье смородиновое (100 грамм)':1 / 100,
        }

metadict_detail['Варенье рябиновое (грамм)'] = {
        'Варенье рябиновое (100 грамм)':1 / 100,
        }

metadict_detail['Варенье вишнёвое (грамм)'] = {
        'Варенье вишнёвое (100 грамм)':1 / 100,
        }

metadict_detail['Варенье клюквенное (грамм)'] = {
        'Варенье клюквенное (100 грамм)':1 / 100,
        }

metadict_detail['Компот из сухофруктов (грамм)'] = {
        'Компот из сухофруктов (100 грамм)':1 / 100,
        }

metadict_detail['Компот гранатово-яблочный с имбирем (грамм)'] = {
        'Компот гранатово-яблочный с имбирем (100 грамм)':1 / 100,
        }

metadict_detail['Компот из свежего ревеня (грамм)'] = {
        'Компот из свежего ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Компот из свежей вишни (грамм)'] = {
        'Компот из свежей вишни (100 грамм)':1 / 100,
        }

metadict_detail['Компот из свежих персиков (грамм)'] = {
        'Компот из свежих персиков (100 грамм)':1 / 100,
        }

metadict_detail['Компот из сушёной черники (грамм)'] = {
        'Компот из сушёной черники (100 грамм)':1 / 100,
        }

metadict_detail['Компот из сушёной смородины (грамм)'] = {
        'Компот из сушёной смородины (100 грамм)':1 / 100,
        }

metadict_detail['Вино красное сухое (грамм)'] = {
        'Вино красное сухое (100 грамм)':1 / 100,
        }

metadict_detail['Вино белое сухое (грамм)'] = {
        'Вино белое сухое (100 грамм)':1 / 100,
        }

metadict_detail['Джем яблочный (грамм)'] = {
        'Джем яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Джем из ревеня (грамм)'] = {
        'Джем из ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Сидр яблочный (грамм)'] = {
        'Сидр яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Сидр грушевый (грамм)'] = {
        'Сидр грушевый (100 грамм)':1 / 100,
        }

metadict_detail['Уксус яблочный 3% (грамм)'] = {
        'Уксус яблочный 3% (100 грамм)':1 / 100,
        }

metadict_detail['Уксус яблочный 6% (грамм)'] = {
        'Уксус яблочный 6% (100 грамм)':1 / 100,
        }

metadict_detail['Уксус виноградный 3% (грамм)'] = {
        'Уксус виноградный 3% (100 грамм)':1 / 100,
        }

metadict_detail['Уксус виноградный 6% (грамм)'] = {
        'Уксус виноградный 6% (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко мочёное (грамм)'] = {
        'Яблоко мочёное (100 грамм)':1 / 100,
        }

metadict_detail['Груша мочёная (грамм)'] = {
        'Груша мочёная (100 грамм)':1 / 100,
        }

metadict_detail['Слива мочёная (грамм)'] = {
        'Слива мочёная (100 грамм)':1 / 100,
        }

metadict_detail['Морошка мочёная (грамм)'] = {
        'Морошка мочёная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста квашеная (грамм)'] = {
        'Капуста квашеная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста квашеная томлёная (грамм)'] = {
        'Капуста квашеная томлёная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста квашеная с соевым соусом (грамм)'] = {
        'Капуста квашеная с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Капуста тушёная (грамм)'] = {
        'Капуста тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста тушёная с пряным соусом (грамм)'] = {
        'Капуста тушёная с пряным соусом (100 грамм)':1 / 100,
        }

metadict_detail['Салат капустный с пряностями (грамм)'] = {
        'Салат капустный с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Капуста обжаренная в сухарях (грамм)'] = {
        'Капуста обжаренная в сухарях (100 грамм)':1 / 100,
        }

metadict_detail['Капуста бланшированная (грамм)'] = {
        'Капуста бланшированная (100 грамм)':1 / 100,
        }

metadict_detail['Винегрет с мочёными фруктами (грамм)'] = {
        'Винегрет с мочёными фруктами (100 грамм)':1 / 100,
        }

metadict_detail['Винегрет с маринованными каперсами (грамм)'] = {
        'Винегрет с маринованными каперсами (100 грамм)':1 / 100,
        }

metadict_detail['Винегрет с боровиками (грамм)'] = {
        'Винегрет с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Винегрет с чечевицей (грамм)'] = {
        'Винегрет с чечевицей (100 грамм)':1 / 100,
        }

metadict_detail['Винегрет с зелёным горошком (грамм)'] = {
        'Винегрет с зелёным горошком (100 грамм)':1 / 100,
        }

metadict_detail['Винегрет овощной (грамм)'] = {
        'Винегрет овощной (100 грамм)':1 / 100,
        }

metadict_detail['Салат зелёный огуречный с редисом (грамм)'] = {
        'Салат зелёный огуречный с редисом (100 грамм)':1 / 100,
        }

metadict_detail['Салат зелёный огуречно-томатный (грамм)'] = {
        'Салат зелёный огуречно-томатный (100 грамм)':1 / 100,
        }

metadict_detail['Салат зелёный томатный со сладким перцем (грамм)'] = {
        'Салат зелёный томатный со сладким перцем (100 грамм)':1 / 100,
        }

metadict_detail['Салат из морской капусты с соевым соусом (грамм)'] = {
        'Салат из морской капусты с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Салат огуречно-морковный с соевым соусом (грамм)'] = {
        'Салат огуречно-морковный с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Салат морковный с соевым соусом (грамм)'] = {
        'Салат морковный с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Салат из брокколи с огурцами (грамм)'] = {
        'Салат из брокколи с огурцами (100 грамм)':1 / 100,
        }

metadict_detail['Салат из варёной спаржи со шпинатом (грамм)'] = {
        'Салат из варёной спаржи со шпинатом (100 грамм)':1 / 100,
        }

metadict_detail['Закуска из квашеной капусты (грамм)'] = {
        'Закуска из квашеной капусты (100 грамм)':1 / 100,
        }

metadict_detail['Салат из свежей свёклы (грамм)'] = {
        'Салат из свежей свёклы (100 грамм)':1 / 100,
        }

metadict_detail['Салат из варёной свёклы (грамм)'] = {
        'Салат из варёной свёклы (100 грамм)':1 / 100,
        }

metadict_detail['Салат из солёных кабачков (грамм)'] = {
        'Салат из солёных кабачков (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла квашеная (грамм)'] = {
        'Свёкла квашеная (100 грамм)':1 / 100,
        }

metadict_detail['Кабачок солёный (грамм)'] = {
        'Кабачок солёный (100 грамм)':1 / 100,
        }

metadict_detail['Огурцы солёные (грамм)'] = {
        'Огурцы солёные (100 грамм)':1 / 100,
        }

metadict_detail['Огурцы подсушенные солью (грамм)'] = {
        'Огурцы подсушенные солью (100 грамм)':1 / 100,
        }

metadict_detail['Томаты солёные (грамм)'] = {
        'Томаты солёные (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко варёное (грамм)'] = {
        'Яблоко варёное (100 грамм)':1 / 100,
        }

metadict_detail['Слива варёная (грамм)'] = {
        'Слива варёная (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко печёное (грамм)'] = {
        'Яблоко печёное (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко печёное с мёдом (грамм)'] = {
        'Яблоко печёное с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко печёное с орехами пекана (грамм)'] = {
        'Яблоко печёное с орехами пекана (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла печёная (грамм)'] = {
        'Свёкла печёная (100 грамм)':1 / 100,
        }

metadict_detail['Запеканка свекольная с сухофруктами (грамм)'] = {
        'Запеканка свекольная с сухофруктами (100 грамм)':1 / 100,
        }

metadict_detail['Запеканка свекольная с фруктами (грамм)'] = {
        'Запеканка свекольная с фруктами (100 грамм)':1 / 100,
        }

metadict_detail['Салат из печёной свёклы с черникой (грамм)'] = {
        'Салат из печёной свёклы с черникой (100 грамм)':1 / 100,
        }

metadict_detail['Салат из печёной свёклы со спаржей и редисом (грамм)'] = {
        'Салат из печёной свёклы со спаржей и редисом (100 грамм)':1 / 100,
        }

metadict_detail['Тыква варёная (грамм)'] = {
        'Тыква варёная (100 грамм)':1 / 100,
        }

metadict_detail['Тыква печёная (грамм)'] = {
        'Тыква печёная (100 грамм)':1 / 100,
        }

metadict_detail['Тыква фаршированная картофелем с пряностями (грамм)'] = {
        'Тыква фаршированная картофелем с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Тыква фаршированная лечо и чечевицей (грамм)'] = {
        'Тыква фаршированная лечо и чечевицей (100 грамм)':1 / 100,
        }

metadict_detail['Тыква фаршированная гречкой и грибами (грамм)'] = {
        'Тыква фаршированная гречкой и грибами (100 грамм)':1 / 100,
        }

metadict_detail['Тыква фаршированная пшённой кашей (грамм)'] = {
        'Тыква фаршированная пшённой кашей (100 грамм)':1 / 100,
        }

metadict_detail['Тыква тушёная (грамм)'] = {
        'Тыква тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Батат варёный (грамм)'] = {
        'Батат варёный (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла варёная (грамм)'] = {
        'Свёкла варёная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь маринованная (грамм)'] = {
        'Морковь маринованная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь варёная (грамм)'] = {
        'Морковь варёная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь шинкованная печёная (грамм)'] = {
        'Морковь шинкованная печёная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь печёная с розмарином (грамм)'] = {
        'Морковь печёная с розмарином (100 грамм)':1 / 100,
        }

metadict_detail['Морковь тушёная с турнепсом и картофелем (грамм)'] = {
        'Морковь тушёная с турнепсом и картофелем (100 грамм)':1 / 100,
        }

metadict_detail['Морковь шинкованная обжаренная (грамм)'] = {
        'Морковь шинкованная обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь печёная в медовой глазури (грамм)'] = {
        'Морковь печёная в медовой глазури (100 грамм)':1 / 100,
        }

metadict_detail['Лук шинкованный обжаренный (грамм)'] = {
        'Лук шинкованный обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Лук шинкованный печёный (грамм)'] = {
        'Лук шинкованный печёный (100 грамм)':1 / 100,
        }

metadict_detail['Чай травяной (грамм)'] = {
        'Чай травяной (100 грамм)':1 / 100,
        }

metadict_detail['Чай травяной с сахаром (грамм)'] = {
        'Чай травяной с сахаром (100 грамм)':1 / 100,
        }

metadict_detail['Чай травяной с мёдом (грамм)'] = {
        'Чай травяной с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Чай травяной с кленовым сиропом (грамм)'] = {
        'Чай травяной с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Чай чёрный (грамм)'] = {
        'Чай чёрный (100 грамм)':1 / 100,
        }

metadict_detail['Чай чёрный с лимоном (грамм)'] = {
        'Чай чёрный с лимоном (100 грамм)':1 / 100,
        }

metadict_detail['Чай чёрный с сахаром и лимоном (грамм)'] = {
        'Чай чёрный с сахаром и лимоном (100 грамм)':1 / 100,
        }

metadict_detail['Чай чёрный с сахаром (грамм)'] = {
        'Чай чёрный с сахаром (100 грамм)':1 / 100,
        }

metadict_detail['Чай чёрный с мёдом (грамм)'] = {
        'Чай чёрный с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Чай чёрный с кленовым сиропом (грамм)'] = {
        'Чай чёрный с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Заварка чёрного чая (грамм)'] = {
        'Заварка чёрного чая (100 грамм)':1 / 100,
        }

metadict_detail['Заварка травяного чая (грамм)'] = {
        'Заварка травяного чая (100 грамм)':1 / 100,
        }

metadict_detail['Квас ржаной имбирно-яблочный (грамм)'] = {
        'Квас ржаной имбирно-яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Квас ржаной хлебный (грамм)'] = {
        'Квас ржаной хлебный (100 грамм)':1 / 100,
        }

metadict_detail['Квас ржаной солодовый (грамм)'] = {
        'Квас ржаной солодовый (100 грамм)':1 / 100,
        }

metadict_detail['Квас ржано-гречневый солодовый (грамм)'] = {
        'Квас ржано-гречневый солодовый (100 грамм)':1 / 100,
        }

metadict_detail['Квас свекольный (грамм)'] = {
        'Квас свекольный (100 грамм)':1 / 100,
        }

metadict_detail['Эль имбирный (грамм)'] = {
        'Эль имбирный (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для овощного террина (грамм)'] = {
        'Заправка для овощного террина (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для винегрета на подсолнечном масле (грамм)'] = {
        'Заправка для винегрета на подсолнечном масле (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов медово-горчичная (грамм)'] = {
        'Заправка для салатов медово-горчичная (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов лимонно-соевая (грамм)'] = {
        'Заправка для салатов лимонно-соевая (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов на соевом соусе (грамм)'] = {
        'Заправка для салатов на соевом соусе (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов на подсолнечном масле (грамм)'] = {
        'Заправка для салатов на подсолнечном масле (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов на конопляном масле (грамм)'] = {
        'Заправка для салатов на конопляном масле (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов на оливковом масле (грамм)'] = {
        'Заправка для салатов на оливковом масле (100 грамм)':1 / 100,
        }

metadict_detail['Рассол 20% (грамм)'] = {
        'Рассол 20% (100 грамм)':1 / 100,
        }

metadict_detail['Рассол свекольный (грамм)'] = {
        'Рассол свекольный (100 грамм)':1 / 100,
        }

metadict_detail['Рассол огуречный (грамм)'] = {
        'Рассол огуречный (100 грамм)':1 / 100,
        }

metadict_detail['Рассол для квашения овощей (грамм)'] = {
        'Рассол для квашения овощей (100 грамм)':1 / 100,
        }

metadict_detail['Рассол для соления овощей (грамм)'] = {
        'Рассол для соления овощей (100 грамм)':1 / 100,
        }

metadict_detail['Рассол для соления грибов (грамм)'] = {
        'Рассол для соления грибов (100 грамм)':1 / 100,
        }

metadict_detail['Маринад для консервации грибов (грамм)'] = {
        'Маринад для консервации грибов (100 грамм)':1 / 100,
        }

metadict_detail['Маринад для консервации оливок (грамм)'] = {
        'Маринад для консервации оливок (100 грамм)':1 / 100,
        }

metadict_detail['Рассол для мочения фруктов (грамм)'] = {
        'Рассол для мочения фруктов (100 грамм)':1 / 100,
        }

metadict_detail['Вода кипячёная (грамм)'] = {
        'Вода кипячёная (100 грамм)':1 / 100,
        }

metadict_detail['Вода кипячёная в самоваре (грамм)'] = {
        'Вода кипячёная в самоваре (100 грамм)':1 / 100,
        }

metadict_detail['Вода кипячёная в котелке (грамм)'] = {
        'Вода кипячёная в котелке (100 грамм)':1 / 100,
        }

metadict_detail['Вода для готовки (грамм)'] = {
        'Вода для готовки (100 грамм)':1 / 100,
        }

#----
# Пища многокомпонентная (100 грамм --> килограмм):

metadict_detail['Фрукты закавказские летние (100 грамм)'] = {
        'Фрукты закавказские летние (килограмм)':1 / 10,
        }

metadict_detail['Фрукты мочёные североморские (100 грамм)'] = {
        'Фрукты мочёные североморские (килограмм)':1 / 10,
        }

metadict_detail['Фрукты летние североморские (100 грамм)'] = {
        'Фрукты летние североморские (килограмм)':1 / 10,
        }

metadict_detail['Фрукты летние среднеземные (100 грамм)'] = {
        'Фрукты летние среднеземные (килограмм)':1 / 10,
        }

metadict_detail['Фрукты летние южноморские (100 грамм)'] = {
        'Фрукты летние южноморские (килограмм)':1 / 10,
        }

metadict_detail['Фрукты осенние североморские (100 грамм)'] = {
        'Фрукты осенние североморские (килограмм)':1 / 10,
        }

metadict_detail['Фрукты осенние среднеземные (100 грамм)'] = {
        'Фрукты осенние среднеземные (килограмм)':1 / 10,
        }

metadict_detail['Фрукты осенние южноморские (100 грамм)'] = {
        'Фрукты осенние южноморские (килограмм)':1 / 10,
        }

metadict_detail['Масло льняное прокаленное (100 грамм)'] = {
        'Масло льняное прокаленное (килограмм)':1 / 10,
        }

metadict_detail['Масло кунжутное прокаленное (100 грамм)'] = {
        'Масло кунжутное прокаленное (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для щей (100 грамм)'] = {
        'Масло ароматизированное для щей (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для палак панира (100 грамм)'] = {
        'Масло ароматизированное для палак панира (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное перечно-имбирное для жарения (100 грамм)'] = {
        'Масло ароматизированное перечно-имбирное для жарения (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное горчицей для жарения (100 грамм)'] = {
        'Масло ароматизированное горчицей для жарения (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для тушения овощей (100 грамм)'] = {
        'Масло ароматизированное для тушения овощей (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для бобов v1 (100 грамм)'] = {
        'Масло ароматизированное для бобов v1 (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для бобов v2 (100 грамм)'] = {
        'Масло ароматизированное для бобов v2 (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для картофеля v1 (100 грамм)'] = {
        'Масло ароматизированное для картофеля v1 (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для картофеля v2 (100 грамм)'] = {
        'Масло ароматизированное для картофеля v2 (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для запекания картофеля (100 грамм)'] = {
        'Масло ароматизированное для запекания картофеля (килограмм)':1 / 10,
        }

metadict_detail['Пряности для щей (100 грамм)'] = {
        'Пряности для щей (килограмм)':1 / 10,
        }

metadict_detail['Пряности для минестроне (100 грамм)'] = {
        'Пряности для минестроне (килограмм)':1 / 10,
        }

metadict_detail['Пряности букета гарни с петрушкой (100 грамм)'] = {
        'Пряности букета гарни с петрушкой (килограмм)':1 / 10,
        }

metadict_detail['Пряности букета гарни с розмарином (100 грамм)'] = {
        'Пряности букета гарни с розмарином (килограмм)':1 / 10,
        }

metadict_detail['Пряности прованские (100 грамм)'] = {
        'Пряности прованские (килограмм)':1 / 10,
        }

metadict_detail['Пряности для тыквы (100 грамм)'] = {
        'Пряности для тыквы (килограмм)':1 / 10,
        }

metadict_detail['Пряности для бобовых североморские (100 грамм)'] = {
        'Пряности для бобовых североморские (килограмм)':1 / 10,
        }

metadict_detail['Пряности для бобовых южноморские (100 грамм)'] = {
        'Пряности для бобовых южноморские (килограмм)':1 / 10,
        }

metadict_detail['Пряности для овощного маринада с тмином (100 грамм)'] = {
        'Пряности для овощного маринада с тмином (килограмм)':1 / 10,
        }

metadict_detail['Пряности для овощного маринада (100 грамм)'] = {
        'Пряности для овощного маринада (килограмм)':1 / 10,
        }

metadict_detail['Пряности для фруктового маринада (100 грамм)'] = {
        'Пряности для фруктового маринада (килограмм)':1 / 10,
        }

metadict_detail['Пряности нежного карри (100 грамм)'] = {
        'Пряности нежного карри (килограмм)':1 / 10,
        }

metadict_detail['Пряности светлого карри (100 грамм)'] = {
        'Пряности светлого карри (килограмм)':1 / 10,
        }

metadict_detail['Пряности гарам масала (100 грамм)'] = {
        'Пряности гарам масала (килограмм)':1 / 10,
        }

metadict_detail['Пряности чат масала (100 грамм)'] = {
        'Пряности чат масала (килограмм)':1 / 10,
        }

metadict_detail['Пряности самбар масала (100 грамм)'] = {
        'Пряности самбар масала (килограмм)':1 / 10,
        }

metadict_detail['Пряности чили (100 грамм)'] = {
        'Пряности чили (килограмм)':1 / 10,
        }

metadict_detail['Пряности кондитерские (100 грамм)'] = {
        'Пряности кондитерские (килограмм)':1 / 10,
        }

metadict_detail['Пряности для фалафели (100 грамм)'] = {
        'Пряности для фалафели (килограмм)':1 / 10,
        }

metadict_detail['Пряности для овощей из восьми растений (100 грамм)'] = {
        'Пряности для овощей из восьми растений (килограмм)':1 / 10,
        }

metadict_detail['Пряности для овощей из трёх растений (100 грамм)'] = {
        'Пряности для овощей из трёх растений (килограмм)':1 / 10,
        }

metadict_detail['Пряности для овощей из пяти растений (100 грамм)'] = {
        'Пряности для овощей из пяти растений (килограмм)':1 / 10,
        }

metadict_detail['Пряности пряничные (100 грамм)'] = {
        'Пряности пряничные (килограмм)':1 / 10,
        }

metadict_detail['Пряности хмели-сунели упрощённые (100 грамм)'] = {
        'Пряности хмели-сунели упрощённые (килограмм)':1 / 10,
        }

metadict_detail['Пряности хмели-сунели (100 грамм)'] = {
        'Пряности хмели-сунели (килограмм)':1 / 10,
        }

metadict_detail['Ботвинья-свекольник (100 грамм)'] = {
        'Ботвинья-свекольник (килограмм)':1 / 10,
        }

metadict_detail['Заправка зелёная для ботвиньи (100 грамм)'] = {
        'Заправка зелёная для ботвиньи (килограмм)':1 / 10,
        }

metadict_detail['Заправка овощная для ботвиньи (100 грамм)'] = {
        'Заправка овощная для ботвиньи (килограмм)':1 / 10,
        }

metadict_detail['Основа квасная для ботвиньи (100 грамм)'] = {
        'Основа квасная для ботвиньи (килограмм)':1 / 10,
        }

metadict_detail['Заправка овощная для щей (100 грамм)'] = {
        'Заправка овощная для щей (килограмм)':1 / 10,
        }

metadict_detail['Заправка овощная для рассольника (100 грамм)'] = {
        'Заправка овощная для рассольника (килограмм)':1 / 10,
        }

metadict_detail['Овощи жареные для томатного супа (100 грамм)'] = {
        'Овощи жареные для томатного супа (килограмм)':1 / 10,
        }

metadict_detail['Корнеплоды пряные обжаренные для бульона (100 грамм)'] = {
        'Корнеплоды пряные обжаренные для бульона (килограмм)':1 / 10,
        }

metadict_detail['Овощи пряные нарезанные для бульона (100 грамм)'] = {
        'Овощи пряные нарезанные для бульона (килограмм)':1 / 10,
        }

metadict_detail['Корнеплоды крахмалистые нарезанные для бульона (100 грамм)'] = {
        'Корнеплоды крахмалистые нарезанные для бульона (килограмм)':1 / 10,
        }

metadict_detail['Овощи сезонные нарезанные для бульона (100 грамм)'] = {
        'Овощи сезонные нарезанные для бульона (килограмм)':1 / 10,
        }

metadict_detail['Овощи обжаренные для минестроне (100 грамм)'] = {
        'Овощи обжаренные для минестроне (килограмм)':1 / 10,
        }

metadict_detail['Овощи обжаренные для супа-лапши (100 грамм)'] = {
        'Овощи обжаренные для супа-лапши (килограмм)':1 / 10,
        }

metadict_detail['Заправка овощная для рагу (100 грамм)'] = {
        'Заправка овощная для рагу (килограмм)':1 / 10,
        }

metadict_detail['Корнеплоды обжаренные для рагу (100 грамм)'] = {
        'Корнеплоды обжаренные для рагу (килограмм)':1 / 10,
        }

metadict_detail['Овощи сезонные обжаренные для рагу (100 грамм)'] = {
        'Овощи сезонные обжаренные для рагу (килограмм)':1 / 10,
        }

metadict_detail['Овощи обжаренные для рассольника (100 грамм)'] = {
        'Овощи обжаренные для рассольника (килограмм)':1 / 10,
        }

metadict_detail['Овощи обжаренные для борща (100 грамм)'] = {
        'Овощи обжаренные для борща (килограмм)':1 / 10,
        }

metadict_detail['Овощи пряные нарезанные для похлёбки (100 грамм)'] = {
        'Овощи пряные нарезанные для похлёбки (килограмм)':1 / 10,
        }

metadict_detail['Овощи пряные шинкованные обжаренные (100 грамм)'] = {
        'Овощи пряные шинкованные обжаренные (килограмм)':1 / 10,
        }

metadict_detail['Овощи пряные шинкованные запечённые (100 грамм)'] = {
        'Овощи пряные шинкованные запечённые (килограмм)':1 / 10,
        }

metadict_detail['Крем маслено-горчичный (100 грамм)'] = {
        'Крем маслено-горчичный (килограмм)':1 / 10,
        }

metadict_detail['Горчица столовая (100 грамм)'] = {
        'Горчица столовая (килограмм)':1 / 10,
        }

metadict_detail['Горчица медовая (100 грамм)'] = {
        'Горчица медовая (килограмм)':1 / 10,
        }

metadict_detail['Крем заварной (100 грамм)'] = {
        'Крем заварной (килограмм)':1 / 10,
        }

metadict_detail['Крем кленовый (100 грамм)'] = {
        'Крем кленовый (килограмм)':1 / 10,
        }

metadict_detail['Крем лимонный (100 грамм)'] = {
        'Крем лимонный (килограмм)':1 / 10,
        }

metadict_detail['Крем масленый (100 грамм)'] = {
        'Крем масленый (килограмм)':1 / 10,
        }

metadict_detail['Маргарин соевый (100 грамм)'] = {
        'Маргарин соевый (килограмм)':1 / 10,
        }

metadict_detail['Медовуха вишнёвая (100 грамм)'] = {
        'Медовуха вишнёвая (килограмм)':1 / 10,
        }

metadict_detail['Мёд засахаренный (100 грамм)'] = {
        'Мёд засахаренный (килограмм)':1 / 10,
        }

metadict_detail['Хрен тёртый (100 грамм)'] = {
        'Хрен тёртый (килограмм)':1 / 10,
        }

metadict_detail['Редька тёртая (100 грамм)'] = {
        'Редька тёртая (килограмм)':1 / 10,
        }

metadict_detail['Зелень укропа сушёная (100 грамм)'] = {
        'Зелень укропа сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень чабера сушёная (100 грамм)'] = {
        'Зелень чабера сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень мяты сушёная (100 грамм)'] = {
        'Зелень мяты сушёная (килограмм)':1 / 10,
        }

metadict_detail['Лист карри сушёный (100 грамм)'] = {
        'Лист карри сушёный (килограмм)':1 / 10,
        }

metadict_detail['Чеснок чищеный печёный (100 грамм)'] = {
        'Чеснок чищеный печёный (килограмм)':1 / 10,
        }

metadict_detail['Чеснок давленый (100 грамм)'] = {
        'Чеснок давленый (килограмм)':1 / 10,
        }

metadict_detail['Чеснок давленый обжаренный (100 грамм)'] = {
        'Чеснок давленый обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Чеснок сушёный (100 грамм)'] = {
        'Чеснок сушёный (килограмм)':1 / 10,
        }

metadict_detail['Лук шинкованный (100 грамм)'] = {
        'Лук шинкованный (килограмм)':1 / 10,
        }

metadict_detail['Лук томлёный с томатами (100 грамм)'] = {
        'Лук томлёный с томатами (килограмм)':1 / 10,
        }

metadict_detail['Лук сушёный (100 грамм)'] = {
        'Лук сушёный (килограмм)':1 / 10,
        }

metadict_detail['Зелень лука шинкованная (100 грамм)'] = {
        'Зелень лука шинкованная (килограмм)':1 / 10,
        }

metadict_detail['Черника сушёная (100 грамм)'] = {
        'Черника сушёная (килограмм)':1 / 10,
        }

metadict_detail['Смородина сушёная (100 грамм)'] = {
        'Смородина сушёная (килограмм)':1 / 10,
        }

metadict_detail['Малина сушёная (100 грамм)'] = {
        'Малина сушёная (килограмм)':1 / 10,
        }

metadict_detail['Рябина сушёная (100 грамм)'] = {
        'Рябина сушёная (килограмм)':1 / 10,
        }

metadict_detail['Шиповник сушёный (100 грамм)'] = {
        'Шиповник сушёный (килограмм)':1 / 10,
        }

metadict_detail['Клюква сушёная (100 грамм)'] = {
        'Клюква сушёная (килограмм)':1 / 10,
        }

metadict_detail['Яблоко сушёное (100 грамм)'] = {
        'Яблоко сушёное (килограмм)':1 / 10,
        }

metadict_detail['Вишня сушёная (100 грамм)'] = {
        'Вишня сушёная (килограмм)':1 / 10,
        }

metadict_detail['Персик сушёный (100 грамм)'] = {
        'Персик сушёный (килограмм)':1 / 10,
        }

metadict_detail['Абрикос сушёный (100 грамм)'] = {
        'Абрикос сушёный (килограмм)':1 / 10,
        }

metadict_detail['Слива сушёная (100 грамм)'] = {
        'Слива сушёная (килограмм)':1 / 10,
        }

metadict_detail['Груша сушёная (100 грамм)'] = {
        'Груша сушёная (килограмм)':1 / 10,
        }

metadict_detail['Груша печёная (100 грамм)'] = {
        'Груша печёная (килограмм)':1 / 10,
        }

metadict_detail['Инжир сушёный (100 грамм)'] = {
        'Инжир сушёный (килограмм)':1 / 10,
        }

metadict_detail['Алыча сушёная (100 грамм)'] = {
        'Алыча сушёная (килограмм)':1 / 10,
        }

metadict_detail['Алыча уваренная протёртая (100 грамм)'] = {
        'Алыча уваренная протёртая (килограмм)':1 / 10,
        }

metadict_detail['Манго сушёный (100 грамм)'] = {
        'Манго сушёный (килограмм)':1 / 10,
        }

metadict_detail['Томаты сушёные (100 грамм)'] = {
        'Томаты сушёные (килограмм)':1 / 10,
        }

metadict_detail['Томаты вяленые (100 грамм)'] = {
        'Томаты вяленые (килограмм)':1 / 10,
        }

metadict_detail['Виноград сушёный (100 грамм)'] = {
        'Виноград сушёный (килограмм)':1 / 10,
        }

metadict_detail['Лист лавра сушёный (100 грамм)'] = {
        'Лист лавра сушёный (килограмм)':1 / 10,
        }

metadict_detail['Вёшенки варёные (100 грамм)'] = {
        'Вёшенки варёные (килограмм)':1 / 10,
        }

metadict_detail['Вёшенки тушёные (100 грамм)'] = {
        'Вёшенки тушёные (килограмм)':1 / 10,
        }

metadict_detail['Вёшенки обжаренные (100 грамм)'] = {
        'Вёшенки обжаренные (килограмм)':1 / 10,
        }

metadict_detail['Вёшенки обжаренные с соевым соусом (100 грамм)'] = {
        'Вёшенки обжаренные с соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Шампиньоны варёные (100 грамм)'] = {
        'Шампиньоны варёные (килограмм)':1 / 10,
        }

metadict_detail['Шампиньоны обжаренные (100 грамм)'] = {
        'Шампиньоны обжаренные (килограмм)':1 / 10,
        }

metadict_detail['Шампиньоны тушёные (100 грамм)'] = {
        'Шампиньоны тушёные (килограмм)':1 / 10,
        }

metadict_detail['Рагу овощное с шампиньонами (100 грамм)'] = {
        'Рагу овощное с шампиньонами (килограмм)':1 / 10,
        }

metadict_detail['Шампиньоны тушёные консервированные (100 грамм)'] = {
        'Шампиньоны тушёные консервированные (килограмм)':1 / 10,
        }

metadict_detail['Шампиньоны жареные с луком (100 грамм)'] = {
        'Шампиньоны жареные с луком (килограмм)':1 / 10,
        }

metadict_detail['Шампиньоны запечённые (100 грамм)'] = {
        'Шампиньоны запечённые (килограмм)':1 / 10,
        }

metadict_detail['Соус соевый (100 грамм)'] = {
        'Соус соевый (килограмм)':1 / 10,
        }

metadict_detail['Соус арахисовый острый (100 грамм)'] = {
        'Соус арахисовый острый (килограмм)':1 / 10,
        }

metadict_detail['Темпе (100 грамм)'] = {
        'Темпе (килограмм)':1 / 10,
        }

metadict_detail['Темпе обжаренный (100 грамм)'] = {
        'Темпе обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Соя варёная (100 грамм)'] = {
        'Соя варёная (килограмм)':1 / 10,
        }

metadict_detail['Соя замоченная (100 грамм)'] = {
        'Соя замоченная (килограмм)':1 / 10,
        }

metadict_detail['Соус томатный (100 грамм)'] = {
        'Соус томатный (килограмм)':1 / 10,
        }

metadict_detail['Пюре томатное с луком и кешью (100 грамм)'] = {
        'Пюре томатное с луком и кешью (килограмм)':1 / 10,
        }

metadict_detail['Соус кабачковый (100 грамм)'] = {
        'Соус кабачковый (килограмм)':1 / 10,
        }

metadict_detail['Лютеница (100 грамм)'] = {
        'Лютеница (килограмм)':1 / 10,
        }

metadict_detail['Лютеница консервированная (100 грамм)'] = {
        'Лютеница консервированная (килограмм)':1 / 10,
        }

metadict_detail['Яйцо куриное взбитое с солью и уксусом (100 грамм)'] = {
        'Яйцо куриное взбитое с солью и уксусом (килограмм)':1 / 10,
        }

metadict_detail['Соус алычовый (100 грамм)'] = {
        'Соус алычовый (килограмм)':1 / 10,
        }

metadict_detail['Соус пряный с грецкими орехами (100 грамм)'] = {
        'Соус пряный с грецкими орехами (килограмм)':1 / 10,
        }

metadict_detail['Соус финиковый (100 грамм)'] = {
        'Соус финиковый (килограмм)':1 / 10,
        }

metadict_detail['Соус томатный консервированный (100 грамм)'] = {
        'Соус томатный консервированный (килограмм)':1 / 10,
        }

metadict_detail['Паста томатная консервированная (100 грамм)'] = {
        'Паста томатная консервированная (килограмм)':1 / 10,
        }

metadict_detail['Паста томатная обжаренная (100 грамм)'] = {
        'Паста томатная обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Пассеровка пшенично-арахисовая (100 грамм)'] = {
        'Пассеровка пшенично-арахисовая (килограмм)':1 / 10,
        }

metadict_detail['Паста горчичная (100 грамм)'] = {
        'Паста горчичная (килограмм)':1 / 10,
        }

metadict_detail['Соус баклажанный (100 грамм)'] = {
        'Соус баклажанный (килограмм)':1 / 10,
        }

metadict_detail['Соус баклажанный консервированный (100 грамм)'] = {
        'Соус баклажанный консервированный (килограмм)':1 / 10,
        }

metadict_detail['Соус песто с томатами (100 грамм)'] = {
        'Соус песто с томатами (килограмм)':1 / 10,
        }

metadict_detail['Соус песто с томатами консервированный (100 грамм)'] = {
        'Соус песто с томатами консервированный (килограмм)':1 / 10,
        }

metadict_detail['Соус песто с темпе (100 грамм)'] = {
        'Соус песто с темпе (килограмм)':1 / 10,
        }

metadict_detail['Соус песто с темпе консервированный (100 грамм)'] = {
        'Соус песто с темпе консервированный (килограмм)':1 / 10,
        }

metadict_detail['Боровики сушёные (100 грамм)'] = {
        'Боровики сушёные (килограмм)':1 / 10,
        }

metadict_detail['Боровики замоченные (100 грамм)'] = {
        'Боровики замоченные (килограмм)':1 / 10,
        }

metadict_detail['Боровики солёные (100 грамм)'] = {
        'Боровики солёные (килограмм)':1 / 10,
        }

metadict_detail['Боровики маринованные (100 грамм)'] = {
        'Боровики маринованные (килограмм)':1 / 10,
        }

metadict_detail['Закуска из боровиков с луком (100 грамм)'] = {
        'Закуска из боровиков с луком (килограмм)':1 / 10,
        }

metadict_detail['Боровики жареные с луком (100 грамм)'] = {
        'Боровики жареные с луком (килограмм)':1 / 10,
        }

metadict_detail['Боровики обжаренные (100 грамм)'] = {
        'Боровики обжаренные (килограмм)':1 / 10,
        }

metadict_detail['Боровики обжаренные с тимьяном (100 грамм)'] = {
        'Боровики обжаренные с тимьяном (килограмм)':1 / 10,
        }

metadict_detail['Боровики тушёные (100 грамм)'] = {
        'Боровики тушёные (килограмм)':1 / 10,
        }

metadict_detail['Боровики тушёные замоченные (100 грамм)'] = {
        'Боровики тушёные замоченные (килограмм)':1 / 10,
        }

metadict_detail['Боровики тушёные в вине (100 грамм)'] = {
        'Боровики тушёные в вине (килограмм)':1 / 10,
        }

metadict_detail['Боровики варёные (100 грамм)'] = {
        'Боровики варёные (килограмм)':1 / 10,
        }

metadict_detail['Сморчки сушёные (100 грамм)'] = {
        'Сморчки сушёные (килограмм)':1 / 10,
        }

metadict_detail['Сморчки жареные во фритюре (100 грамм)'] = {
        'Сморчки жареные во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Сморчки жареные с луком (100 грамм)'] = {
        'Сморчки жареные с луком (килограмм)':1 / 10,
        }

metadict_detail['Сморчки варёные (100 грамм)'] = {
        'Сморчки варёные (килограмм)':1 / 10,
        }

metadict_detail['Сморчки обжаренные (100 грамм)'] = {
        'Сморчки обжаренные (килограмм)':1 / 10,
        }

metadict_detail['Сморчки тушёные (100 грамм)'] = {
        'Сморчки тушёные (килограмм)':1 / 10,
        }

metadict_detail['Чечевица варёная (100 грамм)'] = {
        'Чечевица варёная (килограмм)':1 / 10,
        }

metadict_detail['Чечевица тушёная (100 грамм)'] = {
        'Чечевица тушёная (килограмм)':1 / 10,
        }

metadict_detail['Чечевица замоченная (100 грамм)'] = {
        'Чечевица замоченная (килограмм)':1 / 10,
        }

metadict_detail['Урд замоченный (100 грамм)'] = {
        'Урд замоченный (килограмм)':1 / 10,
        }

metadict_detail['Горох варёный (100 грамм)'] = {
        'Горох варёный (килограмм)':1 / 10,
        }

metadict_detail['Горох замоченный (100 грамм)'] = {
        'Горох замоченный (килограмм)':1 / 10,
        }

metadict_detail['Нут замоченный (100 грамм)'] = {
        'Нут замоченный (килограмм)':1 / 10,
        }

metadict_detail['Нут тушёный с томатами и пряностями (100 грамм)'] = {
        'Нут тушёный с томатами и пряностями (килограмм)':1 / 10,
        }

metadict_detail['Нут варёный (100 грамм)'] = {
        'Нут варёный (килограмм)':1 / 10,
        }

metadict_detail['Фасоль замоченная (100 грамм)'] = {
        'Фасоль замоченная (килограмм)':1 / 10,
        }

metadict_detail['Крупа пшеничная варёная (100 грамм)'] = {
        'Крупа пшеничная варёная (килограмм)':1 / 10,
        }

metadict_detail['Чай травяной (100 грамм)'] = {
        'Чай травяной (килограмм)':1 / 10,
        }

metadict_detail['Чай травяной с сахаром (100 грамм)'] = {
        'Чай травяной с сахаром (килограмм)':1 / 10,
        }

metadict_detail['Чай травяной с мёдом (100 грамм)'] = {
        'Чай травяной с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Чай травяной с кленовым сиропом (100 грамм)'] = {
        'Чай травяной с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Чай чёрный (100 грамм)'] = {
        'Чай чёрный (килограмм)':1 / 10,
        }

metadict_detail['Чай чёрный с лимоном (100 грамм)'] = {
        'Чай чёрный с лимоном (килограмм)':1 / 10,
        }

metadict_detail['Чай чёрный с сахаром и лимоном (100 грамм)'] = {
        'Чай чёрный с сахаром и лимоном (килограмм)':1 / 10,
        }

metadict_detail['Чай чёрный с сахаром (100 грамм)'] = {
        'Чай чёрный с сахаром (килограмм)':1 / 10,
        }

metadict_detail['Чай чёрный с мёдом (100 грамм)'] = {
        'Чай чёрный с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Чай чёрный с кленовым сиропом (100 грамм)'] = {
        'Чай чёрный с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Кофе (100 грамм)'] = {
        'Кофе (килограмм)':1 / 10,
        }

metadict_detail['Заварка чёрного чая (100 грамм)'] = {
        'Заварка чёрного чая (килограмм)':1 / 10,
        }

metadict_detail['Заварка травяного чая (100 грамм)'] = {
        'Заварка травяного чая (килограмм)':1 / 10,
        }

metadict_detail['Кисель яблочный (100 грамм)'] = {
        'Кисель яблочный (килограмм)':1 / 10,
        }

metadict_detail['Кисель из ревеня (100 грамм)'] = {
        'Кисель из ревеня (килограмм)':1 / 10,
        }

metadict_detail['Варенье одуванчиковое (100 грамм)'] = {
        'Варенье одуванчиковое (килограмм)':1 / 10,
        }

metadict_detail['Варенье земляничное (100 грамм)'] = {
        'Варенье земляничное (килограмм)':1 / 10,
        }

metadict_detail['Варенье смородиновое (100 грамм)'] = {
        'Варенье смородиновое (килограмм)':1 / 10,
        }

metadict_detail['Варенье рябиновое (100 грамм)'] = {
        'Варенье рябиновое (килограмм)':1 / 10,
        }

metadict_detail['Варенье вишнёвое (100 грамм)'] = {
        'Варенье вишнёвое (килограмм)':1 / 10,
        }

metadict_detail['Варенье клюквенное (100 грамм)'] = {
        'Варенье клюквенное (килограмм)':1 / 10,
        }

metadict_detail['Компот из сухофруктов (100 грамм)'] = {
        'Компот из сухофруктов (килограмм)':1 / 10,
        }

metadict_detail['Компот гранатово-яблочный с имбирем (100 грамм)'] = {
        'Компот гранатово-яблочный с имбирем (килограмм)':1 / 10,
        }

metadict_detail['Компот из свежего ревеня (100 грамм)'] = {
        'Компот из свежего ревеня (килограмм)':1 / 10,
        }

metadict_detail['Компот из свежей вишни (100 грамм)'] = {
        'Компот из свежей вишни (килограмм)':1 / 10,
        }

metadict_detail['Компот из свежих персиков (100 грамм)'] = {
        'Компот из свежих персиков (килограмм)':1 / 10,
        }

metadict_detail['Компот из сушёной черники (100 грамм)'] = {
        'Компот из сушёной черники (килограмм)':1 / 10,
        }

metadict_detail['Компот из сушёной смородины (100 грамм)'] = {
        'Компот из сушёной смородины (килограмм)':1 / 10,
        }

metadict_detail['Яблоко варёное (100 грамм)'] = {
        'Яблоко варёное (килограмм)':1 / 10,
        }

metadict_detail['Слива варёная (100 грамм)'] = {
        'Слива варёная (килограмм)':1 / 10,
        }

metadict_detail['Яблоко печёное (100 грамм)'] = {
        'Яблоко печёное (килограмм)':1 / 10,
        }

metadict_detail['Яблоко печёное с мёдом (100 грамм)'] = {
        'Яблоко печёное с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Яблоко печёное с орехами пекана (100 грамм)'] = {
        'Яблоко печёное с орехами пекана (килограмм)':1 / 10,
        }

metadict_detail['Репа печёная (100 грамм)'] = {
        'Репа печёная (килограмм)':1 / 10,
        }

metadict_detail['Репа фаршированная горохом (100 грамм)'] = {
        'Репа фаршированная горохом (килограмм)':1 / 10,
        }

metadict_detail['Салат из печёной репы с черникой (100 грамм)'] = {
        'Салат из печёной репы с черникой (килограмм)':1 / 10,
        }

metadict_detail['Редис шинкованный (100 грамм)'] = {
        'Редис шинкованный (килограмм)':1 / 10,
        }

metadict_detail['Редис печёный (100 грамм)'] = {
        'Редис печёный (килограмм)':1 / 10,
        }

metadict_detail['Брюква печёная (100 грамм)'] = {
        'Брюква печёная (килограмм)':1 / 10,
        }

metadict_detail['Салат томатный со стручковой фасолью (100 грамм)'] = {
        'Салат томатный со стручковой фасолью (килограмм)':1 / 10,
        }

metadict_detail['Салат огуречный с лимонно-соевым соусом (100 грамм)'] = {
        'Салат огуречный с лимонно-соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Салат огуречно-томатный со сладким перцем (100 грамм)'] = {
        'Салат огуречно-томатный со сладким перцем (килограмм)':1 / 10,
        }

metadict_detail['Салат из печёной брюквы с кедровыми орешками (100 грамм)'] = {
        'Салат из печёной брюквы с кедровыми орешками (килограмм)':1 / 10,
        }

metadict_detail['Свёкла печёная (100 грамм)'] = {
        'Свёкла печёная (килограмм)':1 / 10,
        }

metadict_detail['Запеканка свекольная с сухофруктами (100 грамм)'] = {
        'Запеканка свекольная с сухофруктами (килограмм)':1 / 10,
        }

metadict_detail['Запеканка свекольная с фруктами (100 грамм)'] = {
        'Запеканка свекольная с фруктами (килограмм)':1 / 10,
        }

metadict_detail['Салат из печёной свёклы с черникой (100 грамм)'] = {
        'Салат из печёной свёклы с черникой (килограмм)':1 / 10,
        }

metadict_detail['Салат из печёной свёклы со спаржей и редисом (100 грамм)'] = {
        'Салат из печёной свёклы со спаржей и редисом (килограмм)':1 / 10,
        }

metadict_detail['Овощи запечённые в кабачковом соусе (100 грамм)'] = {
        'Овощи запечённые в кабачковом соусе (килограмм)':1 / 10,
        }

metadict_detail['Рагу овощное с горошком (100 грамм)'] = {
        'Рагу овощное с горошком (килограмм)':1 / 10,
        }

metadict_detail['Лечо со сладким перцем (100 грамм)'] = {
        'Лечо со сладким перцем (килограмм)':1 / 10,
        }

metadict_detail['Лечо со сладким перцем консервированное (100 грамм)'] = {
        'Лечо со сладким перцем консервированное (килограмм)':1 / 10,
        }

metadict_detail['Щавель бланшированный (100 грамм)'] = {
        'Щавель бланшированный (килограмм)':1 / 10,
        }

metadict_detail['Крапива бланшированная (100 грамм)'] = {
        'Крапива бланшированная (килограмм)':1 / 10,
        }

metadict_detail['Черемша бланшированная (100 грамм)'] = {
        'Черемша бланшированная (килограмм)':1 / 10,
        }

metadict_detail['Лебеда бланшированная (100 грамм)'] = {
        'Лебеда бланшированная (килограмм)':1 / 10,
        }

metadict_detail['Сныть бланшированная (100 грамм)'] = {
        'Сныть бланшированная (килограмм)':1 / 10,
        }

metadict_detail['Шпинат бланшированный (100 грамм)'] = {
        'Шпинат бланшированный (килограмм)':1 / 10,
        }

metadict_detail['Шпинат шинкованный (100 грамм)'] = {
        'Шпинат шинкованный (килограмм)':1 / 10,
        }

metadict_detail['Шпинат обжаренный с чесноком (100 грамм)'] = {
        'Шпинат обжаренный с чесноком (килограмм)':1 / 10,
        }

metadict_detail['Перец фаршированный овощами (100 грамм)'] = {
        'Перец фаршированный овощами (килограмм)':1 / 10,
        }

metadict_detail['Перец сладкий печёный (100 грамм)'] = {
        'Перец сладкий печёный (килограмм)':1 / 10,
        }

metadict_detail['Перец сладкий шинкованный (100 грамм)'] = {
        'Перец сладкий шинкованный (килограмм)':1 / 10,
        }

metadict_detail['Перец сладкий обжаренный (100 грамм)'] = {
        'Перец сладкий обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Баклажан печёный (100 грамм)'] = {
        'Баклажан печёный (килограмм)':1 / 10,
        }

metadict_detail['Баклажан тушёный со стручковой фасолью (100 грамм)'] = {
        'Баклажан тушёный со стручковой фасолью (килограмм)':1 / 10,
        }

metadict_detail['Баклажан тушёный с томатами (100 грамм)'] = {
        'Баклажан тушёный с томатами (килограмм)':1 / 10,
        }

metadict_detail['Баклажан обжаренный (100 грамм)'] = {
        'Баклажан обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Овощи обжаренные в соевом соусе (100 грамм)'] = {
        'Овощи обжаренные в соевом соусе (килограмм)':1 / 10,
        }

metadict_detail['Баклажан жареный с томатами (100 грамм)'] = {
        'Баклажан жареный с томатами (килограмм)':1 / 10,
        }

metadict_detail['Кабачок печёный (100 грамм)'] = {
        'Кабачок печёный (килограмм)':1 / 10,
        }

metadict_detail['Кабачок обжаренный (100 грамм)'] = {
        'Кабачок обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Голубцы фаршированные овощами (100 грамм)'] = {
        'Голубцы фаршированные овощами (килограмм)':1 / 10,
        }

metadict_detail['Голубцы с гречкой и луком (100 грамм)'] = {
        'Голубцы с гречкой и луком (килограмм)':1 / 10,
        }

metadict_detail['Фарш овощной тушёный (100 грамм)'] = {
        'Фарш овощной тушёный (килограмм)':1 / 10,
        }

metadict_detail['Фарш пряный картофельный обжаренный (100 грамм)'] = {
        'Фарш пряный картофельный обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Фарш пряный овощной обжаренный (100 грамм)'] = {
        'Фарш пряный овощной обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Начинка с протёртым маком (100 грамм)'] = {
        'Начинка с протёртым маком (килограмм)':1 / 10,
        }

metadict_detail['Начинка из баранины с луком и пряностями (100 грамм)'] = {
        'Начинка из баранины с луком и пряностями (килограмм)':1 / 10,
        }

metadict_detail['Начинка для лепёшек на овечьем сыре (100 грамм)'] = {
        'Начинка для лепёшек на овечьем сыре (килограмм)':1 / 10,
        }

metadict_detail['Начинка для лепёшек на твороге (100 грамм)'] = {
        'Начинка для лепёшек на твороге (килограмм)':1 / 10,
        }

metadict_detail['Начинка на твороге с зеленью и яйцом (100 грамм)'] = {
        'Начинка на твороге с зеленью и яйцом (килограмм)':1 / 10,
        }

metadict_detail['Начинка капустная с грецкими орехами (100 грамм)'] = {
        'Начинка капустная с грецкими орехами (килограмм)':1 / 10,
        }

metadict_detail['Начинка из овечьего сыра с черемшой (100 грамм)'] = {
        'Начинка из овечьего сыра с черемшой (килограмм)':1 / 10,
        }

metadict_detail['Зелёный горошек протёртый тушёный в сливках (100 грамм)'] = {
        'Зелёный горошек протёртый тушёный в сливках (килограмм)':1 / 10,
        }

metadict_detail['Тыква варёная (100 грамм)'] = {
        'Тыква варёная (килограмм)':1 / 10,
        }

metadict_detail['Тыква печёная (100 грамм)'] = {
        'Тыква печёная (килограмм)':1 / 10,
        }

metadict_detail['Тыква фаршированная картофелем с пряностями (100 грамм)'] = {
        'Тыква фаршированная картофелем с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Тыква фаршированная лечо и чечевицей (100 грамм)'] = {
        'Тыква фаршированная лечо и чечевицей (килограмм)':1 / 10,
        }

metadict_detail['Тыква фаршированная гречкой и грибами (100 грамм)'] = {
        'Тыква фаршированная гречкой и грибами (килограмм)':1 / 10,
        }

metadict_detail['Тыква фаршированная пшённой кашей (100 грамм)'] = {
        'Тыква фаршированная пшённой кашей (килограмм)':1 / 10,
        }

metadict_detail['Тыква тушёная (100 грамм)'] = {
        'Тыква тушёная (килограмм)':1 / 10,
        }

metadict_detail['Спаржа бланшированная (100 грамм)'] = {
        'Спаржа бланшированная (килограмм)':1 / 10,
        }

metadict_detail['Брокколи бланшированная (100 грамм)'] = {
        'Брокколи бланшированная (килограмм)':1 / 10,
        }

metadict_detail['Брокколи обжаренная (100 грамм)'] = {
        'Брокколи обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Артишоки обжаренные (100 грамм)'] = {
        'Артишоки обжаренные (килограмм)':1 / 10,
        }

metadict_detail['Артишоки бланшированные (100 грамм)'] = {
        'Артишоки бланшированные (килограмм)':1 / 10,
        }

metadict_detail['Артишоки тушёные с сельдереем (100 грамм)'] = {
        'Артишоки тушёные с сельдереем (килограмм)':1 / 10,
        }

metadict_detail['Зелень бланшированная для щей (100 грамм)'] = {
        'Зелень бланшированная для щей (килограмм)':1 / 10,
        }

metadict_detail['Зелень одуванчика бланшированная (100 грамм)'] = {
        'Зелень одуванчика бланшированная (килограмм)':1 / 10,
        }

metadict_detail['Одуванчики жареные во фритюре (100 грамм)'] = {
        'Одуванчики жареные во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Одуванчик сушёный (100 грамм)'] = {
        'Одуванчик сушёный (килограмм)':1 / 10,
        }

metadict_detail['Лист вишни сушёный (100 грамм)'] = {
        'Лист вишни сушёный (килограмм)':1 / 10,
        }

metadict_detail['Лист смородины сушёный (100 грамм)'] = {
        'Лист смородины сушёный (килограмм)':1 / 10,
        }

metadict_detail['Лист малины сушёный (100 грамм)'] = {
        'Лист малины сушёный (килограмм)':1 / 10,
        }

metadict_detail['Лист рябины сушёный (100 грамм)'] = {
        'Лист рябины сушёный (килограмм)':1 / 10,
        }

metadict_detail['Лист шиповника сушёный (100 грамм)'] = {
        'Лист шиповника сушёный (килограмм)':1 / 10,
        }

metadict_detail['Зелень укропа сушёная (100 грамм)'] = {
        'Зелень укропа сушёная (килограмм)':1 / 10,
        }

metadict_detail['Банан сушёный (100 грамм)'] = {
        'Банан сушёный (килограмм)':1 / 10,
        }

metadict_detail['Банан печёный (100 грамм)'] = {
        'Банан печёный (килограмм)':1 / 10,
        }

metadict_detail['Банан жареный кусками во фритюре (100 грамм)'] = {
        'Банан жареный кусками во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Банан жареный в карамели (100 грамм)'] = {
        'Банан жареный в карамели (килограмм)':1 / 10,
        }

metadict_detail['Каштан печёный (100 грамм)'] = {
        'Каштан печёный (килограмм)':1 / 10,
        }

metadict_detail['Батат варёный (100 грамм)'] = {
        'Батат варёный (килограмм)':1 / 10,
        }

metadict_detail['Батат печёный (100 грамм)'] = {
        'Батат печёный (килограмм)':1 / 10,
        }

metadict_detail['Батат обжаренный (100 грамм)'] = {
        'Батат обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Батат печёный в медовой глазури (100 грамм)'] = {
        'Батат печёный в медовой глазури (килограмм)':1 / 10,
        }

metadict_detail['Батат печёный со шпинатом и соевым соусом (100 грамм)'] = {
        'Батат печёный со шпинатом и соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Батат печёный дольками (100 грамм)'] = {
        'Батат печёный дольками (килограмм)':1 / 10,
        }

metadict_detail['Томаты припущенные (100 грамм)'] = {
        'Томаты припущенные (килограмм)':1 / 10,
        }

metadict_detail['Томаты печёные для террина (100 грамм)'] = {
        'Томаты печёные для террина (килограмм)':1 / 10,
        }

metadict_detail['Томаты шинкованные (100 грамм)'] = {
        'Томаты шинкованные (килограмм)':1 / 10,
        }

metadict_detail['Паста томатная (100 грамм)'] = {
        'Паста томатная (килограмм)':1 / 10,
        }

metadict_detail['Пюре томатное (100 грамм)'] = {
        'Пюре томатное (килограмм)':1 / 10,
        }

metadict_detail['Ботва морковная бланшированная (100 грамм)'] = {
        'Ботва морковная бланшированная (килограмм)':1 / 10,
        }

metadict_detail['Ботва свекольная бланшированная (100 грамм)'] = {
        'Ботва свекольная бланшированная (килограмм)':1 / 10,
        }

metadict_detail['Ревень бланшированный (100 грамм)'] = {
        'Ревень бланшированный (килограмм)':1 / 10,
        }

metadict_detail['Топинамбур печёный (100 грамм)'] = {
        'Топинамбур печёный (килограмм)':1 / 10,
        }

metadict_detail['Топинамбур печёный дольками (100 грамм)'] = {
        'Топинамбур печёный дольками (килограмм)':1 / 10,
        }

metadict_detail['Топинамбур тушёный с фасолью (100 грамм)'] = {
        'Топинамбур тушёный с фасолью (килограмм)':1 / 10,
        }

metadict_detail['Топинамбур тушёный с боровиками (100 грамм)'] = {
        'Топинамбур тушёный с боровиками (килограмм)':1 / 10,
        }

metadict_detail['Топинамбур печёный с чесноком (100 грамм)'] = {
        'Топинамбур печёный с чесноком (килограмм)':1 / 10,
        }

metadict_detail['Топинамбур печёный со спаржей (100 грамм)'] = {
        'Топинамбур печёный со спаржей (килограмм)':1 / 10,
        }

metadict_detail['Пастернак печёный дольками (100 грамм)'] = {
        'Пастернак печёный дольками (килограмм)':1 / 10,
        }

metadict_detail['Пастернак запечённый с томатами (100 грамм)'] = {
        'Пастернак запечённый с томатами (килограмм)':1 / 10,
        }

metadict_detail['Корень пастернака обжаренный (100 грамм)'] = {
        'Корень пастернака обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Пастернак варёный (100 грамм)'] = {
        'Пастернак варёный (килограмм)':1 / 10,
        }

metadict_detail['Пастернак бланшированный (100 грамм)'] = {
        'Пастернак бланшированный (килограмм)':1 / 10,
        }

metadict_detail['Турнепс варёный (100 грамм)'] = {
        'Турнепс варёный (килограмм)':1 / 10,
        }

metadict_detail['Турнепс тушёный с капустой (100 грамм)'] = {
        'Турнепс тушёный с капустой (килограмм)':1 / 10,
        }

metadict_detail['Кукуруза варёная (100 грамм)'] = {
        'Кукуруза варёная (килограмм)':1 / 10,
        }

metadict_detail['Кукуруза печёная с соевым соусом (100 грамм)'] = {
        'Кукуруза печёная с соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный с морковью (100 грамм)'] = {
        'Картофель тушёный с морковью (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный с боровиками (100 грамм)'] = {
        'Картофель тушёный с боровиками (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный в соевом соусе (100 грамм)'] = {
        'Картофель тушёный в соевом соусе (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный с горошком и пряностями (100 грамм)'] = {
        'Картофель тушёный с горошком и пряностями (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный с оливками и лимоном (100 грамм)'] = {
        'Картофель тушёный с оливками и лимоном (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный с яблоками (100 грамм)'] = {
        'Картофель тушёный с яблоками (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный со спаржей (100 грамм)'] = {
        'Картофель тушёный со спаржей (килограмм)':1 / 10,
        }

metadict_detail['Картофель варёный (100 грамм)'] = {
        'Картофель варёный (килограмм)':1 / 10,
        }

metadict_detail['Картофель бланшированный (100 грамм)'] = {
        'Картофель бланшированный (килограмм)':1 / 10,
        }

metadict_detail['Картофель печёный (100 грамм)'] = {
        'Картофель печёный (килограмм)':1 / 10,
        }

metadict_detail['Картофель печёный с розмарином (100 грамм)'] = {
        'Картофель печёный с розмарином (килограмм)':1 / 10,
        }

metadict_detail['Картофель жареный кусками во фритюре (100 грамм)'] = {
        'Картофель жареный кусками во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Картофель жареный в томатном соусе (100 грамм)'] = {
        'Картофель жареный в томатном соусе (килограмм)':1 / 10,
        }

metadict_detail['Картофель жареный брусками во фритюре (100 грамм)'] = {
        'Картофель жареный брусками во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Картофель печёный дольками (100 грамм)'] = {
        'Картофель печёный дольками (килограмм)':1 / 10,
        }

metadict_detail['Запеканка бататная с курагой (100 грамм)'] = {
        'Запеканка бататная с курагой (килограмм)':1 / 10,
        }

metadict_detail['Запеканка картофельная с луком и капустой (100 грамм)'] = {
        'Запеканка картофельная с луком и капустой (килограмм)':1 / 10,
        }

metadict_detail['Запеканка картофельная с боровиками (100 грамм)'] = {
        'Запеканка картофельная с боровиками (килограмм)':1 / 10,
        }

metadict_detail['Запеканка картофельная со свёклой (100 грамм)'] = {
        'Запеканка картофельная со свёклой (килограмм)':1 / 10,
        }

metadict_detail['Шарики картофельные жареные во фритюре (100 грамм)'] = {
        'Шарики картофельные жареные во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Шарики овощные жареные во фритюре (100 грамм)'] = {
        'Шарики овощные жареные во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Шарики нутовые жареные во фритюре (100 грамм)'] = {
        'Шарики нутовые жареные во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Шарики фасолевые жареные во фритюре (100 грамм)'] = {
        'Шарики фасолевые жареные во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Шарики чечевичные жареные во фритюре (100 грамм)'] = {
        'Шарики чечевичные жареные во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки ржаные с жареным луком (100 грамм)'] = {
        'Лепёшки ржаные с жареным луком (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки рисовые паровые (100 грамм)'] = {
        'Лепёшки рисовые паровые (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки рисово-просяные паровые (100 грамм)'] = {
        'Лепёшки рисово-просяные паровые (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки рисово-ячменные паровые (100 грамм)'] = {
        'Лепёшки рисово-ячменные паровые (килограмм)':1 / 10,
        }

metadict_detail['Свёкла варёная (100 грамм)'] = {
        'Свёкла варёная (килограмм)':1 / 10,
        }

metadict_detail['Морковь маринованная (100 грамм)'] = {
        'Морковь маринованная (килограмм)':1 / 10,
        }

metadict_detail['Морковь варёная (100 грамм)'] = {
        'Морковь варёная (килограмм)':1 / 10,
        }

metadict_detail['Морковь шинкованная печёная (100 грамм)'] = {
        'Морковь шинкованная печёная (килограмм)':1 / 10,
        }

metadict_detail['Морковь печёная с розмарином (100 грамм)'] = {
        'Морковь печёная с розмарином (килограмм)':1 / 10,
        }

metadict_detail['Морковь тушёная с турнепсом и картофелем (100 грамм)'] = {
        'Морковь тушёная с турнепсом и картофелем (килограмм)':1 / 10,
        }

metadict_detail['Морковь шинкованная обжаренная (100 грамм)'] = {
        'Морковь шинкованная обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Морковь печёная в медовой глазури (100 грамм)'] = {
        'Морковь печёная в медовой глазури (килограмм)':1 / 10,
        }

metadict_detail['Репа варёная (100 грамм)'] = {
        'Репа варёная (килограмм)':1 / 10,
        }

metadict_detail['Репа пареная (100 грамм)'] = {
        'Репа пареная (килограмм)':1 / 10,
        }

metadict_detail['Лук шинкованный обжаренный (100 грамм)'] = {
        'Лук шинкованный обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Лук шинкованный печёный (100 грамм)'] = {
        'Лук шинкованный печёный (килограмм)':1 / 10,
        }

metadict_detail['Капуста шинкованная (100 грамм)'] = {
        'Капуста шинкованная (килограмм)':1 / 10,
        }

metadict_detail['Рассольник с грибами (100 грамм)'] = {
        'Рассольник с грибами (килограмм)':1 / 10,
        }

metadict_detail['Борщ с фасолью и томатами (100 грамм)'] = {
        'Борщ с фасолью и томатами (килограмм)':1 / 10,
        }

metadict_detail['Щи зелёные с гречкой (100 грамм)'] = {
        'Щи зелёные с гречкой (килограмм)':1 / 10,
        }

metadict_detail['Щи из квашеной капусты (100 грамм)'] = {
        'Щи из квашеной капусты (килограмм)':1 / 10,
        }

metadict_detail['Щи из квашеной капусты с грибами (100 грамм)'] = {
        'Щи из квашеной капусты с грибами (килограмм)':1 / 10,
        }

metadict_detail['Щи томатно-луковые с грибами (100 грамм)'] = {
        'Щи томатно-луковые с грибами (килограмм)':1 / 10,
        }

metadict_detail['Щи из квашеной репы (100 грамм)'] = {
        'Щи из квашеной репы (килограмм)':1 / 10,
        }

metadict_detail['Аквафаба чечевичная (100 грамм)'] = {
        'Аквафаба чечевичная (килограмм)':1 / 10,
        }

metadict_detail['Аквафаба фасолевая (100 грамм)'] = {
        'Аквафаба фасолевая (килограмм)':1 / 10,
        }

metadict_detail['Бульон чечевичный (100 грамм)'] = {
        'Бульон чечевичный (килограмм)':1 / 10,
        }

metadict_detail['Бульон фасолевый (100 грамм)'] = {
        'Бульон фасолевый (килограмм)':1 / 10,
        }

metadict_detail['Бульон нутовый (100 грамм)'] = {
        'Бульон нутовый (килограмм)':1 / 10,
        }

metadict_detail['Бульон костный бараний (100 грамм)'] = {
        'Бульон костный бараний (килограмм)':1 / 10,
        }

metadict_detail['Бульон костный говяжий (100 грамм)'] = {
        'Бульон костный говяжий (килограмм)':1 / 10,
        }

metadict_detail['Бульон овощной сезонный (100 грамм)'] = {
        'Бульон овощной сезонный (килограмм)':1 / 10,
        }

metadict_detail['Бульон овощной из корнеплодов (100 грамм)'] = {
        'Бульон овощной из корнеплодов (килограмм)':1 / 10,
        }

metadict_detail['Бульон грибной (100 грамм)'] = {
        'Бульон грибной (килограмм)':1 / 10,
        }

metadict_detail['Пюре из обжаренной фасоли (100 грамм)'] = {
        'Пюре из обжаренной фасоли (килограмм)':1 / 10,
        }

metadict_detail['Пюре картофельное (100 грамм)'] = {
        'Пюре картофельное (килограмм)':1 / 10,
        }

metadict_detail['Пюре картофельно-редисовое (100 грамм)'] = {
        'Пюре картофельно-редисовое (килограмм)':1 / 10,
        }

metadict_detail['Пюре брюквенное (100 грамм)'] = {
        'Пюре брюквенное (килограмм)':1 / 10,
        }

metadict_detail['Пюре брюквенно-морковное (100 грамм)'] = {
        'Пюре брюквенно-морковное (килограмм)':1 / 10,
        }

metadict_detail['Пюре морковное (100 грамм)'] = {
        'Пюре морковное (килограмм)':1 / 10,
        }

metadict_detail['Пюре бататное (100 грамм)'] = {
        'Пюре бататное (килограмм)':1 / 10,
        }

metadict_detail['Пюре тыквенное (100 грамм)'] = {
        'Пюре тыквенное (килограмм)':1 / 10,
        }

metadict_detail['Пюре тыквенное для пирога (100 грамм)'] = {
        'Пюре тыквенное для пирога (килограмм)':1 / 10,
        }

metadict_detail['Пюре яблочное (100 грамм)'] = {
        'Пюре яблочное (килограмм)':1 / 10,
        }

metadict_detail['Пюре яблочное уваренное с мёдом (100 грамм)'] = {
        'Пюре яблочное уваренное с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Суфле яблочно-медовое (100 грамм)'] = {
        'Суфле яблочно-медовое (килограмм)':1 / 10,
        }

metadict_detail['Пюре сливовое (100 грамм)'] = {
        'Пюре сливовое (килограмм)':1 / 10,
        }

metadict_detail['Пюре сливовое уваренное с мёдом (100 грамм)'] = {
        'Пюре сливовое уваренное с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Суфле сливово-медовое (100 грамм)'] = {
        'Суфле сливово-медовое (килограмм)':1 / 10,
        }

metadict_detail['Пастила яблочная (100 грамм)'] = {
        'Пастила яблочная (килограмм)':1 / 10,
        }

metadict_detail['Пастила сливовая (100 грамм)'] = {
        'Пастила сливовая (килограмм)':1 / 10,
        }

metadict_detail['Террин овощной (100 грамм)'] = {
        'Террин овощной (килограмм)':1 / 10,
        }

metadict_detail['Суп из сезонных овощей с фасолью (100 грамм)'] = {
        'Суп из сезонных овощей с фасолью (килограмм)':1 / 10,
        }

metadict_detail['Суп-лапша с бататом и солёными томатами (100 грамм)'] = {
        'Суп-лапша с бататом и солёными томатами (килограмм)':1 / 10,
        }

metadict_detail['Суп-лапша с кабачком и свежими томатами (100 грамм)'] = {
        'Суп-лапша с кабачком и свежими томатами (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре арахисовый с бататом и томатами (100 грамм)'] = {
        'Суп-пюре арахисовый с бататом и томатами (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре чечевичный с пряной зеленью (100 грамм)'] = {
        'Суп-пюре чечевичный с пряной зеленью (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре пряный чечевичный с тыквой (100 грамм)'] = {
        'Суп-пюре пряный чечевичный с тыквой (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре пряный чечевичный со шпинатом (100 грамм)'] = {
        'Суп-пюре пряный чечевичный со шпинатом (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре пряный шпинатный с темпе (100 грамм)'] = {
        'Суп-пюре пряный шпинатный с темпе (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре пряный фасолевый (100 грамм)'] = {
        'Суп-пюре пряный фасолевый (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре пряный гороховый (100 грамм)'] = {
        'Суп-пюре пряный гороховый (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре пряный нутово-томатный (100 грамм)'] = {
        'Суп-пюре пряный нутово-томатный (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре пряный нутовый с луком-пореем (100 грамм)'] = {
        'Суп-пюре пряный нутовый с луком-пореем (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре перловый (100 грамм)'] = {
        'Суп-пюре перловый (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре перловый с кремом (100 грамм)'] = {
        'Суп-пюре перловый с кремом (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из картофеля и лука-порея (100 грамм)'] = {
        'Суп-пюре из картофеля и лука-порея (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из картофеля и лука-порея с гренками (100 грамм)'] = {
        'Суп-пюре из картофеля и лука-порея с гренками (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из картофеля и лука-порея с шампиньонами (100 грамм)'] = {
        'Суп-пюре из картофеля и лука-порея с шампиньонами (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре томатный (100 грамм)'] = {
        'Суп-пюре томатный (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре томатный с гренками (100 грамм)'] = {
        'Суп-пюре томатный с гренками (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре пряный бататный (100 грамм)'] = {
        'Суп-пюре пряный бататный (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из корня сельдерея (100 грамм)'] = {
        'Суп-пюре из корня сельдерея (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из корня сельдерея с гренками (100 грамм)'] = {
        'Суп-пюре из корня сельдерея с гренками (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из моркови (100 грамм)'] = {
        'Суп-пюре из моркови (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре пряный морковный (100 грамм)'] = {
        'Суп-пюре пряный морковный (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из моркови с кремом (100 грамм)'] = {
        'Суп-пюре из моркови с кремом (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из свёклы (100 грамм)'] = {
        'Суп-пюре из свёклы (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из свёклы с кремом (100 грамм)'] = {
        'Суп-пюре из свёклы с кремом (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из спаржи (100 грамм)'] = {
        'Суп-пюре из спаржи (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из спаржи с кремом (100 грамм)'] = {
        'Суп-пюре из спаржи с кремом (килограмм)':1 / 10,
        }

metadict_detail['Окрошка с варёными грибами (100 грамм)'] = {
        'Окрошка с варёными грибами (килограмм)':1 / 10,
        }

metadict_detail['Окрошка с солёными грибами (100 грамм)'] = {
        'Окрошка с солёными грибами (килограмм)':1 / 10,
        }

metadict_detail['Тюря с луком (100 грамм)'] = {
        'Тюря с луком (килограмм)':1 / 10,
        }

metadict_detail['Тюря с одуванчиком (100 грамм)'] = {
        'Тюря с одуванчиком (килограмм)':1 / 10,
        }

metadict_detail['Тюря с редькой (100 грамм)'] = {
        'Тюря с редькой (килограмм)':1 / 10,
        }

metadict_detail['Тюря томатная с сельдереем (100 грамм)'] = {
        'Тюря томатная с сельдереем (килограмм)':1 / 10,
        }

metadict_detail['Суп чечевичный (100 грамм)'] = {
        'Суп чечевичный (килограмм)':1 / 10,
        }

metadict_detail['Похлёбка гороховая (100 грамм)'] = {
        'Похлёбка гороховая (килограмм)':1 / 10,
        }

metadict_detail['Фасоль тушёная с корнеплодами (100 грамм)'] = {
        'Фасоль тушёная с корнеплодами (килограмм)':1 / 10,
        }

metadict_detail['Фасоль тушёная со свежей кукурузой (100 грамм)'] = {
        'Фасоль тушёная со свежей кукурузой (килограмм)':1 / 10,
        }

metadict_detail['Суп томатный с фасолью (100 грамм)'] = {
        'Суп томатный с фасолью (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре холодный томатно-огуречный (100 грамм)'] = {
        'Суп-пюре холодный томатно-огуречный (килограмм)':1 / 10,
        }

metadict_detail['Похлёбка картофельная со свежей зеленью (100 грамм)'] = {
        'Похлёбка картофельная со свежей зеленью (килограмм)':1 / 10,
        }

metadict_detail['Суп-лапша с морской капустой (100 грамм)'] = {
        'Суп-лапша с морской капустой (килограмм)':1 / 10,
        }

metadict_detail['Похлёбка репяная (100 грамм)'] = {
        'Похлёбка репяная (килограмм)':1 / 10,
        }

metadict_detail['Похлёбка луковая (100 грамм)'] = {
        'Похлёбка луковая (килограмм)':1 / 10,
        }

metadict_detail['Лапша варёная (100 грамм)'] = {
        'Лапша варёная (килограмм)':1 / 10,
        }

metadict_detail['Лапша с лютеницей (100 грамм)'] = {
        'Лапша с лютеницей (килограмм)':1 / 10,
        }

metadict_detail['Лапша с баклажанным соусом (100 грамм)'] = {
        'Лапша с баклажанным соусом (килограмм)':1 / 10,
        }

metadict_detail['Лапша с соусом песто (100 грамм)'] = {
        'Лапша с соусом песто (килограмм)':1 / 10,
        }

metadict_detail['Лапша с кабачковым соусом (100 грамм)'] = {
        'Лапша с кабачковым соусом (килограмм)':1 / 10,
        }

metadict_detail['Лапша с песто и шампиньонами (100 грамм)'] = {
        'Лапша с песто и шампиньонами (килограмм)':1 / 10,
        }

metadict_detail['Лапша с песто и сморчками (100 грамм)'] = {
        'Лапша с песто и сморчками (килограмм)':1 / 10,
        }

metadict_detail['Лапша с белыми грибами (100 грамм)'] = {
        'Лапша с белыми грибами (килограмм)':1 / 10,
        }

metadict_detail['Лапша сушёная (100 грамм)'] = {
        'Лапша сушёная (килограмм)':1 / 10,
        }

metadict_detail['Каша пшённая на молоке (100 грамм)'] = {
        'Каша пшённая на молоке (килограмм)':1 / 10,
        }

metadict_detail['Каша рисовая (100 грамм)'] = {
        'Каша рисовая (килограмм)':1 / 10,
        }

metadict_detail['Каша рисовая с телятиной и овощами (100 грамм)'] = {
        'Каша рисовая с телятиной и овощами (килограмм)':1 / 10,
        }

metadict_detail['Каша пшённая с чечевицей (100 грамм)'] = {
        'Каша пшённая с чечевицей (килограмм)':1 / 10,
        }

metadict_detail['Каша пшённая с чечевицей и спаржей (100 грамм)'] = {
        'Каша пшённая с чечевицей и спаржей (килограмм)':1 / 10,
        }

metadict_detail['Каша пшённая с чечевицей и горошком (100 грамм)'] = {
        'Каша пшённая с чечевицей и горошком (килограмм)':1 / 10,
        }

metadict_detail['Каша пшённая с чечевицей и овощами (100 грамм)'] = {
        'Каша пшённая с чечевицей и овощами (килограмм)':1 / 10,
        }

metadict_detail['Каша овсяная (100 грамм)'] = {
        'Каша овсяная (килограмм)':1 / 10,
        }

metadict_detail['Каша овсяная с мёдом (100 грамм)'] = {
        'Каша овсяная с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Каша овсяная с кленовым сиропом (100 грамм)'] = {
        'Каша овсяная с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Желе миндальное (100 грамм)'] = {
        'Желе миндальное (килограмм)':1 / 10,
        }

metadict_detail['Желе лимонное (100 грамм)'] = {
        'Желе лимонное (килограмм)':1 / 10,
        }

metadict_detail['Желе виноградное (100 грамм)'] = {
        'Желе виноградное (килограмм)':1 / 10,
        }

metadict_detail['Желе яблочное (100 грамм)'] = {
        'Желе яблочное (килограмм)':1 / 10,
        }

metadict_detail['Желе из ревеня (100 грамм)'] = {
        'Желе из ревеня (килограмм)':1 / 10,
        }

metadict_detail['Кисель гороховый (100 грамм)'] = {
        'Кисель гороховый (килограмм)':1 / 10,
        }

metadict_detail['Морс клюквенный (100 грамм)'] = {
        'Морс клюквенный (килограмм)':1 / 10,
        }

metadict_detail['Молоко из орехов карии (100 грамм)'] = {
        'Молоко из орехов карии (килограмм)':1 / 10,
        }

metadict_detail['Молоко из орехов карии с мёдом (100 грамм)'] = {
        'Молоко из орехов карии с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Мусс клюквенный (100 грамм)'] = {
        'Мусс клюквенный (килограмм)':1 / 10,
        }

metadict_detail['Мусс лимонный (100 грамм)'] = {
        'Мусс лимонный (килограмм)':1 / 10,
        }

metadict_detail['Мусс вишнёвый (100 грамм)'] = {
        'Мусс вишнёвый (килограмм)':1 / 10,
        }

metadict_detail['Мусс из орехов карии с мёдом (100 грамм)'] = {
        'Мусс из орехов карии с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Молоко рисовое (100 грамм)'] = {
        'Молоко рисовое (килограмм)':1 / 10,
        }

metadict_detail['Молоко миндальное (100 грамм)'] = {
        'Молоко миндальное (килограмм)':1 / 10,
        }

metadict_detail['Кисель овсяной густой (100 грамм)'] = {
        'Кисель овсяной густой (килограмм)':1 / 10,
        }

metadict_detail['Кисель овсяной жидкий (100 грамм)'] = {
        'Кисель овсяной жидкий (килограмм)':1 / 10,
        }

metadict_detail['Кисель овсяной с мёдом (100 грамм)'] = {
        'Кисель овсяной с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Тесто рисово-чечевичное для кляра (100 грамм)'] = {
        'Тесто рисово-чечевичное для кляра (килограмм)':1 / 10,
        }

metadict_detail['Тесто рисово-урдовое ферментированное (100 грамм)'] = {
        'Тесто рисово-урдовое ферментированное (килограмм)':1 / 10,
        }

metadict_detail['Тесто просо-рисово-урдовое ферментированное (100 грамм)'] = {
        'Тесто просо-рисово-урдовое ферментированное (килограмм)':1 / 10,
        }

metadict_detail['Тесто ячменно-рисово-урдовое ферментированное (100 грамм)'] = {
        'Тесто ячменно-рисово-урдовое ферментированное (килограмм)':1 / 10,
        }

metadict_detail['Тесто пряничное медовое заварное (100 грамм)'] = {
        'Тесто пряничное медовое заварное (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное дрожжевое (100 грамм)'] = {
        'Тесто пшеничное дрожжевое (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-ореховое для блинов (100 грамм)'] = {
        'Тесто пшенично-ореховое для блинов (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное для пончиков (100 грамм)'] = {
        'Тесто пшеничное для пончиков (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-ячменное дрожжевое (100 грамм)'] = {
        'Тесто пшенично-ячменное дрожжевое (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-соевое дрожжевое (100 грамм)'] = {
        'Тесто пшенично-соевое дрожжевое (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-кукурузное дрожжевое (100 грамм)'] = {
        'Тесто пшенично-кукурузное дрожжевое (килограмм)':1 / 10,
        }

metadict_detail['Тесто кукурузное для тортильи (100 грамм)'] = {
        'Тесто кукурузное для тортильи (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-овсяное для пудинга (100 грамм)'] = {
        'Тесто пшенично-овсяное для пудинга (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-миндальное для капкейков (100 грамм)'] = {
        'Тесто пшенично-миндальное для капкейков (килограмм)':1 / 10,
        }

metadict_detail['Тесто кукурузно-пшеничное для капкейков (100 грамм)'] = {
        'Тесто кукурузно-пшеничное для капкейков (килограмм)':1 / 10,
        }

metadict_detail['Тесто кукурузно-пшеничное бездрожжевое (100 грамм)'] = {
        'Тесто кукурузно-пшеничное бездрожжевое (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-гречневое для блинов (100 грамм)'] = {
        'Тесто пшенично-гречневое для блинов (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное дрожжевое для пирогов (100 грамм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное дрожжевое для булок (100 грамм)'] = {
        'Тесто пшеничное дрожжевое для булок (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-овсяное для оладий (100 грамм)'] = {
        'Тесто пшенично-овсяное для оладий (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-овсяное для печенья (100 грамм)'] = {
        'Тесто пшенично-овсяное для печенья (килограмм)':1 / 10,
        }

metadict_detail['Тесто кукурузно-овсяное для оладий (100 грамм)'] = {
        'Тесто кукурузно-овсяное для оладий (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное бездрожжевое для лаваша (100 грамм)'] = {
        'Тесто пшеничное бездрожжевое для лаваша (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное бездрожжевое на сыворотке (100 грамм)'] = {
        'Тесто пшеничное бездрожжевое на сыворотке (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное бездрожжевое с яйцом (100 грамм)'] = {
        'Тесто пшеничное бездрожжевое с яйцом (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное бездрожжевое на кислом молоке (100 грамм)'] = {
        'Тесто пшеничное бездрожжевое на кислом молоке (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное бездрожжевое для хачапури (100 грамм)'] = {
        'Тесто пшеничное бездрожжевое для хачапури (килограмм)':1 / 10,
        }

metadict_detail['Тесто ячменно-пшеничное бездрожжевое на сыворотке (100 грамм)'] = {
        'Тесто ячменно-пшеничное бездрожжевое на сыворотке (килограмм)':1 / 10,
        }

metadict_detail['Тесто ячменное бездрожжевое на сыворотке (100 грамм)'] = {
        'Тесто ячменное бездрожжевое на сыворотке (килограмм)':1 / 10,
        }

metadict_detail['Тесто ячменное бездрожжевое с яйцом (100 грамм)'] = {
        'Тесто ячменное бездрожжевое с яйцом (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное бездрожжевое для пирогов (100 грамм)'] = {
        'Тесто пшеничное бездрожжевое для пирогов (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное бездрожжевое для лапши (100 грамм)'] = {
        'Тесто пшеничное бездрожжевое для лапши (килограмм)':1 / 10,
        }

metadict_detail['Тесто ржаное на закваске (100 грамм)'] = {
        'Тесто ржаное на закваске (килограмм)':1 / 10,
        }

metadict_detail['Тесто ржаное бездрожжевое (100 грамм)'] = {
        'Тесто ржаное бездрожжевое (килограмм)':1 / 10,
        }

metadict_detail['Опара овсяная (100 грамм)'] = {
        'Опара овсяная (килограмм)':1 / 10,
        }

metadict_detail['Опара пшенично-гречневая (100 грамм)'] = {
        'Опара пшенично-гречневая (килограмм)':1 / 10,
        }

metadict_detail['Опара ржаная (100 грамм)'] = {
        'Опара ржаная (килограмм)':1 / 10,
        }

metadict_detail['Заварка ржаная (100 грамм)'] = {
        'Заварка ржаная (килограмм)':1 / 10,
        }

metadict_detail['Заварка пшеничная (100 грамм)'] = {
        'Заварка пшеничная (килограмм)':1 / 10,
        }

metadict_detail['Закваска ржаная (100 грамм)'] = {
        'Закваска ржаная (килограмм)':1 / 10,
        }

metadict_detail['Дрожжи жидкие (100 грамм)'] = {
        'Дрожжи жидкие (килограмм)':1 / 10,
        }

metadict_detail['Опара пшеничная густая (100 грамм)'] = {
        'Опара пшеничная густая (килограмм)':1 / 10,
        }

metadict_detail['Опара пшеничная жидкая (100 грамм)'] = {
        'Опара пшеничная жидкая (килограмм)':1 / 10,
        }

metadict_detail['Каша гречневая (100 грамм)'] = {
        'Каша гречневая (килограмм)':1 / 10,
        }

metadict_detail['Каша гречневая размазня (100 грамм)'] = {
        'Каша гречневая размазня (килограмм)':1 / 10,
        }

metadict_detail['Каша гречневая с грибами (100 грамм)'] = {
        'Каша гречневая с грибами (килограмм)':1 / 10,
        }

metadict_detail['Каша горохово-гречневая (100 грамм)'] = {
        'Каша горохово-гречневая (килограмм)':1 / 10,
        }

metadict_detail['Каша перловая (100 грамм)'] = {
        'Каша перловая (килограмм)':1 / 10,
        }

metadict_detail['Каша перловая на бульоне (100 грамм)'] = {
        'Каша перловая на бульоне (килограмм)':1 / 10,
        }

metadict_detail['Каша перловая на ореховом молоке (100 грамм)'] = {
        'Каша перловая на ореховом молоке (килограмм)':1 / 10,
        }

metadict_detail['Каша ячневая (100 грамм)'] = {
        'Каша ячневая (килограмм)':1 / 10,
        }

metadict_detail['Каша ячневая с изюмом (100 грамм)'] = {
        'Каша ячневая с изюмом (килограмм)':1 / 10,
        }

metadict_detail['Каша ячневая с арахисом (100 грамм)'] = {
        'Каша ячневая с арахисом (килограмм)':1 / 10,
        }

metadict_detail['Каша ячнево-гороховая (100 грамм)'] = {
        'Каша ячнево-гороховая (килограмм)':1 / 10,
        }

metadict_detail['Каша ячневая со сливочным маслом (100 грамм)'] = {
        'Каша ячневая со сливочным маслом (килограмм)':1 / 10,
        }

metadict_detail['Каша ячневая с овощами (100 грамм)'] = {
        'Каша ячневая с овощами (килограмм)':1 / 10,
        }

metadict_detail['Каша ячневая с рыбой и овощами (100 грамм)'] = {
        'Каша ячневая с рыбой и овощами (килограмм)':1 / 10,
        }

metadict_detail['Фасоль тушёная с морковью (100 грамм)'] = {
        'Фасоль тушёная с морковью (килограмм)':1 / 10,
        }

metadict_detail['Фасоль тушёная с луком (100 грамм)'] = {
        'Фасоль тушёная с луком (килограмм)':1 / 10,
        }

metadict_detail['Фасоль томлёная с патокой (100 грамм)'] = {
        'Фасоль томлёная с патокой (килограмм)':1 / 10,
        }

metadict_detail['Фасоль варёная (100 грамм)'] = {
        'Фасоль варёная (килограмм)':1 / 10,
        }

metadict_detail['Фасоль стручковая варёная (100 грамм)'] = {
        'Фасоль стручковая варёная (килограмм)':1 / 10,
        }

metadict_detail['Фасоль стручковая тушёная (100 грамм)'] = {
        'Фасоль стручковая тушёная (килограмм)':1 / 10,
        }

metadict_detail['Каша гороховая (100 грамм)'] = {
        'Каша гороховая (килограмм)':1 / 10,
        }

metadict_detail['Пюре гороховое с пряностями (100 грамм)'] = {
        'Пюре гороховое с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Каша чечевичная (100 грамм)'] = {
        'Каша чечевичная (килограмм)':1 / 10,
        }

metadict_detail['Каша фасолевая (100 грамм)'] = {
        'Каша фасолевая (килограмм)':1 / 10,
        }

metadict_detail['Каша кукурузно-мучная (100 грамм)'] = {
        'Каша кукурузно-мучная (килограмм)':1 / 10,
        }

metadict_detail['Каша кукурузная (100 грамм)'] = {
        'Каша кукурузная (килограмм)':1 / 10,
        }

metadict_detail['Каша кукурузная с фруктами (100 грамм)'] = {
        'Каша кукурузная с фруктами (килограмм)':1 / 10,
        }

metadict_detail['Каша кукурузная с сухофруктами (100 грамм)'] = {
        'Каша кукурузная с сухофруктами (килограмм)':1 / 10,
        }

metadict_detail['Хлеб ржаной домашний (100 грамм)'] = {
        'Хлеб ржаной домашний (килограмм)':1 / 10,
        }

metadict_detail['Хлеб ржаной с семечками и клюквой (100 грамм)'] = {
        'Хлеб ржаной с семечками и клюквой (килограмм)':1 / 10,
        }

metadict_detail['Хлеб ячменный домашний (100 грамм)'] = {
        'Хлеб ячменный домашний (килограмм)':1 / 10,
        }

metadict_detail['Брускетта обжаренная (100 грамм)'] = {
        'Брускетта обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Брускетта со свежими томатами (100 грамм)'] = {
        'Брускетта со свежими томатами (килограмм)':1 / 10,
        }

metadict_detail['Брускетта с баклажанным соусом (100 грамм)'] = {
        'Брускетта с баклажанным соусом (килограмм)':1 / 10,
        }

metadict_detail['Брускетта с солёными томатами (100 грамм)'] = {
        'Брускетта с солёными томатами (килограмм)':1 / 10,
        }

metadict_detail['Брускетта с печёным перцем и песто (100 грамм)'] = {
        'Брускетта с печёным перцем и песто (килограмм)':1 / 10,
        }

metadict_detail['Брускетта с луком и оливками (100 грамм)'] = {
        'Брускетта с луком и оливками (килограмм)':1 / 10,
        }

metadict_detail['Брускетта с солёными боровиками (100 грамм)'] = {
        'Брускетта с солёными боровиками (килограмм)':1 / 10,
        }

metadict_detail['Брускетта с консервированными шампиньонами (100 грамм)'] = {
        'Брускетта с консервированными шампиньонами (килограмм)':1 / 10,
        }

metadict_detail['Брускетта с консервированным лечо (100 грамм)'] = {
        'Брускетта с консервированным лечо (килограмм)':1 / 10,
        }

metadict_detail['Сэндвич с арахисовой пастой (100 грамм)'] = {
        'Сэндвич с арахисовой пастой (килограмм)':1 / 10,
        }

metadict_detail['Сэндвич с пекановой пастой (100 грамм)'] = {
        'Сэндвич с пекановой пастой (килограмм)':1 / 10,
        }

metadict_detail['Сэндвич с фасолевой пастой (100 грамм)'] = {
        'Сэндвич с фасолевой пастой (килограмм)':1 / 10,
        }

metadict_detail['Сэндвич с нутовой пастой (100 грамм)'] = {
        'Сэндвич с нутовой пастой (килограмм)':1 / 10,
        }

metadict_detail['Сэндвич с яблочным джемом (100 грамм)'] = {
        'Сэндвич с яблочным джемом (килограмм)':1 / 10,
        }

metadict_detail['Сэндвич с мёдом (100 грамм)'] = {
        'Сэндвич с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Сухари панировочные (100 грамм)'] = {
        'Сухари панировочные (килограмм)':1 / 10,
        }

metadict_detail['Сухари пшеничные (100 грамм)'] = {
        'Сухари пшеничные (килограмм)':1 / 10,
        }

metadict_detail['Сухари ржаные (100 грамм)'] = {
        'Сухари ржаные (килограмм)':1 / 10,
        }

metadict_detail['Булочки пшеничные с маком (100 грамм)'] = {
        'Булочки пшеничные с маком (килограмм)':1 / 10,
        }

metadict_detail['Хлеб пшеничный домашний (100 грамм)'] = {
        'Хлеб пшеничный домашний (килограмм)':1 / 10,
        }

metadict_detail['Хлеб кукурузный домашний (100 грамм)'] = {
        'Хлеб кукурузный домашний (килограмм)':1 / 10,
        }

metadict_detail['Хлеб соевый домашний (100 грамм)'] = {
        'Хлеб соевый домашний (килограмм)':1 / 10,
        }

metadict_detail['Мука чечевичная (100 грамм)'] = {
        'Мука чечевичная (килограмм)':1 / 10,
        }

metadict_detail['Мука миндальная (100 грамм)'] = {
        'Мука миндальная (килограмм)':1 / 10,
        }

metadict_detail['Миндаль обжаренный (100 грамм)'] = {
        'Миндаль обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Миндаль замоченный (100 грамм)'] = {
        'Миндаль замоченный (килограмм)':1 / 10,
        }

metadict_detail['Порошок горчичный (100 грамм)'] = {
        'Порошок горчичный (килограмм)':1 / 10,
        }

metadict_detail['Печенье овсяное с изюмом (100 грамм)'] = {
        'Печенье овсяное с изюмом (килограмм)':1 / 10,
        }

metadict_detail['Темпе запечённый с сахаром (100 грамм)'] = {
        'Темпе запечённый с сахаром (килограмм)':1 / 10,
        }

metadict_detail['Пудинг хлебный с земляникой (100 грамм)'] = {
        'Пудинг хлебный с земляникой (килограмм)':1 / 10,
        }

metadict_detail['Пудинг бататно-смородиновый (100 грамм)'] = {
        'Пудинг бататно-смородиновый (килограмм)':1 / 10,
        }

metadict_detail['Пудинг варёный смородиновый (100 грамм)'] = {
        'Пудинг варёный смородиновый (килограмм)':1 / 10,
        }

metadict_detail['Пудинг варёный сливовый (100 грамм)'] = {
        'Пудинг варёный сливовый (килограмм)':1 / 10,
        }

metadict_detail['Пудинг кукурузно-миндальный с изюмом (100 грамм)'] = {
        'Пудинг кукурузно-миндальный с изюмом (килограмм)':1 / 10,
        }

metadict_detail['Пудинг кукурузно-миндальный (100 грамм)'] = {
        'Пудинг кукурузно-миндальный (килограмм)':1 / 10,
        }

metadict_detail['Халва морковная (100 грамм)'] = {
        'Халва морковная (килограмм)':1 / 10,
        }

metadict_detail['Халва тыквенная (100 грамм)'] = {
        'Халва тыквенная (килограмм)':1 / 10,
        }

metadict_detail['Пряники медовые (100 грамм)'] = {
        'Пряники медовые (килограмм)':1 / 10,
        }

metadict_detail['Блины пшенично-ореховые (100 грамм)'] = {
        'Блины пшенично-ореховые (килограмм)':1 / 10,
        }

metadict_detail['Блины пшенично-ореховые с боровиками (100 грамм)'] = {
        'Блины пшенично-ореховые с боровиками (килограмм)':1 / 10,
        }

metadict_detail['Блины пшенично-ореховые со сморчками (100 грамм)'] = {
        'Блины пшенично-ореховые со сморчками (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки кукурузные (100 грамм)'] = {
        'Лепёшки кукурузные (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки пшеничные (100 грамм)'] = {
        'Лепёшки пшеничные (килограмм)':1 / 10,
        }

metadict_detail['Блины ржаные (100 грамм)'] = {
        'Блины ржаные (килограмм)':1 / 10,
        }

metadict_detail['Блины пшенично-гречневые (100 грамм)'] = {
        'Блины пшенично-гречневые (килограмм)':1 / 10,
        }

metadict_detail['Блины рисовые (100 грамм)'] = {
        'Блины рисовые (килограмм)':1 / 10,
        }

metadict_detail['Блины рисовые с нутовой пастой (100 грамм)'] = {
        'Блины рисовые с нутовой пастой (килограмм)':1 / 10,
        }

metadict_detail['Блины рисовые с арахисовой пастой (100 грамм)'] = {
        'Блины рисовые с арахисовой пастой (килограмм)':1 / 10,
        }

metadict_detail['Блины рисовые с финиковой пастой (100 грамм)'] = {
        'Блины рисовые с финиковой пастой (килограмм)':1 / 10,
        }

metadict_detail['Блины рисовые с картофелем (100 грамм)'] = {
        'Блины рисовые с картофелем (килограмм)':1 / 10,
        }

metadict_detail['Блины рисовые с темпе (100 грамм)'] = {
        'Блины рисовые с темпе (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки рисовые с финиковым соусом (100 грамм)'] = {
        'Лепёшки рисовые с финиковым соусом (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки рисовые с алычовым соусом (100 грамм)'] = {
        'Лепёшки рисовые с алычовым соусом (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки рисовые с яблочным сиропом (100 грамм)'] = {
        'Лепёшки рисовые с яблочным сиропом (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки рисовые с лимонным сиропом (100 грамм)'] = {
        'Лепёшки рисовые с лимонным сиропом (килограмм)':1 / 10,
        }

metadict_detail['Кубики рисовые в сахарной глазури (100 грамм)'] = {
        'Кубики рисовые в сахарной глазури (килограмм)':1 / 10,
        }

metadict_detail['Оладьи гречневые (100 грамм)'] = {
        'Оладьи гречневые (килограмм)':1 / 10,
        }

metadict_detail['Оладьи картофельные (100 грамм)'] = {
        'Оладьи картофельные (килограмм)':1 / 10,
        }

metadict_detail['Пирожки картофельные с боровиками (100 грамм)'] = {
        'Пирожки картофельные с боровиками (килограмм)':1 / 10,
        }

metadict_detail['Пирожки картофельные со сморчками (100 грамм)'] = {
        'Пирожки картофельные со сморчками (килограмм)':1 / 10,
        }

metadict_detail['Оладьи картофельные с пряностями (100 грамм)'] = {
        'Оладьи картофельные с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Оладьи кабачковые (100 грамм)'] = {
        'Оладьи кабачковые (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные (100 грамм)'] = {
        'Оладьи овсяные (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные с клюквенным вареньем (100 грамм)'] = {
        'Оладьи овсяные с клюквенным вареньем (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные с вишнёвым вареньем (100 грамм)'] = {
        'Оладьи овсяные с вишнёвым вареньем (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные с рябиновым вареньем (100 грамм)'] = {
        'Оладьи овсяные с рябиновым вареньем (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные с одуванчиковым вареньем (100 грамм)'] = {
        'Оладьи овсяные с одуванчиковым вареньем (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные со смородиновым вареньем (100 грамм)'] = {
        'Оладьи овсяные со смородиновым вареньем (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные с кленовым сиропом (100 грамм)'] = {
        'Оладьи овсяные с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные с яблочным сиропом (100 грамм)'] = {
        'Оладьи овсяные с яблочным сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные с мёдом (100 грамм)'] = {
        'Оладьи овсяные с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи кукурузные (100 грамм)'] = {
        'Оладьи кукурузные (килограмм)':1 / 10,
        }

metadict_detail['Оладьи кукурузные с клюквенным сиропом (100 грамм)'] = {
        'Оладьи кукурузные с клюквенным сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи кукурузные с кленовым сиропом (100 грамм)'] = {
        'Оладьи кукурузные с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи кукурузные с яблочным сиропом (100 грамм)'] = {
        'Оладьи кукурузные с яблочным сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи кукурузные с мёдом (100 грамм)'] = {
        'Оладьи кукурузные с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Пончики с глазурью (100 грамм)'] = {
        'Пончики с глазурью (килограмм)':1 / 10,
        }

metadict_detail['Пончики с мёдом и корицей (100 грамм)'] = {
        'Пончики с мёдом и корицей (килограмм)':1 / 10,
        }

metadict_detail['Крендельки в сахарной глазури (100 грамм)'] = {
        'Крендельки в сахарной глазури (килограмм)':1 / 10,
        }

metadict_detail['Чурчхела с грецкими орехами (100 грамм)'] = {
        'Чурчхела с грецкими орехами (килограмм)':1 / 10,
        }

metadict_detail['Чурчхела с миндалем (100 грамм)'] = {
        'Чурчхела с миндалем (килограмм)':1 / 10,
        }

metadict_detail['Козинаки медовые с фисташками (100 грамм)'] = {
        'Козинаки медовые с фисташками (килограмм)':1 / 10,
        }

metadict_detail['Козинаки медовые с миндалем (100 грамм)'] = {
        'Козинаки медовые с миндалем (килограмм)':1 / 10,
        }

metadict_detail['Козинаки медовые с кунжутом и кешью (100 грамм)'] = {
        'Козинаки медовые с кунжутом и кешью (килограмм)':1 / 10,
        }

metadict_detail['Козинаки медовые с грецкими орехами (100 грамм)'] = {
        'Козинаки медовые с грецкими орехами (килограмм)':1 / 10,
        }

metadict_detail['Капкейки миндальные (100 грамм)'] = {
        'Капкейки миндальные (килограмм)':1 / 10,
        }

metadict_detail['Капкейки кукурузные (100 грамм)'] = {
        'Капкейки кукурузные (килограмм)':1 / 10,
        }

metadict_detail['Капкейки с брокколи (100 грамм)'] = {
        'Капкейки с брокколи (килограмм)':1 / 10,
        }

metadict_detail['Капкейки морковные (100 грамм)'] = {
        'Капкейки морковные (килограмм)':1 / 10,
        }

metadict_detail['Капкейки тыквенные (100 грамм)'] = {
        'Капкейки тыквенные (килограмм)':1 / 10,
        }

metadict_detail['Капкейки вишнёвые (100 грамм)'] = {
        'Капкейки вишнёвые (килограмм)':1 / 10,
        }

metadict_detail['Капкейки с джемом из ревеня (100 грамм)'] = {
        'Капкейки с джемом из ревеня (килограмм)':1 / 10,
        }

metadict_detail['Капкейки с яблочным джемом (100 грамм)'] = {
        'Капкейки с яблочным джемом (килограмм)':1 / 10,
        }

metadict_detail['Капкейки с сухофруктами (100 грамм)'] = {
        'Капкейки с сухофруктами (килограмм)':1 / 10,
        }

metadict_detail['Пирог закрытый овощной с шампиньонами (100 грамм)'] = {
        'Пирог закрытый овощной с шампиньонами (килограмм)':1 / 10,
        }

metadict_detail['Пирог закрытый черничный (100 грамм)'] = {
        'Пирог закрытый черничный (килограмм)':1 / 10,
        }

metadict_detail['Пирог закрытый яблочный (100 грамм)'] = {
        'Пирог закрытый яблочный (килограмм)':1 / 10,
        }

metadict_detail['Пирог закрытый тыквенный (100 грамм)'] = {
        'Пирог закрытый тыквенный (килограмм)':1 / 10,
        }

metadict_detail['Пирог закрытый бататный (100 грамм)'] = {
        'Пирог закрытый бататный (килограмм)':1 / 10,
        }

metadict_detail['Пирог закрытый со сливками и зелёным горошком (100 грамм)'] = {
        'Пирог закрытый со сливками и зелёным горошком (килограмм)':1 / 10,
        }

metadict_detail['Пирог закрытый с творогом, зеленью и яйцом (100 грамм)'] = {
        'Пирог закрытый с творогом, зеленью и яйцом (килограмм)':1 / 10,
        }

metadict_detail['Пирог закрытый с капустой и грецкими орехами (100 грамм)'] = {
        'Пирог закрытый с капустой и грецкими орехами (килограмм)':1 / 10,
        }

metadict_detail['Пирог закрытый с бараниной (100 грамм)'] = {
        'Пирог закрытый с бараниной (килограмм)':1 / 10,
        }

metadict_detail['Пирог закрытый с овечьим сыром и черемшой (100 грамм)'] = {
        'Пирог закрытый с овечьим сыром и черемшой (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый кленовый (100 грамм)'] = {
        'Пирог открытый кленовый (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый пекановый (100 грамм)'] = {
        'Пирог открытый пекановый (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый лимонный (100 грамм)'] = {
        'Пирог открытый лимонный (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый тыквенный (100 грамм)'] = {
        'Пирог открытый тыквенный (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый с тыквой и пеканом (100 грамм)'] = {
        'Пирог открытый с тыквой и пеканом (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый вишнёвый (100 грамм)'] = {
        'Пирог открытый вишнёвый (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый сливовый (100 грамм)'] = {
        'Пирог открытый сливовый (килограмм)':1 / 10,
        }

metadict_detail['Пицца с кабачком и шампиньонами (100 грамм)'] = {
        'Пицца с кабачком и шампиньонами (килограмм)':1 / 10,
        }

metadict_detail['Пирожки жареные с маком (100 грамм)'] = {
        'Пирожки жареные с маком (килограмм)':1 / 10,
        }

metadict_detail['Пирожки тыквенные (100 грамм)'] = {
        'Пирожки тыквенные (килограмм)':1 / 10,
        }

metadict_detail['Пирожки гороховые (100 грамм)'] = {
        'Пирожки гороховые (килограмм)':1 / 10,
        }

metadict_detail['Пирожки морковные (100 грамм)'] = {
        'Пирожки морковные (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с ревенем (100 грамм)'] = {
        'Пирожки с ревенем (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с щавелем (100 грамм)'] = {
        'Пирожки с щавелем (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с боровиками (100 грамм)'] = {
        'Пирожки с боровиками (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с грушей (100 грамм)'] = {
        'Пирожки с грушей (килограмм)':1 / 10,
        }

metadict_detail['Пирожки земляничные (100 грамм)'] = {
        'Пирожки земляничные (килограмм)':1 / 10,
        }

metadict_detail['Пирожки черничные (100 грамм)'] = {
        'Пирожки черничные (килограмм)':1 / 10,
        }

metadict_detail['Пирожки яблочные (100 грамм)'] = {
        'Пирожки яблочные (килограмм)':1 / 10,
        }

metadict_detail['Шарлотка яблочная (100 грамм)'] = {
        'Шарлотка яблочная (килограмм)':1 / 10,
        }

metadict_detail['Шарлотка земляничная (100 грамм)'] = {
        'Шарлотка земляничная (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с капустой (100 грамм)'] = {
        'Пирожки с капустой (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с картофелем (100 грамм)'] = {
        'Пирожки с картофелем (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с картофелем и спаржей (100 грамм)'] = {
        'Пирожки с картофелем и спаржей (килограмм)':1 / 10,
        }

metadict_detail['Сахарная пудра (100 грамм)'] = {
        'Сахарная пудра (килограмм)':1 / 10,
        }

metadict_detail['Сухофрукты североморский замоченные (100 грамм)'] = {
        'Сухофрукты североморский замоченные (килограмм)':1 / 10,
        }

metadict_detail['Сухофрукты североморские (100 грамм)'] = {
        'Сухофрукты североморские (килограмм)':1 / 10,
        }

metadict_detail['Сухофрукты среднеземные (100 грамм)'] = {
        'Сухофрукты среднеземные (килограмм)':1 / 10,
        }

metadict_detail['Травяной сбор (100 грамм)'] = {
        'Травяной сбор (килограмм)':1 / 10,
        }

metadict_detail['Корица молотая (100 грамм)'] = {
        'Корица молотая (килограмм)':1 / 10,
        }

metadict_detail['Зелень петрушки сушёная (100 грамм)'] = {
        'Зелень петрушки сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень кориандра сушёная (100 грамм)'] = {
        'Зелень кориандра сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень базилика шинкованная (100 грамм)'] = {
        'Зелень базилика шинкованная (килограмм)':1 / 10,
        }

metadict_detail['Зелень базилика сушёная (100 грамм)'] = {
        'Зелень базилика сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень фенугрека сушёная (100 грамм)'] = {
        'Зелень фенугрека сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень сельдерея сушёная (100 грамм)'] = {
        'Зелень сельдерея сушёная (килограмм)':1 / 10,
        }

metadict_detail['Перец чёрный молотый (100 грамм)'] = {
        'Перец чёрный молотый (килограмм)':1 / 10,
        }

metadict_detail['Перец острый молотый (100 грамм)'] = {
        'Перец острый молотый (килограмм)':1 / 10,
        }

metadict_detail['Паприка сушёная (100 грамм)'] = {
        'Паприка сушёная (килограмм)':1 / 10,
        }

metadict_detail['Паприка молотая (100 грамм)'] = {
        'Паприка молотая (килограмм)':1 / 10,
        }

metadict_detail['Кардамон молотый (100 грамм)'] = {
        'Кардамон молотый (килограмм)':1 / 10,
        }

metadict_detail['Перец острый сушёный (100 грамм)'] = {
        'Перец острый сушёный (килограмм)':1 / 10,
        }

metadict_detail['Зелень эстрагона сушёная (100 грамм)'] = {
        'Зелень эстрагона сушёная (килограмм)':1 / 10,
        }

#----
# Пища переработанная (100 грамм --> килограмм):

metadict_detail['Культура грибов коджи (100 грамм)'] = {
        'Культура грибов коджи (килограмм)':1 / 10,
        }

metadict_detail['Культура грибов для темпе (100 грамм)'] = {
        'Культура грибов для темпе (килограмм)':1 / 10,
        }

metadict_detail['Зелень весенняя с пряным соусом (100 грамм)'] = {
        'Зелень весенняя с пряным соусом (килограмм)':1 / 10,
        }

metadict_detail['Зелень весенняя бланшированная шинкованная (100 грамм)'] = {
        'Зелень весенняя бланшированная шинкованная (килограмм)':1 / 10,
        }

metadict_detail['Зелень пряная шинкованная (100 грамм)'] = {
        'Зелень пряная шинкованная (килограмм)':1 / 10,
        }

metadict_detail['Зелень пряная сушёная (100 грамм)'] = {
        'Зелень пряная сушёная (килограмм)':1 / 10,
        }

metadict_detail['Морковь шинкованная (100 грамм)'] = {
        'Морковь шинкованная (килограмм)':1 / 10,
        }

metadict_detail['Корень имбиря шинкованный (100 грамм)'] = {
        'Корень имбиря шинкованный (килограмм)':1 / 10,
        }

metadict_detail['Корень сельдерея шинкованный (100 грамм)'] = {
        'Корень сельдерея шинкованный (килограмм)':1 / 10,
        }

metadict_detail['Корень сельдерея обжаренный (100 грамм)'] = {
        'Корень сельдерея обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Корень сельдерея варёный (100 грамм)'] = {
        'Корень сельдерея варёный (килограмм)':1 / 10,
        }

metadict_detail['Черешок сельдерея варёный (100 грамм)'] = {
        'Черешок сельдерея варёный (килограмм)':1 / 10,
        }

metadict_detail['Черешок сельдерея шинкованный (100 грамм)'] = {
        'Черешок сельдерея шинкованный (килограмм)':1 / 10,
        }

metadict_detail['Корень сельдерея тушёный с морковью (100 грамм)'] = {
        'Корень сельдерея тушёный с морковью (килограмм)':1 / 10,
        }

metadict_detail['Корень сельдерея жареный брусками во фритюре (100 грамм)'] = {
        'Корень сельдерея жареный брусками во фритюре (килограмм)':1 / 10,
        }

metadict_detail['Корень сельдерея печёный с соевым соусом (100 грамм)'] = {
        'Корень сельдерея печёный с соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Крупа ячневая замоченная (100 грамм)'] = {
        'Крупа ячневая замоченная (килограмм)':1 / 10,
        }

metadict_detail['Крупа ячневая промытая (100 грамм)'] = {
        'Крупа ячневая промытая (килограмм)':1 / 10,
        }

metadict_detail['Крупа пшеничная замоченная (100 грамм)'] = {
        'Крупа пшеничная замоченная (килограмм)':1 / 10,
        }

metadict_detail['Крупа перловая замоченная (100 грамм)'] = {
        'Крупа перловая замоченная (килограмм)':1 / 10,
        }

metadict_detail['Крупа перловая замоченная прокаленная (100 грамм)'] = {
        'Крупа перловая замоченная прокаленная (килограмм)':1 / 10,
        }

metadict_detail['Крупа пшённая замоченная (100 грамм)'] = {
        'Крупа пшённая замоченная (килограмм)':1 / 10,
        }

metadict_detail['Крупа пшённая промытая (100 грамм)'] = {
        'Крупа пшённая промытая (килограмм)':1 / 10,
        }

metadict_detail['Просо замоченное (100 грамм)'] = {
        'Просо замоченное (килограмм)':1 / 10,
        }

metadict_detail['Пшено варёное (100 грамм)'] = {
        'Пшено варёное (килограмм)':1 / 10,
        }

metadict_detail['Рис прокаленный (100 грамм)'] = {
        'Рис прокаленный (килограмм)':1 / 10,
        }

metadict_detail['Рис замоченный (100 грамм)'] = {
        'Рис замоченный (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный (100 грамм)'] = {
        'Рис варёный (килограмм)':1 / 10,
        }

metadict_detail['Рис тушёный с боровиками (100 грамм)'] = {
        'Рис тушёный с боровиками (килограмм)':1 / 10,
        }

metadict_detail['Рис тушёный с овощами (100 грамм)'] = {
        'Рис тушёный с овощами (килограмм)':1 / 10,
        }

metadict_detail['Рис тушёный с овощами и шампиньонами (100 грамм)'] = {
        'Рис тушёный с овощами и шампиньонами (килограмм)':1 / 10,
        }

metadict_detail['Рис тушёный со свекольным кремом (100 грамм)'] = {
        'Рис тушёный со свекольным кремом (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный с соевым соусом (100 грамм)'] = {
        'Рис варёный с соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный с томатным соусом (100 грамм)'] = {
        'Рис варёный с томатным соусом (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный с консервированными овощами (100 грамм)'] = {
        'Рис варёный с консервированными овощами (килограмм)':1 / 10,
        }

metadict_detail['Рис тушёный с вёшенками и овощами (100 грамм)'] = {
        'Рис тушёный с вёшенками и овощами (килограмм)':1 / 10,
        }

metadict_detail['Рис тушёный с фасолью (100 грамм)'] = {
        'Рис тушёный с фасолью (килограмм)':1 / 10,
        }

metadict_detail['Рис тушёный с сельдереем и кукурузой (100 грамм)'] = {
        'Рис тушёный с сельдереем и кукурузой (килограмм)':1 / 10,
        }

metadict_detail['Рис тушёный с тыквой и кукурузой (100 грамм)'] = {
        'Рис тушёный с тыквой и кукурузой (килограмм)':1 / 10,
        }

metadict_detail['Рис обжарено-варёный (100 грамм)'] = {
        'Рис обжарено-варёный (килограмм)':1 / 10,
        }

metadict_detail['Рис тушёный с чечевицей и луком (100 грамм)'] = {
        'Рис тушёный с чечевицей и луком (килограмм)':1 / 10,
        }

metadict_detail['Рис обжаренный с квашеной капустой (100 грамм)'] = {
        'Рис обжаренный с квашеной капустой (килограмм)':1 / 10,
        }

metadict_detail['Рис обжаренный с капустой и спаржей (100 грамм)'] = {
        'Рис обжаренный с капустой и спаржей (килограмм)':1 / 10,
        }

metadict_detail['Рис обжаренный с капустой и овощами (100 грамм)'] = {
        'Рис обжаренный с капустой и овощами (килограмм)':1 / 10,
        }

metadict_detail['Рис обжаренный с капустой и грибами (100 грамм)'] = {
        'Рис обжаренный с капустой и грибами (килограмм)':1 / 10,
        }

metadict_detail['Зверобой сушёный (100 грамм)'] = {
        'Зверобой сушёный (килограмм)':1 / 10,
        }

metadict_detail['Клевер сушёный (100 грамм)'] = {
        'Клевер сушёный (килограмм)':1 / 10,
        }

metadict_detail['Иссоп сушёный (100 грамм)'] = {
        'Иссоп сушёный (килограмм)':1 / 10,
        }

metadict_detail['Крапива сушёная (100 грамм)'] = {
        'Крапива сушёная (килограмм)':1 / 10,
        }

metadict_detail['Ромашка сушёная (100 грамм)'] = {
        'Ромашка сушёная (килограмм)':1 / 10,
        }

metadict_detail['Кипрей сушёный (100 грамм)'] = {
        'Кипрей сушёный (килограмм)':1 / 10,
        }

metadict_detail['Таволга сушёная (100 грамм)'] = {
        'Таволга сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень фенхеля сушёная (100 грамм)'] = {
        'Зелень фенхеля сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень чабреца сушёная (100 грамм)'] = {
        'Зелень чабреца сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень руколы сушёная (100 грамм)'] = {
        'Зелень руколы сушёная (килограмм)':1 / 10,
        }

metadict_detail['Мелисса сушёная (100 грамм)'] = {
        'Мелисса сушёная (килограмм)':1 / 10,
        }

metadict_detail['Лаванда сушёная (100 грамм)'] = {
        'Лаванда сушёная (килограмм)':1 / 10,
        }

metadict_detail['Любисток сушёный (100 грамм)'] = {
        'Любисток сушёный (килограмм)':1 / 10,
        }

metadict_detail['Морская капуста замоченная (100 грамм)'] = {
        'Морская капуста замоченная (килограмм)':1 / 10,
        }

metadict_detail['Морская капуста обжаренная (100 грамм)'] = {
        'Морская капуста обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Морская капуста сушёная (100 грамм)'] = {
        'Морская капуста сушёная (килограмм)':1 / 10,
        }

metadict_detail['Сидр яблочный (100 грамм)'] = {
        'Сидр яблочный (килограмм)':1 / 10,
        }

metadict_detail['Сидр грушевый (100 грамм)'] = {
        'Сидр грушевый (килограмм)':1 / 10,
        }

metadict_detail['Вино красное сухое (100 грамм)'] = {
        'Вино красное сухое (килограмм)':1 / 10,
        }

metadict_detail['Вино белое сухое (100 грамм)'] = {
        'Вино белое сухое (килограмм)':1 / 10,
        }

metadict_detail['Уксус яблочный 3% (100 грамм)'] = {
        'Уксус яблочный 3% (килограмм)':1 / 10,
        }

metadict_detail['Уксус яблочный 6% (100 грамм)'] = {
        'Уксус яблочный 6% (килограмм)':1 / 10,
        }

metadict_detail['Уксус виноградный 3% (100 грамм)'] = {
        'Уксус виноградный 3% (килограмм)':1 / 10,
        }

metadict_detail['Уксус виноградный 6% (100 грамм)'] = {
        'Уксус виноградный 6% (килограмм)':1 / 10,
        }

metadict_detail['Сок виноградный уваренный с мукой (100 грамм)'] = {
        'Сок виноградный уваренный с мукой (килограмм)':1 / 10,
        }

metadict_detail['Сироп кленовый (100 грамм)'] = {
        'Сироп кленовый (килограмм)':1 / 10,
        }

metadict_detail['Шоколад горький (100 грамм)'] = {
        'Шоколад горький (килограмм)':1 / 10,
        }

metadict_detail['Шоколад ванильный (100 грамм)'] = {
        'Шоколад ванильный (килограмм)':1 / 10,
        }

metadict_detail['Шоколад с изюмом (100 грамм)'] = {
        'Шоколад с изюмом (килограмм)':1 / 10,
        }

metadict_detail['Карамель медовая (100 грамм)'] = {
        'Карамель медовая (килограмм)':1 / 10,
        }

metadict_detail['Сироп сахарный (100 грамм)'] = {
        'Сироп сахарный (килограмм)':1 / 10,
        }

metadict_detail['Карамель сахарная (100 грамм)'] = {
        'Карамель сахарная (килограмм)':1 / 10,
        }

metadict_detail['Сироп лимонный (100 грамм)'] = {
        'Сироп лимонный (килограмм)':1 / 10,
        }

metadict_detail['Сироп клюквенный (100 грамм)'] = {
        'Сироп клюквенный (килограмм)':1 / 10,
        }

metadict_detail['Сироп яблочный (100 грамм)'] = {
        'Сироп яблочный (килограмм)':1 / 10,
        }

metadict_detail['Сок яблочный (100 грамм)'] = {
        'Сок яблочный (килограмм)':1 / 10,
        }

metadict_detail['Сок лимонный (100 грамм)'] = {
        'Сок лимонный (килограмм)':1 / 10,
        }

metadict_detail['Сок гранатовый (100 грамм)'] = {
        'Сок гранатовый (килограмм)':1 / 10,
        }

metadict_detail['Сок виноградный (100 грамм)'] = {
        'Сок виноградный (килограмм)':1 / 10,
        }

metadict_detail['Сок клюквенный (100 грамм)'] = {
        'Сок клюквенный (килограмм)':1 / 10,
        }

metadict_detail['Сок вишнёвый (100 грамм)'] = {
        'Сок вишнёвый (килограмм)':1 / 10,
        }

metadict_detail['Сок ревеня (100 грамм)'] = {
        'Сок ревеня (килограмм)':1 / 10,
        }

metadict_detail['Сок томатный (100 грамм)'] = {
        'Сок томатный (килограмм)':1 / 10,
        }

metadict_detail['Квас ржаной имбирно-яблочный (100 грамм)'] = {
        'Квас ржаной имбирно-яблочный (килограмм)':1 / 10,
        }

metadict_detail['Квас ржаной хлебный (100 грамм)'] = {
        'Квас ржаной хлебный (килограмм)':1 / 10,
        }

metadict_detail['Квас ржаной солодовый (100 грамм)'] = {
        'Квас ржаной солодовый (килограмм)':1 / 10,
        }

metadict_detail['Квас ржано-гречневый солодовый (100 грамм)'] = {
        'Квас ржано-гречневый солодовый (килограмм)':1 / 10,
        }

metadict_detail['Квас свекольный (100 грамм)'] = {
        'Квас свекольный (килограмм)':1 / 10,
        }

metadict_detail['Эль имбирный (100 грамм)'] = {
        'Эль имбирный (килограмм)':1 / 10,
        }

metadict_detail['Капуста квашеная (100 грамм)'] = {
        'Капуста квашеная (килограмм)':1 / 10,
        }

metadict_detail['Капуста квашеная томлёная (100 грамм)'] = {
        'Капуста квашеная томлёная (килограмм)':1 / 10,
        }

metadict_detail['Капуста квашеная с соевым соусом (100 грамм)'] = {
        'Капуста квашеная с соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Капуста тушёная (100 грамм)'] = {
        'Капуста тушёная (килограмм)':1 / 10,
        }

metadict_detail['Капуста тушёная с пряным соусом (100 грамм)'] = {
        'Капуста тушёная с пряным соусом (килограмм)':1 / 10,
        }

metadict_detail['Салат капустный с пряностями (100 грамм)'] = {
        'Салат капустный с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Капуста обжаренная в сухарях (100 грамм)'] = {
        'Капуста обжаренная в сухарях (килограмм)':1 / 10,
        }

metadict_detail['Капуста бланшированная (100 грамм)'] = {
        'Капуста бланшированная (килограмм)':1 / 10,
        }

metadict_detail['Кабачок солёный (100 грамм)'] = {
        'Кабачок солёный (килограмм)':1 / 10,
        }

metadict_detail['Огурцы солёные (100 грамм)'] = {
        'Огурцы солёные (килограмм)':1 / 10,
        }

metadict_detail['Огурцы подсушенные солью (100 грамм)'] = {
        'Огурцы подсушенные солью (килограмм)':1 / 10,
        }

metadict_detail['Томаты солёные (100 грамм)'] = {
        'Томаты солёные (килограмм)':1 / 10,
        }

metadict_detail['Оливки маринованные (100 грамм)'] = {
        'Оливки маринованные (килограмм)':1 / 10,
        }

metadict_detail['Каперсы замоченные (100 грамм)'] = {
        'Каперсы замоченные (килограмм)':1 / 10,
        }

metadict_detail['Каперсы маринованные (100 грамм)'] = {
        'Каперсы маринованные (килограмм)':1 / 10,
        }

metadict_detail['Фенхель маринованный (100 грамм)'] = {
        'Фенхель маринованный (килограмм)':1 / 10,
        }

metadict_detail['Винегрет с боровиками (100 грамм)'] = {
        'Винегрет с боровиками (килограмм)':1 / 10,
        }

metadict_detail['Винегрет с чечевицей (100 грамм)'] = {
        'Винегрет с чечевицей (килограмм)':1 / 10,
        }

metadict_detail['Винегрет с зелёным горошком (100 грамм)'] = {
        'Винегрет с зелёным горошком (килограмм)':1 / 10,
        }

metadict_detail['Винегрет с мочёными фруктами (100 грамм)'] = {
        'Винегрет с мочёными фруктами (килограмм)':1 / 10,
        }

metadict_detail['Винегрет с маринованными каперсами (100 грамм)'] = {
        'Винегрет с маринованными каперсами (килограмм)':1 / 10,
        }

metadict_detail['Винегрет овощной (100 грамм)'] = {
        'Винегрет овощной (килограмм)':1 / 10,
        }

metadict_detail['Салат зелёный огуречный с редисом (100 грамм)'] = {
        'Салат зелёный огуречный с редисом (килограмм)':1 / 10,
        }

metadict_detail['Салат зелёный огуречно-томатный (100 грамм)'] = {
        'Салат зелёный огуречно-томатный (килограмм)':1 / 10,
        }

metadict_detail['Салат зелёный томатный со сладким перцем (100 грамм)'] = {
        'Салат зелёный томатный со сладким перцем (килограмм)':1 / 10,
        }

metadict_detail['Салат из морской капусты с соевым соусом (100 грамм)'] = {
        'Салат из морской капусты с соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Салат огуречно-морковный с соевым соусом (100 грамм)'] = {
        'Салат огуречно-морковный с соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Салат морковный с соевым соусом (100 грамм)'] = {
        'Салат морковный с соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Салат из брокколи с огурцами (100 грамм)'] = {
        'Салат из брокколи с огурцами (килограмм)':1 / 10,
        }

metadict_detail['Салат из варёной спаржи со шпинатом (100 грамм)'] = {
        'Салат из варёной спаржи со шпинатом (килограмм)':1 / 10,
        }

metadict_detail['Салат из свежей свёклы (100 грамм)'] = {
        'Салат из свежей свёклы (килограмм)':1 / 10,
        }

metadict_detail['Салат из варёной свёклы (100 грамм)'] = {
        'Салат из варёной свёклы (килограмм)':1 / 10,
        }

metadict_detail['Салат из солёных кабачков (100 грамм)'] = {
        'Салат из солёных кабачков (килограмм)':1 / 10,
        }

metadict_detail['Закуска из квашеной капусты (100 грамм)'] = {
        'Закуска из квашеной капусты (килограмм)':1 / 10,
        }

metadict_detail['Свёкла квашеная (100 грамм)'] = {
        'Свёкла квашеная (килограмм)':1 / 10,
        }

metadict_detail['Репа квашеная (100 грамм)'] = {
        'Репа квашеная (килограмм)':1 / 10,
        }

metadict_detail['Репа квашеная томлёная (100 грамм)'] = {
        'Репа квашеная томлёная (килограмм)':1 / 10,
        }

metadict_detail['Яблоко мочёное (100 грамм)'] = {
        'Яблоко мочёное (килограмм)':1 / 10,
        }

metadict_detail['Груша мочёная (100 грамм)'] = {
        'Груша мочёная (килограмм)':1 / 10,
        }

metadict_detail['Слива мочёная (100 грамм)'] = {
        'Слива мочёная (килограмм)':1 / 10,
        }

metadict_detail['Морошка мочёная (100 грамм)'] = {
        'Морошка мочёная (килограмм)':1 / 10,
        }

metadict_detail['Вишня мочёная (100 грамм)'] = {
        'Вишня мочёная (килограмм)':1 / 10,
        }

metadict_detail['Крыжовник мочёный (100 грамм)'] = {
        'Крыжовник мочёный (килограмм)':1 / 10,
        }

metadict_detail['Заправка для овощного террина (100 грамм)'] = {
        'Заправка для овощного террина (килограмм)':1 / 10,
        }

metadict_detail['Заправка для винегрета на подсолнечном масле (100 грамм)'] = {
        'Заправка для винегрета на подсолнечном масле (килограмм)':1 / 10,
        }

metadict_detail['Заправка для салатов медово-горчичная (100 грамм)'] = {
        'Заправка для салатов медово-горчичная (килограмм)':1 / 10,
        }

metadict_detail['Заправка для салатов лимонно-соевая (100 грамм)'] = {
        'Заправка для салатов лимонно-соевая (килограмм)':1 / 10,
        }

metadict_detail['Заправка для салатов на соевом соусе (100 грамм)'] = {
        'Заправка для салатов на соевом соусе (килограмм)':1 / 10,
        }

metadict_detail['Заправка для салатов на подсолнечном масле (100 грамм)'] = {
        'Заправка для салатов на подсолнечном масле (килограмм)':1 / 10,
        }

metadict_detail['Заправка для салатов на конопляном масле (100 грамм)'] = {
        'Заправка для салатов на конопляном масле (килограмм)':1 / 10,
        }

metadict_detail['Заправка для салатов на оливковом масле (100 грамм)'] = {
        'Заправка для салатов на оливковом масле (килограмм)':1 / 10,
        }

metadict_detail['Рассол 20% (100 грамм)'] = {
        'Рассол 20% (килограмм)':1 / 10,
        }

metadict_detail['Рассол свекольный (100 грамм)'] = {
        'Рассол свекольный (килограмм)':1 / 10,
        }

metadict_detail['Рассол огуречный (100 грамм)'] = {
        'Рассол огуречный (килограмм)':1 / 10,
        }

metadict_detail['Рассол для квашения овощей (100 грамм)'] = {
        'Рассол для квашения овощей (килограмм)':1 / 10,
        }

metadict_detail['Рассол для соления овощей (100 грамм)'] = {
        'Рассол для соления овощей (килограмм)':1 / 10,
        }

metadict_detail['Рассол для соления грибов (100 грамм)'] = {
        'Рассол для соления грибов (килограмм)':1 / 10,
        }

metadict_detail['Маринад для консервации грибов (100 грамм)'] = {
        'Маринад для консервации грибов (килограмм)':1 / 10,
        }

metadict_detail['Маринад для консервации оливок (100 грамм)'] = {
        'Маринад для консервации оливок (килограмм)':1 / 10,
        }

metadict_detail['Рассол для мочения фруктов (100 грамм)'] = {
        'Рассол для мочения фруктов (килограмм)':1 / 10,
        }

metadict_detail['Вода кипячёная (100 грамм)'] = {
        'Вода кипячёная (литр)':1 / 10,
        }

metadict_detail['Вода кипячёная в самоваре (100 грамм)'] = {
        'Вода кипячёная в самоваре (литр)':1 / 10,
        }

metadict_detail['Вода кипячёная в котелке (100 грамм)'] = {
        'Вода кипячёная в котелке (литр)':1 / 10,
        }

metadict_detail['Вода для готовки (100 грамм)'] = {
        'Вода для готовки (литр)':1 / 10,
        }

#----
# Пища обработанная (100 грамм --> килограмм):

metadict_detail['Молоко коровье кислое (100 грамм)'] = {
        'Молоко коровье кислое (килограмм)':1 / 10,
        }

metadict_detail['Масло сливочное коровье (100 грамм)'] = {
        'Масло сливочное коровье (килограмм)':1 / 10,
        }

metadict_detail['Сливки коровьи (100 грамм)'] = {
        'Сливки коровьи (килограмм)':1 / 10,
        }

metadict_detail['Кости бараньи запечённые (100 грамм)'] = {
        'Кости бараньи запечённые (килограмм)':1 / 10,
        }

metadict_detail['Кости говяжьи запечённые (100 грамм)'] = {
        'Кости говяжьи запечённые (килограмм)':1 / 10,
        }

metadict_detail['Телятина нарезанная припущенная обжаренная (100 грамм)'] = {
        'Телятина нарезанная припущенная обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Телятина нарезанная припущенная (100 грамм)'] = {
        'Телятина нарезанная припущенная (килограмм)':1 / 10,
        }

metadict_detail['Телятина нарезанная (100 грамм)'] = {
        'Телятина нарезанная (килограмм)':1 / 10,
        }

metadict_detail['Говядина нарезанная припущенная обжаренная (100 грамм)'] = {
        'Говядина нарезанная припущенная обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Говядина нарезанная припущенная (100 грамм)'] = {
        'Говядина нарезанная припущенная (килограмм)':1 / 10,
        }

metadict_detail['Говядина нарезанная (100 грамм)'] = {
        'Говядина нарезанная (килограмм)':1 / 10,
        }

metadict_detail['Говядина нарезанная солёная (100 грамм)'] = {
        'Говядина нарезанная солёная (килограмм)':1 / 10,
        }

metadict_detail['Говядина нарезанная солёная замоченная (100 грамм)'] = {
        'Говядина нарезанная солёная замоченная (килограмм)':1 / 10,
        }

metadict_detail['Говядина нарезанная солёная тушёная (100 грамм)'] = {
        'Говядина нарезанная солёная тушёная (килограмм)':1 / 10,
        }

metadict_detail['Телятина шинкованная (100 грамм)'] = {
        'Телятина шинкованная (килограмм)':1 / 10,
        }

metadict_detail['Курица нарезанная (100 грамм)'] = {
        'Курица нарезанная (килограмм)':1 / 10,
        }

metadict_detail['Курица нарезанная варёная (100 грамм)'] = {
        'Курица нарезанная варёная (килограмм)':1 / 10,
        }

metadict_detail['Жир бараний курдючный топлёный (100 грамм)'] = {
        'Жир бараний курдючный топлёный (килограмм)':1 / 10,
        }

metadict_detail['Ливер бараний нарезанный (100 грамм)'] = {
        'Ливер бараний нарезанный (килограмм)':1 / 10,
        }

metadict_detail['Ливер говяжий нарезанный (100 грамм)'] = {
        'Ливер говяжий нарезанный (килограмм)':1 / 10,
        }

metadict_detail['Говяжьи субпродукты варёные (100 грамм)'] = {
        'Говяжьи субпродукты варёные (килограмм)':1 / 10,
        }

metadict_detail['Говяжьи субпродукты для хаша (100 грамм)'] = {
        'Говяжьи субпродукты для хаша (килограмм)':1 / 10,
        }

metadict_detail['Баранина запечённая с ливером, луком и пряностями (100 грамм)'] = {
        'Баранина запечённая с ливером, луком и пряностями (килограмм)':1 / 10,
        }

metadict_detail['Баранина нарезанная припущенная обжаренная (100 грамм)'] = {
        'Баранина нарезанная припущенная обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Баранина нарезанная припущенная (100 грамм)'] = {
        'Баранина нарезанная припущенная (килограмм)':1 / 10,
        }

metadict_detail['Баранина нарезанная (100 грамм)'] = {
        'Баранина нарезанная (килограмм)':1 / 10,
        }

metadict_detail['Баранина нарезанная варёная (100 грамм)'] = {
        'Баранина нарезанная варёная (килограмм)':1 / 10,
        }

metadict_detail['Баранина нарезанная варёная обжаренная (100 грамм)'] = {
        'Баранина нарезанная варёная обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Хинкали с телятиной варёные (100 грамм)'] = {
        'Хинкали с телятиной варёные (килограмм)':1 / 10,
        }

metadict_detail['Хинкали с телятиной (100 грамм)'] = {
        'Хинкали с телятиной (килограмм)':1 / 10,
        }

metadict_detail['Фарш телячий для хинкали (100 грамм)'] = {
        'Фарш телячий для хинкали (килограмм)':1 / 10,
        }

metadict_detail['Баранина шинкованная (100 грамм)'] = {
        'Баранина шинкованная (килограмм)':1 / 10,
        }

metadict_detail['Рыба морская красная вяленая (100 грамм)'] = {
        'Рыба морская красная вяленая (килограмм)':1 / 10,
        }

metadict_detail['Белуга вяленая (100 грамм)'] = {
        'Белуга вяленая (килограмм)':1 / 10,
        }

metadict_detail['Форель фаршированная рисом и изюмом (100 грамм)'] = {
        'Форель фаршированная рисом и изюмом (килограмм)':1 / 10,
        }

metadict_detail['Вино красное разбавленное (100 грамм)'] = {
        'Вино красное разбавленное (килограмм)':1 / 10,
        }

metadict_detail['Каша перловая с овощами (100 грамм)'] = {
        'Каша перловая с овощами (килограмм)':1 / 10,
        }

metadict_detail['Каша перловая с рыбой и овощами (100 грамм)'] = {
        'Каша перловая с рыбой и овощами (килограмм)':1 / 10,
        }

metadict_detail['Каша перловая с бараниной (100 грамм)'] = {
        'Каша перловая с бараниной (килограмм)':1 / 10,
        }

metadict_detail['Каша перловая с солониной (100 грамм)'] = {
        'Каша перловая с солониной (килограмм)':1 / 10,
        }

metadict_detail['Каша перловая с говядиной и овощами (100 грамм)'] = {
        'Каша перловая с говядиной и овощами (килограмм)':1 / 10,
        }

metadict_detail['Каша перловая с телятиной и овощами (100 грамм)'] = {
        'Каша перловая с телятиной и овощами (килограмм)':1 / 10,
        }

metadict_detail['Каша пшеничная с говядиной (100 грамм)'] = {
        'Каша пшеничная с говядиной (килограмм)':1 / 10,
        }

metadict_detail['Каша пшеничная с бараниной (100 грамм)'] = {
        'Каша пшеничная с бараниной (килограмм)':1 / 10,
        }

metadict_detail['Каша пшённая с фруктами (100 грамм)'] = {
        'Каша пшённая с фруктами (килограмм)':1 / 10,
        }

metadict_detail['Каша пшённая с изюмом (100 грамм)'] = {
        'Каша пшённая с изюмом (килограмм)':1 / 10,
        }

metadict_detail['Суп из баранины с чечевицей и пряностями (100 грамм)'] = {
        'Суп из баранины с чечевицей и пряностями (килограмм)':1 / 10,
        }

metadict_detail['Суп из баранины с рисом и зеленью (100 грамм)'] = {
        'Суп из баранины с рисом и зеленью (килограмм)':1 / 10,
        }

metadict_detail['Суп из курицы с яичной заправкой (100 грамм)'] = {
        'Суп из курицы с яичной заправкой (килограмм)':1 / 10,
        }

metadict_detail['Суп крупяно-бобовый с грецкими орехами (100 грамм)'] = {
        'Суп крупяно-бобовый с грецкими орехами (килограмм)':1 / 10,
        }

metadict_detail['Лаваш пшеничный с пряной зеленью (100 грамм)'] = {
        'Лаваш пшеничный с пряной зеленью (килограмм)':1 / 10,
        }

metadict_detail['Лаваш пшеничный (100 грамм)'] = {
        'Лаваш пшеничный (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки пшеничные на сыворотке (100 грамм)'] = {
        'Лепёшки пшеничные на сыворотке (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки пшеничные с изюмом (100 грамм)'] = {
        'Лепёшки пшеничные с изюмом (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки пшеничные с овечьим сыром (100 грамм)'] = {
        'Лепёшки пшеничные с овечьим сыром (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки пшеничные с творогом (100 грамм)'] = {
        'Лепёшки пшеничные с творогом (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки ячменные на сыворотке (100 грамм)'] = {
        'Лепёшки ячменные на сыворотке (килограмм)':1 / 10,
        }

metadict_detail['Лепёшки ячменно-пшеничные на сыворотке (100 грамм)'] = {
        'Лепёшки ячменно-пшеничные на сыворотке (килограмм)':1 / 10,
        }

metadict_detail['Творог овечий (100 грамм)'] = {
        'Творог овечий (килограмм)':1 / 10,
        }

metadict_detail['Творог козий (100 грамм)'] = {
        'Творог козий (килограмм)':1 / 10,
        }

metadict_detail['Творог коровий (100 грамм)'] = {
        'Творог коровий (килограмм)':1 / 10,
        }

metadict_detail['Сыр овечий рассольный (100 грамм)'] = {
        'Сыр овечий рассольный (килограмм)':1 / 10,
        }

metadict_detail['Сыр овечий толчёный с травами (100 грамм)'] = {
        'Сыр овечий толчёный с травами (килограмм)':1 / 10,
        }

metadict_detail['Сыр овечий толчёный с чесноком (100 грамм)'] = {
        'Сыр овечий толчёный с чесноком (килограмм)':1 / 10,
        }

metadict_detail['Сыр коровий рассольный (100 грамм)'] = {
        'Сыр коровий рассольный (килограмм)':1 / 10,
        }

metadict_detail['Сыр козий рассольный (100 грамм)'] = {
        'Сыр козий рассольный (килограмм)':1 / 10,
        }

metadict_detail['Осётр вяленый (100 грамм)'] = {
        'Осётр вяленый (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре чечевичный с пряной зеленью (100 грамм)'] = {
        'Суп-пюре чечевичный с пряной зеленью (килограмм)':1 / 10,
        }

metadict_detail['Суп чечевичный на молоке (100 грамм)'] = {
        'Суп чечевичный на молоке (килограмм)':1 / 10,
        }

metadict_detail['Суп чечевичный на сыворотке (100 грамм)'] = {
        'Суп чечевичный на сыворотке (килограмм)':1 / 10,
        }

metadict_detail['Севрюга вяленая (100 грамм)'] = {
        'Севрюга вяленая (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре нутовый с пряной зеленью (100 грамм)'] = {
        'Суп-пюре нутовый с пряной зеленью (килограмм)':1 / 10,
        }

metadict_detail['Крупа гречневая прокаленная (100 грамм)'] = {
        'Крупа гречневая прокаленная (килограмм)':1 / 10,
        }

metadict_detail['Мука пшеничная прокаленная (100 грамм)'] = {
        'Мука пшеничная прокаленная (килограмм)':1 / 10,
        }

metadict_detail['Мука панировочная (100 грамм)'] = {
        'Мука панировочная (килограмм)':1 / 10,
        }

metadict_detail['Джем яблочный (100 грамм)'] = {
        'Джем яблочный (килограмм)':1 / 10,
        }

metadict_detail['Джем из ревеня (100 грамм)'] = {
        'Джем из ревеня (килограмм)':1 / 10,
        }

metadict_detail['Арахис обжаренный (100 грамм)'] = {
        'Арахис обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Арахис варёный (100 грамм)'] = {
        'Арахис варёный (килограмм)':1 / 10,
        }

metadict_detail['Арахис замоченный (100 грамм)'] = {
        'Арахис замоченный (килограмм)':1 / 10,
        }

metadict_detail['Орех грецкий толчёный (100 грамм)'] = {
        'Орех грецкий толчёный (килограмм)':1 / 10,
        }

metadict_detail['Орех грецкий шинкованный (100 грамм)'] = {
        'Орех грецкий шинкованный (килограмм)':1 / 10,
        }

metadict_detail['Орех грецкий шинкованный обжаренный (100 грамм)'] = {
        'Орех грецкий шинкованный обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Орех кешью обжаренный (100 грамм)'] = {
        'Орех кешью обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Фисташки обжаренные (100 грамм)'] = {
        'Фисташки обжаренные (килограмм)':1 / 10,
        }

metadict_detail['Паста морковно-чесночная (100 грамм)'] = {
        'Паста морковно-чесночная (килограмм)':1 / 10,
        }

metadict_detail['Паста чесночно-кинзовая (100 грамм)'] = {
        'Паста чесночно-кинзовая (килограмм)':1 / 10,
        }

metadict_detail['Паста имбирно-чесночная (100 грамм)'] = {
        'Паста имбирно-чесночная (килограмм)':1 / 10,
        }

metadict_detail['Паста арахисовая (100 грамм)'] = {
        'Паста арахисовая (килограмм)':1 / 10,
        }

metadict_detail['Паста пекановая (100 грамм)'] = {
        'Паста пекановая (килограмм)':1 / 10,
        }

metadict_detail['Паста фасолевая (100 грамм)'] = {
        'Паста фасолевая (килограмм)':1 / 10,
        }

metadict_detail['Паста нутовая (100 грамм)'] = {
        'Паста нутовая (килограмм)':1 / 10,
        }

metadict_detail['Паста финиково-шоколадная (100 грамм)'] = {
        'Паста финиково-шоколадная (килограмм)':1 / 10,
        }

metadict_detail['Паста кунжутная (100 грамм)'] = {
        'Паста кунжутная (килограмм)':1 / 10,
        }

metadict_detail['Раствор крахмальный 10% (100 грамм)'] = {
        'Раствор крахмальный 10% (килограмм)':1 / 10,
        }

metadict_detail['Агар-агар (100 грамм)'] = {
        'Агар-агар (килограмм)':1 / 10,
        }

metadict_detail['Соль поваренная (100 грамм)'] = {
        'Соль поваренная (килограмм)':1 / 10,
        }

metadict_detail['Соль чёрная (100 грамм)'] = {
        'Соль чёрная (килограмм)':1 / 10,
        }

metadict_detail['Сода пищевая (100 грамм)'] = {
        'Сода пищевая (килограмм)':1 / 10,
        }

metadict_detail['Порошок асафетиды (100 грамм)'] = {
        'Порошок асафетиды (килограмм)':1 / 10,
        }

metadict_detail['Асафетида (100 грамм)'] = {
        'Асафетида (килограмм)':1 / 10,
        }

metadict_detail['Зверобой отборный (100 грамм)'] = {
        'Зверобой отборный (килограмм)':1 / 10,
        }

metadict_detail['Таволга отборная (100 грамм)'] = {
        'Таволга отборная (килограмм)':1 / 10,
        }

#----
# Пища растительная (100 грамм --> килограмм):

metadict_detail['Масло арахисовое (100 грамм)'] = {
        'Масло арахисовое (килограмм)':1 / 10,
        #'_-Потребление пищи (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':99.9,
        '-Углеводы растительные (грамм)':0.0,
        }

metadict_detail['Масло подсолнечное (100 грамм)'] = {
        'Масло подсолнечное (килограмм)':1 / 10,
        #'_-Потребление пищи (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':99.9,
        '-Углеводы растительные (грамм)':0.0,
        }

metadict_detail['Масло оливковое (100 грамм)'] = {
        'Масло оливковое (килограмм)':1 / 10,
        #'_-Потребление пищи (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':99.9,
        '-Углеводы растительные (грамм)':0.0,
        }

metadict_detail['Масло конопляное (100 грамм)'] = {
        'Масло конопляное (килограмм)':1 / 10,
        #'_-Потребление пищи (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':99.9,
        '-Углеводы растительные (грамм)':0.0,
        }

metadict_detail['Масло льняное (100 грамм)'] = {
        'Масло льняное (килограмм)':1 / 10,
        #'_-Потребление пищи (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':99.9,
        '-Углеводы растительные (грамм)':0.0,
        }

metadict_detail['Масло кунжутное (100 грамм)'] = {
        'Масло кунжутное (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':99.9,
        '-Углеводы растительные (грамм)':0.0,
        }

metadict_detail['Масло соевое (100 грамм)'] = {
        'Масло соевое (килограмм)':1 / 10,
        #'_-Потребление пищи (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':99.9,
        '-Углеводы растительные (грамм)':0.0,
        }

metadict_detail['Сок кленовый (100 грамм)'] = {
        'Сок кленовый (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':1.7,
        }

metadict_detail['Сок сахарного тростника (100 грамм)'] = {
        'Сок сахарного тростника (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':10,
        }

metadict_detail['Вёшенки отборные (100 грамм)'] = {
        'Вёшенки отборные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.3,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':4.2,
        }

metadict_detail['Шампиньоны чищеные (100 грамм)'] = {
        'Шампиньоны чищеные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':4.3,
        '-Жиры растительные (грамм)':1.0,
        '-Углеводы растительные (грамм)':1.0,
        }

metadict_detail['Боровики чищеные (100 грамм)'] = {
        'Боровики чищеные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.7,
        '-Жиры растительные (грамм)':1.7,
        '-Углеводы растительные (грамм)':1.1,
        }

metadict_detail['Сморчки отборные (100 грамм)'] = {
        # Канадский Morel Mushroom
        # https://en.wikipedia.org/wiki/Morchella
        'Сморчки отборные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.1,
        '-Жиры растительные (грамм)':0.6,
        '-Углеводы растительные (грамм)':5.1,
        }

metadict_detail['Зелень руколы отборная (100 грамм)'] = {
        'Зелень руколы отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.6,
        '-Жиры растительные (грамм)':0.7,
        '-Углеводы растительные (грамм)':2.1,
        }

metadict_detail['Зелень чабреца отборная (100 грамм)'] = {
        'Зелень чабреца отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':5.6,
        '-Жиры растительные (грамм)':1.7,
        '-Углеводы растительные (грамм)':24.5,
        }

metadict_detail['Бадьян сушёный (100 грамм)'] = {
        'Бадьян сушёный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':18.0,
        '-Жиры растительные (грамм)':16.0,
        '-Углеводы растительные (грамм)':50.0,
        }

metadict_detail['Шафран сушёный (100 грамм)'] = {
        'Шафран сушёный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':11.4,
        '-Жиры растительные (грамм)':5.9,
        '-Углеводы растительные (грамм)':65.4,
        }

metadict_detail['Зелень мелиссы отборная (100 грамм)'] = {
        'Зелень мелиссы отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.7,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':8.0,
        }

metadict_detail['Зелень кервеля отборная (100 грамм)'] = {
        'Зелень кервеля отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.2,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':7.3,
        }

metadict_detail['Зелень базилика отборная (100 грамм)'] = {
        'Зелень базилика отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.5,
        '-Жиры растительные (грамм)':0.6,
        '-Углеводы растительные (грамм)':4.3,
        }

metadict_detail['Орегано сушёный (100 грамм)'] = {
        'Орегано сушёный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':9.0,
        '-Жиры растительные (грамм)':4.3,
        '-Углеводы растительные (грамм)':68.9,
        }

metadict_detail['Зелень петрушки отборная (100 грамм)'] = {
        'Зелень петрушки отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.7,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':7.6,
        }

metadict_detail['Лист хрена отборный (100 грамм)'] = {
        'Лист хрена отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':9.4,
        '-Жиры растительные (грамм)':1.4,
        '-Углеводы растительные (грамм)':6.2,
        }

metadict_detail['Семена подсолнечника (100 грамм)'] = {
        'Семена подсолнечника (килограмм)':1 / 10,
        '-Белки растительные (грамм)':20.8,
        '-Жиры растительные (грамм)':52.9,
        '-Углеводы растительные (грамм)':20.0,
        }

metadict_detail['Семена мака (100 грамм)'] = {
        'Семена мака (килограмм)':1 / 10,
        '-Белки растительные (грамм)':17.6,
        '-Жиры растительные (грамм)':47.3,
        '-Углеводы растительные (грамм)':14.6,
        }

metadict_detail['Семена льна (100 грамм)'] = {
        'Семена льна (килограмм)':1 / 10,
        '-Белки растительные (грамм)':18.3,
        '-Жиры растительные (грамм)':42.2,
        '-Углеводы растительные (грамм)':28.9,
        }

metadict_detail['Семена конопли (100 грамм)'] = {
        'Семена льна (килограмм)':1 / 10,
        '-Белки растительные (грамм)':20.0,
        '-Жиры растительные (грамм)':32.5,
        '-Углеводы растительные (грамм)':14.0,
        }

metadict_detail['Семена аниса (100 грамм)'] = {
        'Семена аниса (килограмм)':1 / 10,
        '-Белки растительные (грамм)':17.6,
        '-Жиры растительные (грамм)':15.9,
        '-Углеводы растительные (грамм)':35.4,
        }

metadict_detail['Семена кардамона (100 грамм)'] = {
        'Семена кардамона (килограмм)':1 / 10,
        '-Белки растительные (грамм)':10.8,
        '-Жиры растительные (грамм)':6.7,
        '-Углеводы растительные (грамм)':68.5,
        }

metadict_detail['Семена кориандра (100 грамм)'] = {
        'Семена кориандра (килограмм)':1 / 10,
        '-Белки растительные (грамм)':12.3,
        '-Жиры растительные (грамм)':17.7,
        '-Углеводы растительные (грамм)':13.3,
        }

metadict_detail['Семена кунжута (100 грамм)'] = {
        'Семена кунжута (килограмм)':1 / 10,
        '-Белки растительные (грамм)':19.4,
        '-Жиры растительные (грамм)':48.7,
        '-Углеводы растительные (грамм)':12.2,
        }

metadict_detail['Зелень кориандра отборная (100 грамм)'] = {
        # Кинза
        'Зелень кориандра отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.1,
        '-Жиры растительные (грамм)':0.5,
        '-Углеводы растительные (грамм)':1.9,
        }

metadict_detail['Зелень мяты отборная (100 грамм)'] = {
        'Зелень мяты отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.7,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':8.0,
        }

metadict_detail['Зелень фенугрека отборная (100 грамм)'] = {
        # Исправить
            # Узнай, уточни
        'Зелень фенугрека отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.1,
        '-Жиры растительные (грамм)':0.5,
        '-Углеводы растительные (грамм)':1.9,
        }

metadict_detail['Семена тмина (100 грамм)'] = {
        'Семена тмина (килограмм)':1 / 10,
        '-Белки растительные (грамм)':19.8,
        '-Жиры растительные (грамм)':14.6,
        '-Углеводы растительные (грамм)':11.9,
        }

metadict_detail['Семена горчицы белой (100 грамм)'] = {
        'Семена горчицы белой (килограмм)':1 / 10,
        '-Белки растительные (грамм)':37.1,
        '-Жиры растительные (грамм)':11.1,
        '-Углеводы растительные (грамм)':32.6,
        }

metadict_detail['Семена горчицы коричневой (100 грамм)'] = {
        'Семена горчицы коричневой (килограмм)':1 / 10,
        '-Белки растительные (грамм)':37.1,
        '-Жиры растительные (грамм)':11.1,
        '-Углеводы растительные (грамм)':32.6,
        }

metadict_detail['Семена зиры (100 грамм)'] = {
        'Семена зиры (килограмм)':1 / 10,
        '-Белки растительные (грамм)':17.8,
        '-Жиры растительные (грамм)':22.3,
        '-Углеводы растительные (грамм)':44.3,
        }

metadict_detail['Семена фенхеля (100 грамм)'] = {
        'Семена фенхеля (килограмм)':1 / 10,
        '-Белки растительные (грамм)':12.3,
        '-Жиры растительные (грамм)':17.7,
        '-Углеводы растительные (грамм)':13.3,
        }

metadict_detail['Семена фенугрека (100 грамм)'] = {
        # Исправить
            # Переименуй в пажитник
        'Семена фенугрека (килограмм)':1 / 10,
        '-Белки растительные (грамм)':23.0,
        '-Жиры растительные (грамм)':6.4,
        '-Углеводы растительные (грамм)':58.3,
        }

metadict_detail['Тимьян сушёный (100 грамм)'] = {
        'Тимьян сушёный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':9.1,
        '-Жиры растительные (грамм)':7.4,
        '-Углеводы растительные (грамм)':26.9,
        }

metadict_detail['Цедра лимонная (100 грамм)'] = {
        'Цедра лимонная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':3.0,
        }

metadict_detail['Лист дуба отборный (100 грамм)'] = {
        'Лист дуба отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.1,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':0.1,
        }

metadict_detail['Лист малины отборный (100 грамм)'] = {
        # Исправить
            # Узнать калорийность
        'Лист малины отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.1,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':0.1,
        }

metadict_detail['Лист рябины отборный (100 грамм)'] = {
        # Исправить
            # Узнать калорийность
        'Лист рябины отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.1,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':0.1,
        }

metadict_detail['Лист шиповника отборный (100 грамм)'] = {
        # Исправить
            # Узнать калорийность
        'Лист шиповника отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.1,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':0.1,
        }

metadict_detail['Лист смородины отборный (100 грамм)'] = {
        'Лист смородины отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.1,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':0.1,
        }

metadict_detail['Лист вишни отборный (100 грамм)'] = {
        'Лист вишни отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.1,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':0.1,
        }

metadict_detail['Лист винограда отборный (100 грамм)'] = {
        'Лист винограда отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.1,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':0.1,
        }

metadict_detail['Лист лавра (100 грамм)'] = {
        # Непросушеный, свежий.
        'Лист лавра (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':1.0,
        '-Углеводы растительные (грамм)':6.1,
        }

metadict_detail['Лист карри (100 грамм)'] = {
        'Лист карри (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.1,
        '-Жиры растительные (грамм)':1.3,
        '-Углеводы растительные (грамм)':3.1,
        }

metadict_detail['Зелень чабера отборная (100 грамм)'] = {
        # Дикорастущая замена чёрного перца
        'Зелень чабера отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.7,
        '-Углеводы растительные (грамм)':8.6,
        }

metadict_detail['Сныть отборная (100 грамм)'] = {
        'Сныть отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.7,
        '-Углеводы растительные (грамм)':8.6,
        }

metadict_detail['Лебеда отборная (100 грамм)'] = {
        'Лебеда отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':4.2,
        '-Жиры растительные (грамм)':0.5,
        '-Углеводы растительные (грамм)':5.2,
        }

metadict_detail['Щавель отборный (100 грамм)'] = {
        'Щавель отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.5,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':2.9,
        }

metadict_detail['Крапива отборная (100 грамм)'] = {
        'Крапива отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.5,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':5.0,
        }

metadict_detail['Черемша отборная (100 грамм)'] = {
        'Черемша отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.4,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':6.5,
        }

metadict_detail['Шпинат отборный (100 грамм)'] = {
        'Шпинат отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.9,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':2.0,
        }

metadict_detail['Зелень сельдерея отборная (100 грамм)'] = {
        'Зелень сельдерея отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':2.1,
        }

metadict_detail['Черешок сельдерея чищеный (100 грамм)'] = {
        'Черешок сельдерея чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':2.1,
        }

metadict_detail['Корень сельдерея чищеный (100 грамм)'] = {
        'Корень сельдерея чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.5,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':9.2,
        }

metadict_detail['Корень куркумы (100 грамм)'] = {
        # Исправить
            # Это сушёный корень.
            # Переименуй в "Куркума сушёная"
        'Корень куркумы (килограмм)':1 / 10,
        '-Белки растительные (грамм)':12.7,
        '-Жиры растительные (грамм)':13.8,
        '-Углеводы растительные (грамм)':58.2,
        }

metadict_detail['Корень пастернака чищеный (100 грамм)'] = {
        'Корень пастернака чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.4,
        '-Жиры растительные (грамм)':0.5,
        '-Углеводы растительные (грамм)':9.2,
        }

metadict_detail['Турнепс чищеный (100 грамм)'] = {
        'Турнепс чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.0,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':6.0,
        }

metadict_detail['Спаржа чищеная (100 грамм)'] = {
        # Спаржа зелёная
        'Спаржа чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.9,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':3.1,
        }

metadict_detail['Лаванда отборная (100 грамм)'] = {
        'Лаванда отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':4.0,
        '-Жиры растительные (грамм)':0.7,
        '-Углеводы растительные (грамм)':0.2,
        }

metadict_detail['Любисток отборный (100 грамм)'] = {
        'Любисток отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.7,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':7.6,
        }

metadict_detail['Зелень эстрагона отборная (100 грамм)'] = {
        'Зелень эстрагона отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.5,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':5.0,
        }

metadict_detail['Ревень отборный (100 грамм)'] = {
        'Ревень отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.7,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':2.5,
        }

metadict_detail['Корень хрена чищеный (100 грамм)'] = {
        'Корень хрена чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.2,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':10.5,
        }

metadict_detail['Корень петрушки чищеный (100 грамм)'] = {
        'Корень петрушки чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.5,
        '-Жиры растительные (грамм)':0.6,
        '-Углеводы растительные (грамм)':10.1,
        }

metadict_detail['Зелень фенхеля отборная (100 грамм)'] = {
        # Исправить
            # Узнать
        'Зелень фенхеля отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.2,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':7.3,
        }

metadict_detail['Зелень укропа отборная (100 грамм)'] = {
        # http://vseoteplicah.ru/wp-content/uploads/2014/05/Tablica-sostava-ukropa.jpg
        'Зелень укропа отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.5,
        '-Жиры растительные (грамм)':0.5,
        '-Углеводы растительные (грамм)':6.3,
        }

metadict_detail['Кофе молотый (100 грамм)'] = {
        'Кофе молотый (килограмм)':1 / 10,
        '-Белки растительные (грамм)':13.9,
        '-Жиры растительные (грамм)':14.4,
        '-Углеводы растительные (грамм)':4.1,
        }

metadict_detail['Солод пшеничный (100 грамм)'] = {
        'Солод пшеничный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':19.2,
        '-Жиры растительные (грамм)':1.2,
        '-Углеводы растительные (грамм)':64.9,
        }

metadict_detail['Солод ржаной (100 грамм)'] = {
        'Солод ржаной (килограмм)':1 / 10,
        '-Белки растительные (грамм)':19.0,
        '-Жиры растительные (грамм)':1.0,
        '-Углеводы растительные (грамм)':61.8,
        }

metadict_detail['Солод ячменный (100 грамм)'] = {
        'Солод ржаной (килограмм)':1 / 10,
        '-Белки растительные (грамм)':10.3,
        '-Жиры растительные (грамм)':1.8,
        '-Углеводы растительные (грамм)':71.2,
        }

metadict_detail['Гвоздика сушёная (100 грамм)'] = {
        'Гвоздика сушёная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':6.0,
        '-Жиры растительные (грамм)':20.1,
        '-Углеводы растительные (грамм)':27.0,
        }

metadict_detail['Перец чёрный сушёный (100 грамм)'] = {
        'Перец чёрный сушёный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':14.7,
        '-Жиры растительные (грамм)':3.0,
        '-Углеводы растительные (грамм)':41.6,
        }

metadict_detail['Перец душистый сушёный (100 грамм)'] = {
        'Перец душистый сушёный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':6.1,
        '-Жиры растительные (грамм)':8.7,
        '-Углеводы растительные (грамм)':50.5,
        }

metadict_detail['Майоран сушёный (100 грамм)'] = {
        'Майоран сушёный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':12.7,
        '-Жиры растительные (грамм)':7.0,
        '-Углеводы растительные (грамм)':60.6,
        }

metadict_detail['Розмарин сушёный (100 грамм)'] = {
        'Розмарин сушёный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':4.8,
        '-Жиры растительные (грамм)':15.2,
        '-Углеводы растительные (грамм)':64.0,
        }

metadict_detail['Шалфей сушёный (100 грамм)'] = {
        'Шалфей сушёный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':10.6,
        '-Жиры растительные (грамм)':12.8,
        '-Углеводы растительные (грамм)':20.4,
        }

metadict_detail['Корица палочкой (100 грамм)'] = {
        'Корица палочкой (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.9,
        '-Жиры растительные (грамм)':3.2,
        '-Углеводы растительные (грамм)':79.8,
        }

metadict_detail['Корень имбиря отборный (100 грамм)'] = {
        'Корень имбиря отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.8,
        '-Жиры растительные (грамм)':0.8,
        '-Углеводы растительные (грамм)':15.8,
        }

metadict_detail['Орех мускатный (100 грамм)'] = {
        'Орех мускатный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':20.0,
        '-Жиры растительные (грамм)':50.0,
        '-Углеводы растительные (грамм)':7.0,
        }

metadict_detail['Цвет мускатный (100 грамм)'] = {
        'Цвет мускатный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':5.0,
        '-Жиры растительные (грамм)':2.7,
        '-Углеводы растительные (грамм)':8.5,
        }

metadict_detail['Орех грецкий чищенный (100 грамм)'] = {
        'Орех грецкий чищенный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':15.2,
        '-Жиры растительные (грамм)':65.2,
        '-Углеводы растительные (грамм)':7.0,
        }

metadict_detail['Орех кешью чищенный (100 грамм)'] = {
        'Орех кешью чищенный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':18.5,
        '-Жиры растительные (грамм)':48.5,
        '-Углеводы растительные (грамм)':22.5,
        }

metadict_detail['Фисташки чищеные (100 грамм)'] = {
        'Фисташки чищеные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':20.3,
        '-Жиры растительные (грамм)':45.4,
        '-Углеводы растительные (грамм)':27.5,
        }

metadict_detail['Орешки кедровые (100 грамм)'] = {
        'Орешки кедровые (килограмм)':1 / 10,
        '-Белки растительные (грамм)':15.6,
        '-Жиры растительные (грамм)':56.0,
        '-Углеводы растительные (грамм)':28.4,
        }

metadict_detail['Каштан чищеный (100 грамм)'] = {
        'Каштан чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.4,
        '-Жиры растительные (грамм)':3.0,
        '-Углеводы растительные (грамм)':30.6,
        }

metadict_detail['Орех карии чищенный (100 грамм)'] = {
        # https://en.wikipedia.org/wiki/Carya_ovalis
        # http://bioimages.vanderbilt.edu/pages/carya-fruits.htm
        'Орех карии чищенный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':12.7,
        '-Жиры растительные (грамм)':64.2,
        '-Углеводы растительные (грамм)':18.3,
        }

metadict_detail['Орех пекана чищенный (100 грамм)'] = {
        # https://en.wikipedia.org/wiki/Pecan
        'Орех пекана чищенный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':9.2,
        '-Жиры растительные (грамм)':72.0,
        '-Углеводы растительные (грамм)':4.3,
        }

metadict_detail['Миндаль чищенный (100 грамм)'] = {
        'Миндаль чищенный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':18.6,
        '-Жиры растительные (грамм)':57.7,
        '-Углеводы растительные (грамм)':16.2,
        }

metadict_detail['Ваниль сушёная (100 грамм)'] = {
        'Ваниль сушёная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.2,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':12.5,
        }

metadict_detail['Сушёные чайные листья (100 грамм)'] = {
        'Сушёные чайные листья (килограмм)':1 / 10,
        '-Белки растительные (грамм)':20.0,
        '-Жиры растительные (грамм)':5.1,
        '-Углеводы растительные (грамм)':6.9,
        }

metadict_detail['Какао-порошок (100 грамм)'] = {
        'Какао-порошок (килограмм)':1 / 10,
        '-Белки растительные (грамм)':24.2,
        '-Жиры растительные (грамм)':17.5,
        '-Углеводы растительные (грамм)':31.9,
        }

metadict_detail['Какао-масло (100 грамм)'] = {
        'Какао-масло (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':99.9,
        '-Углеводы растительные (грамм)':0.0,
        }

metadict_detail['Какао-бобы (100 грамм)'] = {
        'Какао-бобы (килограмм)':1 / 10,
        '-Белки растительные (грамм)':12.6,
        '-Жиры растительные (грамм)':53.1,
        '-Углеводы растительные (грамм)':9.5,
        }

metadict_detail['Арахис сухой (100 грамм)'] = {
        'Арахис сухой (килограмм)':1 / 10,
        '-Белки растительные (грамм)':26.3,
        '-Жиры растительные (грамм)':45.2,
        '-Углеводы растительные (грамм)':9.9,
        }

metadict_detail['Бобы арахиса в шелухе (100 грамм)'] = {
        'Бобы арахиса в шелухе (килограмм)':1 / 10,
        '-Белки растительные (грамм)':26.3,
        '-Жиры растительные (грамм)':45.2,
        '-Углеводы растительные (грамм)':9.9,
        }

metadict_detail['Трава луговая (100 грамм)'] = {
        # Содержание обменной энергии в кормах для крупного рогатого скота
        # Трава естественных угодий -- Суходольного луга
            # http://files.stroyinf.ru/Data2/1/4293764/4293764645.htm
        # Обменная энергия (100 грамм) -- 0.24 МДж (57 килокаллорий из 101 по валовой энергии)
            # То есть усваивается всего 56% питательных веществ.
        'Трава луговая (килограмм)':1 / 10,
        '-Белки растительные для скота (грамм)':3.6 * 0.56,
        '-Жиры растительные для скота (грамм)':1.1 * 0.56,
        '-Углеводы растительные для скота (грамм)':(7.5 + 11.6) * 0.56,
        }

metadict_detail['Трава луговая для овец (100 грамм)'] = {
        # Исправить
            # Уточнить полезную энергию
        'Трава луговая для овец (килограмм)':1 / 10,
        '-Белки растительные для скота (грамм)':3.6 * 0.65,
        '-Жиры растительные для скота (грамм)':1.1 * 0.65,
        '-Углеводы растительные для скота (грамм)':(7.5 + 11.6) * 0.65,
        }

metadict_detail['Сено луговое (100 грамм)'] = {
        # Содержание обменной энергии в кормах для крупного рогатого скота
        # Сено естественных угодий -- Разнотравное
            # http://files.stroyinf.ru/Data2/1/4293764/4293764645.htm
        # Обменная энергия (100 грамм) -- 0.66 МДж (158 килокаллорий из 310 по валовой энергии)
            # То есть усваивается всего 51% питательных веществ.
        'Сено луговое (килограмм)':1 / 10,
        '-Белки растительные для скота (грамм)':8.1 * 0.51,
        '-Жиры растительные для скота (грамм)':1.8 * 0.51,
        '-Углеводы растительные для скота (грамм)':(25.3 + 41.7) * 0.51,
        }

metadict_detail['Зерно пшеницы (100 грамм)'] = {
        'Зерно пшеницы (килограмм)':1 / 10,
        '-Белки растительные (грамм)':13.0,
        '-Жиры растительные (грамм)':2.5,
        '-Углеводы растительные (грамм)':57.5,
        }

metadict_detail['Зерно овса (100 грамм)'] = {
        'Зерно овса (килограмм)':1 / 10,
        '-Белки растительные (грамм)':10.0,
        '-Жиры растительные (грамм)':6.2,
        '-Углеводы растительные (грамм)':55.1,
        }

metadict_detail['Зерно ячменя (100 грамм)'] = {
        'Зерно ячменя (килограмм)':1 / 10,
        '-Белки растительные (грамм)':10.3,
        '-Жиры растительные (грамм)':2.4,
        '-Углеводы растительные (грамм)':56.4,
        }

metadict_detail['Зерно просо (100 грамм)'] = {
        # foxtail millet
        'Зерно просо (килограмм)':1 / 10,
        '-Белки растительные (грамм)':10.5,
        '-Жиры растительные (грамм)':2.7,
        '-Углеводы растительные (грамм)':53.1,
        }

metadict_detail['Зерно ржи (100 грамм)'] = {
        'Зерно ржи (килограмм)':1 / 10,
        '-Белки растительные (грамм)':9.9,
        '-Жиры растительные (грамм)':2.2,
        '-Углеводы растительные (грамм)':55.8,
        }

metadict_detail['Мука ячменная (100 грамм)'] = {
        'Мука ячменная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':10.0,
        '-Жиры растительные (грамм)':1.6,
        '-Углеводы растительные (грамм)':56.1,
        }

metadict_detail['Мука пшеничная (100 грамм)'] = {
        'Мука пшеничная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':9.2,
        '-Жиры растительные (грамм)':1.2,
        '-Углеводы растительные (грамм)':74.9,
        }

metadict_detail['Мука ржаная (100 грамм)'] = {
        'Мука ржаная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':9.0,
        '-Жиры растительные (грамм)':1.0,
        '-Углеводы растительные (грамм)':73.0,
        }

metadict_detail['Мука овсяная (100 грамм)'] = {
        'Мука овсяная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':13.0,
        '-Жиры растительные (грамм)':6.8,
        '-Углеводы растительные (грамм)':64.9,
        }

metadict_detail['Мука соевая (100 грамм)'] = {
        'Мука соевая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':36.5,
        '-Жиры растительные (грамм)':18.6,
        '-Углеводы растительные (грамм)':17.9,
        }

metadict_detail['Мука гороховая (100 грамм)'] = {
        'Мука гороховая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':20.5,
        '-Жиры растительные (грамм)':2.0,
        '-Углеводы растительные (грамм)':53.3,
        }

metadict_detail['Мука чечевичная (100 грамм)'] = {
        'Мука гороховая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':24.0,
        '-Жиры растительные (грамм)':1.5,
        '-Углеводы растительные (грамм)':42.7,
        }

metadict_detail['Мука рисовая (100 грамм)'] = {
        'Мука рисовая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':6.7,
        '-Жиры растительные (грамм)':0.7,
        '-Углеводы растительные (грамм)':78.9,
        }

metadict_detail['Мука гречневая (100 грамм)'] = {
        'Мука гречневая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':16.6,
        '-Жиры растительные (грамм)':2.6,
        '-Углеводы растительные (грамм)':68.0,
        }

metadict_detail['Мука льняная (100 грамм)'] = {
        'Мука льняная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':36.0,
        '-Жиры растительные (грамм)':10.0,
        '-Углеводы растительные (грамм)':9.0,
        }

metadict_detail['Мука просяная (100 грамм)'] = {
        'Мука просяная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':10.3,
        '-Жиры растительные (грамм)':1.0,
        '-Углеводы растительные (грамм)':76.3,
        }

metadict_detail['Мука кукурузная (100 грамм)'] = {
        'Мука кукурузная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':8.3,
        '-Жиры растительные (грамм)':1.2,
        '-Углеводы растительные (грамм)':75,
        }

metadict_detail['Сахар-сырец тростниковый (100 грамм)'] = {
        # Исправить
            # Уточнить влажность
        'Сахар-сырец тростниковый (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.2,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':95.5,
        }

metadict_detail['Сахар тростниковый (100 грамм)'] = {
        'Сахар тростниковый (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':99.4,
        }

metadict_detail['Сахар-песок (100 грамм)'] = {
        'Сахар-песок (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':99.4,
        }

metadict_detail['Патока чёрная (100 грамм)'] = {
        'Патока чёрная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':74.7,
        }

metadict_detail['Зерно кукурузы (100 грамм)'] = {
        'Зерно кукурузы (килограмм)':1 / 10,
        '-Белки растительные (грамм)':8.3,
        '-Жиры растительные (грамм)':1.2,
        '-Углеводы растительные (грамм)':75,
        }

metadict_detail['Крупа кукурузная (100 грамм)'] = {
        'Крупа кукурузная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':8.3,
        '-Жиры растительные (грамм)':1.2,
        '-Углеводы растительные (грамм)':75,
        }

metadict_detail['Продел гречневый (100 грамм)'] = {
        'Продел гречневый (килограмм)':1 / 10,
        '-Белки растительные (грамм)':12.6,
        '-Жиры растительные (грамм)':3.3,
        '-Углеводы растительные (грамм)':62.1,
        }

metadict_detail['Крупа гречневая (100 грамм)'] = {
        'Крупа гречневая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':12.6,
        '-Жиры растительные (грамм)':3.3,
        '-Углеводы растительные (грамм)':62.1,
        }

metadict_detail['Крупа пшённая (100 грамм)'] = {
        'Крупа пшённая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':11.5,
        '-Жиры растительные (грамм)':3.3,
        '-Углеводы растительные (грамм)':69.3,
        }

metadict_detail['Зерно риса посевного (100 грамм)'] = {
        'Зерно риса посевного (килограмм)':1 / 10,
        '-Белки растительные (грамм)':7.5,
        '-Жиры растительные (грамм)':2.6,
        '-Углеводы растительные (грамм)':62.3,
        }

metadict_detail['Рис нешлифованный (100 грамм)'] = {
        'Рис нешлифованный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':6.7,
        '-Жиры растительные (грамм)':0.7,
        '-Углеводы растительные (грамм)':78.9,
        }

metadict_detail['Крупа ячневая (100 грамм)'] = {
        'Крупа ячневая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':10.4,
        '-Жиры растительные (грамм)':1.3,
        '-Углеводы растительные (грамм)':66.3,
        }

metadict_detail['Крупа перловая (100 грамм)'] = {
        'Крупа перловая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':9.3,
        '-Жиры растительные (грамм)':1.1,
        '-Углеводы растительные (грамм)':68.3,
        }

metadict_detail['Крупа пшеничная (100 грамм)'] = {
        'Крупа пшеничная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':13.0,
        '-Жиры растительные (грамм)':2.5,
        '-Углеводы растительные (грамм)':57.5,
        }

metadict_detail['Крупа овсяная (100 грамм)'] = {
        'Крупа овсяная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':12.3,
        '-Жиры растительные (грамм)':6.1,
        '-Углеводы растительные (грамм)':59.5,
        }

metadict_detail['Крахмал (100 грамм)'] = {
        'Крахмал (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.1,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':79.6,
        }

metadict_detail['Крахмал картофельный (100 грамм)'] = {
        'Крахмал картофельный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.1,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':79.6,
        }

metadict_detail['Соя сухая шлифованная (100 грамм)'] = {
        'Соя сухая шлифованная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':34.9,
        '-Жиры растительные (грамм)':17.3,
        '-Углеводы растительные (грамм)':17.3,
        }

metadict_detail['Ростки соевые (100 грамм)'] = {
        'Ростки соевые (килограмм)':1 / 10,
        '-Белки растительные (грамм)':13.1,
        '-Жиры растительные (грамм)':6.7,
        '-Углеводы растительные (грамм)':9.6,
        }

metadict_detail['Фасоль стручковая отборная (100 грамм)'] = {
        'Фасоль стручковая отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.0,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':3.6,
        }

metadict_detail['Фасоль сухая (100 грамм)'] = {
        'Фасоль сухая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':21.1,
        '-Жиры растительные (грамм)':1.2,
        '-Углеводы растительные (грамм)':41.4,
        }

metadict_detail['Нут сухой (100 грамм)'] = {
        'Нут сухой (килограмм)':1 / 10,
        '-Белки растительные (грамм)':20.1,
        '-Жиры растительные (грамм)':4.3,
        '-Углеводы растительные (грамм)':46.2,
        }

metadict_detail['Горох сухой (100 грамм)'] = {
        'Горох сухой (килограмм)':1 / 10,
        '-Белки растительные (грамм)':20.5,
        '-Жиры растительные (грамм)':2.0,
        '-Углеводы растительные (грамм)':53.3,
        }

metadict_detail['Горошек зелёный (100 грамм)'] = {
        'Горошек зелёный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':5.0,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':13.8,
        }

metadict_detail['Фасоль свежая (100 грамм)'] = {
        'Фасоль свежая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':6.7,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':17.4,
        }

metadict_detail['Чечевица сухая (100 грамм)'] = {
        # Чечевица чёрная
        'Чечевица сухая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':24.0,
        '-Жиры растительные (грамм)':1.5,
        '-Углеводы растительные (грамм)':42.7,
        }

metadict_detail['Урд сухой (100 грамм)'] = {
        # https://en.wikipedia.org/wiki/Vigna_mungo
        'Урд сухой (килограмм)':1 / 10,
        '-Белки растительные (грамм)':25.2,
        '-Жиры растительные (грамм)':1.6,
        '-Углеводы растительные (грамм)':40.7,
        }

metadict_detail['Арбуз чищеный (100 грамм)'] = {
        'Арбуз чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.6,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':5.8,
        }

metadict_detail['Гранат отборный (100 грамм)'] = {
        'Гранат чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':13.9,
        }

metadict_detail['Гранат чищеный (100 грамм)'] = {
        'Гранат чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':13.9,
        }

metadict_detail['Манго чищенный местный (100 грамм)'] = {
        'Манго чищенный местный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.5,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':15.2,
        }

metadict_detail['Манго чищенный импортный (100 грамм)'] = {
        'Манго чищенный импортный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.5,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':15.2,
        }

metadict_detail['Авокадо чищенный местный (100 грамм)'] = {
        'Авокадо чищенный местный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.0,
        '-Жиры растительные (грамм)':20.0,
        '-Углеводы растительные (грамм)':6.0,
        }

metadict_detail['Авокадо чищенный импортный (100 грамм)'] = {
        'Авокадо чищенный импортный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.0,
        '-Жиры растительные (грамм)':20.0,
        '-Углеводы растительные (грамм)':6.0,
        }

metadict_detail['Банан чищенный местный (100 грамм)'] = {
        'Банан чищенный местный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.5,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':21.8,
        }

metadict_detail['Банан чищенный импортный (100 грамм)'] = {
        'Банан чищенный импортный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.5,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':21.8,
        }

metadict_detail['Дыня чищеная (100 грамм)'] = {
        'Дыня чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.6,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':7.4,
        }

metadict_detail['Яблоко чищеное (100 грамм)'] = {
        # Антоновка
        # http://findfood.ru/product/jabloki-antonovka
        'Яблоко чищеное (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.3,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':11.5,
        }

metadict_detail['Мезга яблочная чистая (100 грамм)'] = {
        # Чищенные и отжатые яблоки. Сок пьют, а мезгу на пастилу.
        'Мезга яблочная чистая (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.3,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':11.5,
        }

metadict_detail['Яблоко отборное (100 грамм)'] = {
        # Исправить
            # Так-то это яблоко с учётом семечек
            # Но всё равно дублировать нехорошо.
        'Яблоко отборное (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.3,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':11.5,
        }

metadict_detail['Груша чищеная (100 грамм)'] = {
        'Груша чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.4,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':10.9,
        }

metadict_detail['Груша отборная (100 грамм)'] = {
        'Груша отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.4,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':10.9,
        }

metadict_detail['Вишня отборная (100 грамм)'] = {
        'Вишня отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.5,
        '-Углеводы растительные (грамм)':11.3,
        }

metadict_detail['Персик отборный (100 грамм)'] = {
        'Персик отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':9.5,
        }

metadict_detail['Абрикос отборный (100 грамм)'] = {
        'Абрикос отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':9.0,
        }

metadict_detail['Алыча отборная (100 грамм)'] = {
        'Алыча отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.2,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':6.9,
        }

metadict_detail['Слива отборная (100 грамм)'] = {
        'Слива отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':9.6,
        }

metadict_detail['Слива чищеная (100 грамм)'] = {
        'Слива чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':9.6,
        }

metadict_detail['Брокколи чищеная (100 грамм)'] = {
        # Исправить
            # Очень уж калорийно получается для капусты.
        'Брокколи чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.0,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':5.2,
        }

metadict_detail['Ромашка отборная (100 грамм)'] = {
        # Исправить
            # Узнать
        'Ромашка отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.0,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':0.0,
        }

metadict_detail['Кипрей отборный (100 грамм)'] = {
        'Кипрей отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':5.0,
        '-Жиры растительные (грамм)':2.7,
        '-Углеводы растительные (грамм)':8.5,
        }

metadict_detail['Клевер отборный (100 грамм)'] = {
        'Клевер отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.0,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':5.0,
        }

metadict_detail['Иссоп отборный (100 грамм)'] = {
        # Исправить
            # Узнать
        'Иссоп отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.0,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':5.0,
        }

metadict_detail['Одуванчик чищеный (100 грамм)'] = {
        'Одуванчик чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.7,
        '-Жиры растительные (грамм)':0.7,
        '-Углеводы растительные (грамм)':6.7,
        }

metadict_detail['Батат чищеный (100 грамм)'] = {
        'Батат чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.6,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':16.9,
        }

metadict_detail['Топинамбур чищеный (100 грамм)'] = {
        'Топинамбур чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.1,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':12.8,
        }

metadict_detail['Картофель чищеный (100 грамм)'] = {
        'Картофель чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.0,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':16.1,
        }

metadict_detail['Морковь чищеная (100 грамм)'] = {
        'Морковь чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.3,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':6.9,
        }

metadict_detail['Лук чищеный (100 грамм)'] = {
        'Лук чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.4,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':10.4,
        }

metadict_detail['Луковица фенхеля чищеная (100 грамм)'] = {
        'Луковица фенхеля чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.2,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':7.3,
        }

metadict_detail['Зелень лука отборная (100 грамм)'] = {
        'Зелень лука отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.3,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':4.6,
        }

metadict_detail['Чеснок чищеный (100 грамм)'] = {
        'Чеснок чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':6.5,
        '-Жиры растительные (грамм)':0.5,
        '-Углеводы растительные (грамм)':29.9,
        }

metadict_detail['Репа чищеная (100 грамм)'] = {
        'Репа чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.5,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':6.2,
        }

metadict_detail['Редис чищеный (100 грамм)'] = {
        'Редис чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.2,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':3.4,
        }

metadict_detail['Редька чищеная (100 грамм)'] = {
        # Редька чёрная
        'Редька чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.9,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':6.7,
        }

metadict_detail['Брюква чищеная (100 грамм)'] = {
        'Брюква чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.2,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':7.7,
        }

metadict_detail['Свёкла чищеная (100 грамм)'] = {
        'Свёкла чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.8,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':10.8,
        }

metadict_detail['Ботва свекольная отборная (100 грамм)'] = {
        'Ботва свекольная отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.2,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':4.3,
        }

metadict_detail['Ботва морковная отборная (100 грамм)'] = {
        'Ботва морковная отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.6,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':5.3,
        }

metadict_detail['Тыква чищеная (100 грамм)'] = {
        'Тыква чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.3,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':7.7,
        }

metadict_detail['Томаты отборные (100 грамм)'] = {
        'Томаты отборные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.1,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':3.7,
        }

metadict_detail['Томаты чищеные (100 грамм)'] = {
        'Томаты чищеные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.1,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':3.7,
        }

metadict_detail['Оливки чищеные (100 грамм)'] = {
        'Оливки чищеные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.3,
        '-Жиры растительные (грамм)':15.3,
        '-Углеводы растительные (грамм)':3.8,
        }

metadict_detail['Каперсы отборные (100 грамм)'] = {
        'Каперсы отборные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':2.6,
        }

metadict_detail['Баклажан чищеный (100 грамм)'] = {
        'Баклажан чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.2,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':4.5,
        }

metadict_detail['Кабачок чищеный (100 грамм)'] = {
        # Цуккини
        'Кабачок чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.5,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':3.0,
        }

metadict_detail['Огурцы отборные (100 грамм)'] = {
        'Огурцы отборные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':2.8,
        }

metadict_detail['Огурцы чищеные (100 грамм)'] = {
        'Огурцы чищеные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':2.8,
        }

metadict_detail['Зелень кресса отборная (100 грамм)'] = {
        'Зелень кресса отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.3,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':1.3,
        }

metadict_detail['Салат-латук отборный (100 грамм)'] = {
        'Салат-латук отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.2,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':1.3,
        }

metadict_detail['Артишоки отборные (100 грамм)'] = {
        'Артишоки отборные (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.9,
        '-Жиры растительные (грамм)':0.3,
        '-Углеводы растительные (грамм)':11.4,
        }

metadict_detail['Морская капуста отборная (100 грамм)'] = {
        'Морская капуста отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':3.0,
        }

metadict_detail['Капуста чищеная (100 грамм)'] = {
        'Капуста чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.8,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':4.7,
        }

metadict_detail['Перец острый отборный (100 грамм)'] = {
        'Перец острый отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.9,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':7.3,
        }

metadict_detail['Перец сладкий чищеный (100 грамм)'] = {
        'Перец сладкий чищеный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.3,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':5.3,
        }

metadict_detail['Перец нежгучий отборный (100 грамм)'] = {
        'Перец нежгучий отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.8,
        '-Жиры растительные (грамм)':1.6,
        '-Углеводы растительные (грамм)':4.4,
        }

metadict_detail['Лимон отборный (100 грамм)'] = {
        'Лимон отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':3.0,
        }

metadict_detail['Лимон отборный импортный (100 грамм)'] = {
        'Лимон отборный импортный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.9,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':3.0,
        }

metadict_detail['Инжир отборный (100 грамм)'] = {
        'Инжир отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.7,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':13.7,
        }

metadict_detail['Виноград отборный (100 грамм)'] = {
        'Виноград отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.6,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':16.8,
        }

metadict_detail['Черника отборная (100 грамм)'] = {
        'Черника отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.1,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':7.6,
        }

metadict_detail['Земляника отборная (100 грамм)'] = {
        'Земляника отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':7.5,
        }

metadict_detail['Малина отборная (100 грамм)'] = {
        'Малина отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.5,
        '-Углеводы растительные (грамм)':8.3,
        }

metadict_detail['Морошка отборная (100 грамм)'] = {
        'Морошка отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.8,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':9.8,
        }

metadict_detail['Крыжовник отборный (100 грамм)'] = {
        'Крыжовник отборный (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.7,
        '-Жиры растительные (грамм)':0.2,
        '-Углеводы растительные (грамм)':9.1,
        }

metadict_detail['Смородина отборная (100 грамм)'] = {
        'Смородина отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.0,
        '-Жиры растительные (грамм)':0.4,
        '-Углеводы растительные (грамм)':7.3,
        }

metadict_detail['Клюква отборная (100 грамм)'] = {
        'Клюква отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':0.5,
        '-Жиры растительные (грамм)':0.0,
        '-Углеводы растительные (грамм)':6.8,
        }

metadict_detail['Рябина отборная (100 грамм)'] = {
        'Рябина отборная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':1.5,
        '-Жиры растительные (грамм)':0.1,
        '-Углеводы растительные (грамм)':10.9,
        }

metadict_detail['Шиповник отборный (100 грамм)'] = {
        # Исправить
            # Узнай калорийность.
        'Шиповник отборный (килограмм)':1 / 10,
        #'-Белки растительные (грамм)':1.5,
        #'-Жиры растительные (грамм)':0.1,
        #'-Углеводы растительные (грамм)':10.9,
        }

metadict_detail['Кукуруза чищеная (100 грамм)'] = {
        # Молодая, сладкая кукуруза.
        'Кукуруза чищеная (килограмм)':1 / 10,
        '-Белки растительные (грамм)':3.5,
        '-Жиры растительные (грамм)':2.8,
        '-Углеводы растительные (грамм)':15.6,
        }

metadict_detail['Финики без косточек (100 грамм)'] = {
        'Финики без косточек (килограмм)':1 / 10,
        '-Белки растительные (грамм)':2.5,
        '-Жиры растительные (грамм)':0.5,
        '-Углеводы растительные (грамм)':69.2,
        }

#----
# Пища животная (100 грамм --> килограмм):

metadict_detail['Мёд луговой (100 грамм)'] = {
        'Мёд луговой (килограмм)':1 / 10,
        '-Белки животные (грамм)':0.8,
        '-Жиры животные (грамм)':0.0,
        '-Углеводы животные (грамм)':81.6,
        }

metadict_detail['Молоко козье (100 грамм)'] = {
        'Молоко козье (килограмм)':1 / 10,
        '-Белки животные (грамм)':3.6,
        '-Жиры животные (грамм)':3.3,
        '-Углеводы животные (грамм)':4.8,
        }

metadict_detail['Молоко овечье (100 грамм)'] = {
        'Молоко овечье (килограмм)':1 / 10,
        '-Белки животные (грамм)':6.5,
        '-Жиры животные (грамм)':7.7,
        '-Углеводы животные (грамм)':4.8,
        }

metadict_detail['Молоко коровье (100 грамм)'] = {
        'Молоко коровье (килограмм)':1 / 10,
        '-Белки животные (грамм)':2.9,
        '-Жиры животные (грамм)':4.2,
        '-Углеводы животные (грамм)':4.7,
        }

metadict_detail['Молоко коровье снятое (100 грамм)'] = {
        # После отделения сливок, 1% жирность
        'Молоко коровье снятое (килограмм)':1 / 10,
        '-Белки животные (грамм)':2.9,
        '-Жиры животные (грамм)':1.0,
        '-Углеводы животные (грамм)':4.7,
        }

metadict_detail['Пахта сливочная коровья (100 грамм)'] = {
        'Пахта сливочная коровья (килограмм)':1 / 10,
        '-Белки животные (грамм)':3.3,
        '-Жиры животные (грамм)':0.5,
        '-Углеводы животные (грамм)':4.7,
        }

metadict_detail['Сыворотка творожная коровья (100 грамм)'] = {
        'Сыворотка творожная коровья (килограмм)':1 / 10,
        '-Белки животные (грамм)':0.8,
        '-Жиры животные (грамм)':0.2,
        '-Углеводы животные (грамм)':4.7,
        }

metadict_detail['Сыворотка творожная овечья (100 грамм)'] = {
        # Исправить
            # Уточнить
            # Пока что оценочно, по отходам сыроделия.
        'Сыворотка творожная овечья (килограмм)':1 / 10,
        '-Белки животные (грамм)':1.9,
        '-Жиры животные (грамм)':1.5,
        '-Углеводы животные (грамм)':4.8,
        }

metadict_detail['Курица филе (100 грамм)'] = {
        # Исправить
            # Это тощие, неоткормленные куры
        'Курица филе (килограмм)':1 / 10,
        '-Белки животные (грамм)':16.0,
        '-Жиры животные (грамм)':14.0,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Говядина вырезка (100 грамм)'] = {
        # https://cross.expert/zdorovoe-pitanie/produkty-pitaniya/govyadina.html
        'Говядина вырезка (килограмм)':1 / 10,
        '-Белки животные (грамм)':23.5,
        '-Жиры животные (грамм)':7.7,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Телятина вырезка (100 грамм)'] = {
        'Телятина вырезка (килограмм)':1 / 10,
        '-Белки животные (грамм)':20.2,
        '-Жиры животные (грамм)':2.8,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Баранина вырезка (100 грамм)'] = {
        'Баранина вырезка (килограмм)':1 / 10,
        '-Белки животные (грамм)':15.6,
        '-Жиры животные (грамм)':16.3,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Жир бараний курдючный (100 грамм)'] = {
        'Жир бараний курдючный (килограмм)':1 / 10,
        '-Белки животные (грамм)':2.4,
        '-Жиры животные (грамм)':89.0,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Белуга филе (100 грамм)'] = {
        'Белуга филе (килограмм)':1 / 10,
        '-Белки животные (грамм)':17.5,
        '-Жиры животные (грамм)':2.0,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Форель филе (100 грамм)'] = {
        'Форель филе (килограмм)':1 / 10,
        '-Белки животные (грамм)':19.2,
        '-Жиры животные (грамм)':2.1,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Осётр филе (100 грамм)'] = {
        'Осётр филе (килограмм)':1 / 10,
        '-Белки животные (грамм)':16.4,
        '-Жиры животные (грамм)':10.9,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Севрюга филе (100 грамм)'] = {
        'Севрюга филе (килограмм)':1 / 10,
        '-Белки животные (грамм)':16.9,
        '-Жиры животные (грамм)':10.3,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Яйцо куриное белок (100 грамм)'] = {
        'Яйцо куриное белок (килограмм)':1 / 10,
        '-Белки животные (грамм)':11.1,
        '-Жиры животные (грамм)':0.0,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Яйцо куриное желток (100 грамм)'] = {
        'Яйцо куриное желток (килограмм)':1 / 10,
        '-Белки животные (грамм)':16.2,
        '-Жиры животные (грамм)':31.2,
        '-Углеводы животные (грамм)':1.0,
        }

metadict_detail['Яйцо куриное (100 грамм)'] = {
        'Яйцо куриное (килограмм)':1 / 10,
        '-Белки животные (грамм)':12.7,
        '-Жиры животные (грамм)':10.9,
        '-Углеводы животные (грамм)':0.7,
        }

metadict_detail['Бульон мясной бараний (100 грамм)'] = {
        'Бульон мясной бараний (килограмм)':1 / 10,
        '-Белки животные (грамм)':0.6,
        '-Жиры животные (грамм)':0.2,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Бульон мясной говяжий (100 грамм)'] = {
        'Бульон мясной говяжий (килограмм)':1 / 10,
        '-Белки животные (грамм)':0.6,
        '-Жиры животные (грамм)':0.2,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Бульон мясной куриный (100 грамм)'] = {
        'Бульон мясной куриный (килограмм)':1 / 10,
        '-Белки животные (грамм)':2.0,
        '-Жиры животные (грамм)':0.5,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Диафрагма баранья чищенная (100 грамм)'] = {
        'Диафрагма баранья чищенная (килограмм)':1 / 10,
        '-Белки животные (грамм)':13.5,
        '-Жиры животные (грамм)':3.5,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Лёгкие бараньи чищенные (100 грамм)'] = {
        'Лёгкие бараньи чищенные (килограмм)':1 / 10,
        '-Белки животные (грамм)':15.6,
        '-Жиры животные (грамм)':2.3,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Печень баранья чищенная (100 грамм)'] = {
        'Печень баранья чищенная (килограмм)':1 / 10,
        '-Белки животные (грамм)':18.7,
        '-Жиры животные (грамм)':2.9,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Почки бараньи чищенные (100 грамм)'] = {
        'Почки бараньи чищенные (килограмм)':1 / 10,
        '-Белки животные (грамм)':13.6,
        '-Жиры животные (грамм)':2.5,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Рубец бараний чищенный (100 грамм)'] = {
        'Рубец бараний чищенный (килограмм)':1 / 10,
        '-Белки животные (грамм)':11.5,
        '-Жиры животные (грамм)':4.0,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Селезёнка баранья чищенная (100 грамм)'] = {
        'Селезёнка баранья чищенная (килограмм)':1 / 10,
        '-Белки животные (грамм)':11.5,
        '-Жиры животные (грамм)':4.0,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Сердце баранье чищенное (100 грамм)'] = {
        'Сердце баранье чищенное (килограмм)':1 / 10,
        '-Белки животные (грамм)':13.5,
        '-Жиры животные (грамм)':3.5,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Кости бараньи (100 грамм)'] = {
        'Кости бараньи (килограмм)':1 / 10,
        '-Белки животные (грамм)':5.1,
        '-Жиры животные (грамм)':2.8,
        '-Углеводы животные (грамм)':0.1,
        }

metadict_detail['Кости говяжьи (100 грамм)'] = {
        'Кости говяжьи (килограмм)':1 / 10,
        '-Белки животные (грамм)':5.1,
        '-Жиры животные (грамм)':2.8,
        '-Углеводы животные (грамм)':0.1,
        }

metadict_detail['Вымя говяжье чищенное (100 грамм)'] = {
        'Вымя говяжье чищенное (килограмм)':1 / 10,
        '-Белки животные (грамм)':12.3,
        '-Жиры животные (грамм)':13.7,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Диафрагма говяжья чищенная (100 грамм)'] = {
        'Диафрагма говяжья чищенная (килограмм)':1 / 10,
        '-Белки животные (грамм)':13.5,
        '-Жиры животные (грамм)':3.5,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Книжка говяжья чищенная (100 грамм)'] = {
        'Книжка говяжья чищенная (килограмм)':1 / 10,
        '-Белки животные (грамм)':14.8,
        '-Жиры животные (грамм)':4.2,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Лёгкие говяжьи чищенные (100 грамм)'] = {
        'Лёгкие говяжьи чищенные (килограмм)':1 / 10,
        '-Белки животные (грамм)':16.2,
        '-Жиры животные (грамм)':2.5,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Ноги говяжьи чищенные (100 грамм)'] = {
        'Ноги говяжьи чищенные (килограмм)':1 / 10,
        '-Белки животные (грамм)':25.0,
        '-Жиры животные (грамм)':6.6,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Печень говяжья чищенная (100 грамм)'] = {
        'Печень говяжья чищенная (килограмм)':1 / 10,
        '-Белки животные (грамм)':20.0,
        '-Жиры животные (грамм)':3.1,
        '-Углеводы животные (грамм)':4.0,
        }

metadict_detail['Почки говяжьи чищенные (100 грамм)'] = {
        'Почки говяжьи чищенные (килограмм)':1 / 10,
        '-Белки животные (грамм)':15.2,
        '-Жиры животные (грамм)':2.8,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Рубец говяжий чищенный (100 грамм)'] = {
        'Рубец говяжий чищенный (килограмм)':1 / 10,
        '-Белки животные (грамм)':14.8,
        '-Жиры животные (грамм)':4.2,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Селезёнка говяжья чищенная (100 грамм)'] = {
        'Селезёнка говяжья чищенная (килограмм)':1 / 10,
        '-Белки животные (грамм)':16.4,
        '-Жиры животные (грамм)':2.4,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Сердце говяжье чищенное (100 грамм)'] = {
        'Сердце говяжье чищенное (килограмм)':1 / 10,
        '-Белки животные (грамм)':16.0,
        '-Жиры животные (грамм)':3.6,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Сычуг говяжий чищенный (100 грамм)'] = {
        'Сычуг говяжий чищенный (килограмм)':1 / 10,
        '-Белки животные (грамм)':14.8,
        '-Жиры животные (грамм)':4.2,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Хвост говяжий чищенный (100 грамм)'] = {
        'Хвост говяжий чищенный (килограмм)':1 / 10,
        '-Белки животные (грамм)':19.7,
        '-Жиры животные (грамм)':6.5,
        '-Углеводы животные (грамм)':0.0,
        }

metadict_detail['Уши говяжьи чищенные (100 грамм)'] = {
        'Уши говяжьи чищенные (килограмм)':1 / 10,
        '-Белки животные (грамм)':25.2,
        '-Жиры животные (грамм)':2.3,
        '-Углеводы животные (грамм)':0.0,
        }
