#----
# Травяные сборы для чаёв:

metadict_detail['Травяной сбор (килограмм)'] = {
        # Исправить
            # Раздели на ароматические, лечебные и окрашивающие травы.
        # Для самых разных чаёв.
        'Одуванчик сушёный (грамм)':1000 / 27,
        'Зверобой сушёный (грамм)':1000 / 27,
        'Зелень эстрагона сушёная (грамм)':1000 / 27,
        'Розмарин сушёный (грамм)':1000 / 27,
        'Ромашка сушёная (грамм)':1000 / 27,
        'Таволга сушёная (грамм)':1000 / 27,
        'Крапива сушёная (грамм)':1000 / 27,
        'Лаванда сушёная (грамм)':1000 / 27,
        'Орегано сушёный (грамм)':1000 / 27,
        'Зелень чабреца сушёная (грамм)':1000 / 27,
        'Кипрей сушёный (грамм)':1000 / 27,
        'Клевер сушёный (грамм)':1000 / 27,
        'Шалфей сушёный (грамм)':1000 / 27,
        'Иссоп сушёный (грамм)':1000 / 27,
        'Зелень мяты сушёная (грамм)':1000 / 27,
        'Тимьян сушёный (грамм)':1000 / 27,
        'Мелисса сушёная (грамм)':1000 / 27,
        'Смородина сушёная (грамм)':1000 / 27,
        'Шиповник сушёный (грамм)':1000 / 27,
        'Малина сушёная (грамм)':1000 / 27,
        'Рябина сушёная (грамм)':1000 / 27,
        'Зелень фенхеля сушёная (грамм)':1000 / 27,
        'Лист смородины сушёный (грамм)':1000 / 27,
        'Лист шиповника сушёный (грамм)':1000 / 27,
        'Лист малины сушёный (грамм)':1000 / 27,
        'Лист рябины сушёный (грамм)':1000 / 27,
        'Лист вишни сушёный (грамм)':1000 / 27,
        }

#----
# Ароматизированные масла:

metadict_detail['Масло ароматизированное для щей (килограмм)'] = {
        'Масло льняное (грамм)':750,
        'Семена аниса (грамм)':50,
        'Семена фенхеля (грамм)':50,
        'Семена кориандра (грамм)':50,
        'Зелень укропа сушёная (грамм)':50,
        'Зелень петрушки сушёная (грамм)':50,
        }

metadict_detail['Масло ароматизированное для палак панира (килограмм)'] = {
        'Масло оливковое (грамм)':700,
        'Семена зиры (грамм)':50,
        'Корень имбиря шинкованный (грамм)':50,
        'Чеснок сушёный (грамм)':50,
        'Корень куркумы (грамм)':50,
        'Зелень фенугрека сушёная (грамм)':50,
        'Пряности гарам масала (грамм)':50,
        }

metadict_detail['Масло ароматизированное для картофеля v1 (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Семена зиры (грамм)':40,
        'Корень имбиря шинкованный (грамм)':35,
        'Чеснок сушёный (грамм)':35,
        'Семена кориандра (грамм)':35,
        'Корень куркумы (грамм)':35,
        'Перец острый сушёный (грамм)':35,
        'Пряности гарам масала (грамм)':35,
        }

metadict_detail['Масло ароматизированное для картофеля v2 (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Семена зиры (грамм)':35,
        'Корень имбиря шинкованный (грамм)':35,
        'Корень куркумы (грамм)':30,
        'Семена фенхеля (грамм)':15,
        'Семена кориандра (грамм)':25,
        'Семена горчицы коричневой (грамм)':25,
        'Пряности гарам масала (грамм)':35,
        'Зелень фенугрека сушёная (грамм)':50,
        }

metadict_detail['Масло ароматизированное для запекания картофеля (килограмм)'] = {
        'Масло арахисовое (грамм)':750,
        'Пряности для овощей из трёх растений (грамм)':150,
        'Пряности нежного карри (грамм)':100,
        }

metadict_detail['Масло ароматизированное для бобов v1 (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Семена зиры (грамм)':50,
        'Корень имбиря шинкованный (грамм)':50,
        'Чеснок сушёный (грамм)':50,
        'Семена кориандра (грамм)':50,
        'Пряности гарам масала (грамм)':50,
        }

metadict_detail['Масло ароматизированное для бобов v2 (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Корень имбиря шинкованный (грамм)':50,
        'Семена зиры (грамм)':25,
        'Перец острый сушёный (грамм)':25,
        'Семена горчицы коричневой (грамм)':25,
        'Пряности самбар масала (грамм)':125,
        }

metadict_detail['Масло ароматизированное перечно-имбирное для жарения (килограмм)'] = {
        'Масло арахисовое (грамм)':750,
        'Перец душистый сушёный (грамм)':150,
        'Перец острый сушёный (грамм)':100,
        'Корень имбиря шинкованный (грамм)':50,
        }

metadict_detail['Масло ароматизированное горчицей для жарения (килограмм)'] = {
        'Масло арахисовое (грамм)':750,
        'Семена горчицы коричневой (грамм)':250,
        }

metadict_detail['Масло ароматизированное для тушения овощей (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Порошок горчичный (грамм)':40,
        'Семена зиры (грамм)':40,
        'Корень имбиря шинкованный (грамм)':30,
        'Корень куркумы (грамм)':20,
        'Семена фенхеля (грамм)':40,
        'Семена кориандра (грамм)':30,
        'Пряности гарам масала (грамм)':30,
        'Перец острый сушёный (грамм)':20,
        }

#----
# Ингредиенты (пряности, специи):

metadict_detail['Пряности пряничные (килограмм)'] = {
        # 3 грамма на килограмм пряничного теста
        'Корица палочкой (грамм)':370,
        'Бадьян сушёный (грамм)':200,
        'Гвоздика сушёная (грамм)':50,
        'Орех мускатный (грамм)':50,
        'Семена кардамона (грамм)':50,
        'Цедра лимонная (грамм)':70,
        'Семена аниса (грамм)':140,
        'Корень имбиря шинкованный (грамм)':70,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности кондитерские (килограмм)'] = {
        'Корица палочкой (грамм)':250,
        'Перец душистый сушёный (грамм)':250,
        'Гвоздика сушёная (грамм)':200,
        'Семена кориандра (грамм)':200,
        'Орех мускатный (грамм)':50,
        'Корень имбиря шинкованный (грамм)':50,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности для фалафели (килограмм)'] = {
        # Исправить
            # Уточнить пропорции
        'Зелень чабреца сушёная (грамм)':250,
        'Корень куркумы (грамм)':250,
        'Семена кардамона (грамм)':100,
        'Семена зиры (грамм)':100,
        'Орегано сушёный (грамм)':100,
        'Лист лавра сушёный (грамм)':100,
        'Перец острый сушёный (грамм)':100,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности для тыквы (килограмм)'] = {
        'Корица палочкой (грамм)':500,
        'Корень имбиря шинкованный (грамм)':350,
        'Гвоздика сушёная (грамм)':100,
        'Орех мускатный (грамм)':50,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности для овощей из трёх растений (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':400,
        'Зелень петрушки сушёная (грамм)':300,
        'Зелень сельдерея сушёная (грамм)':300,
        }

metadict_detail['Пряности для овощей из пяти растений (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':300,
        'Зелень петрушки сушёная (грамм)':300,
        'Зелень сельдерея сушёная (грамм)':250,
        'Лист лавра сушёный (грамм)':100,
        'Перец чёрный сушёный (грамм)':50,
        }

metadict_detail['Пряности для овощей из восьми растений (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':250,
        'Зелень петрушки сушёная (грамм)':250,
        'Зелень сельдерея сушёная (грамм)':200,
        'Лист лавра сушёный (грамм)':100,
        'Перец острый сушёный (грамм)':50,
        'Перец чёрный сушёный (грамм)':50,
        'Орегано сушёный (грамм)':50,
        'Зелень мяты сушёная (грамм)':50,
        }

metadict_detail['Пряности прованские (килограмм)'] = {
        'Тимьян сушёный (грамм)':210,
        'Майоран сушёный (грамм)':170,
        'Зелень базилика сушёная (грамм)':125,
        'Розмарин сушёный (грамм)':125,
        'Зелень эстрагона сушёная (грамм)':125,
        'Зелень чабреца сушёная (грамм)':125,
        'Лаванда сушёная (грамм)':80,
        'Зелень фенхеля сушёная (грамм)':40,
        }

metadict_detail['Пряности для щей (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':300,
        'Зелень сельдерея сушёная (грамм)':200,
        'Зелень петрушки сушёная (грамм)':200,
        'Лист лавра сушёный (грамм)':200,
        'Перец чёрный сушёный (грамм)':100,
        }

metadict_detail['Пряности для минестроне (килограмм)'] = {
        'Зелень петрушки сушёная (грамм)':250,
        'Зелень сельдерея сушёная (грамм)':200,
        'Розмарин сушёный (грамм)':200,
        'Зелень чабера сушёная (грамм)':200,
        'Перец чёрный сушёный (грамм)':100,
        'Лист лавра сушёный (грамм)':50,
        }

metadict_detail['Пряности букета гарни с петрушкой (килограмм)'] = {
        # Средиземноморские травы (4 грамма/литр)
            # https://arborio.ru/bouquet-garni/
            # https://en.wikipedia.org/wiki/Bouquet_garni
            # The Professional Chef/The Culinary Institute of America. - 8th ed. стр 354
        'Зелень петрушки сушёная (грамм)':280,
        'Зелень сельдерея сушёная (грамм)':70,
        'Зелень базилика сушёная (грамм)':70,
        'Лист лавра сушёный (грамм)':70,
        'Майоран сушёный (грамм)':150,
        'Тимьян сушёный (грамм)':210,
        'Зелень чабера сушёная (грамм)':150,
        }

metadict_detail['Пряности букета гарни с розмарином (килограмм)'] = {
        'Розмарин сушёный (грамм)':200,
        'Майоран сушёный (грамм)':200,
        'Тимьян сушёный (грамм)':200,
        'Шалфей сушёный (грамм)':150,
        'Зелень чабера сушёная (грамм)':150,
        'Зелень мяты сушёная (грамм)':50,
        }

metadict_detail['Пряности для бобовых североморские (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':350,
        'Зелень чабера сушёная (грамм)':250,
        'Зелень мяты сушёная (грамм)':100,
        'Зелень петрушки сушёная (грамм)':100,
        'Перец острый сушёный (грамм)':50,
        'Перец чёрный сушёный (грамм)':50,
        'Семена кориандра (грамм)':50,
        'Лист лавра сушёный (грамм)':50,
        }

metadict_detail['Пряности для бобовых южноморские (килограмм)'] = {
        'Тимьян сушёный (грамм)':300,
        'Корень имбиря шинкованный (грамм)':250,
        'Перец чёрный сушёный (грамм)':100,
        'Порошок асафетиды (грамм)':100,
        'Зелень мяты сушёная (грамм)':100,
        'Орех мускатный (грамм)':50,
        'Шафран сушёный (грамм)':5,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности для фруктового маринада (килограмм)'] = {
        # Исправить
            # Не используется.
        # 9 грамм на литр воды.
        'Корица палочкой (грамм)':920,
        'Гвоздика сушёная (грамм)':40,
        'Перец душистый сушёный (грамм)':40,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности для овощного маринада с тмином (килограмм)'] = {
        # Исправить
            # Не используется.
        'Пряности для овощного маринада (грамм)':700,
        'Семена тмина (грамм)':300,
        }

metadict_detail['Пряности для овощного маринада (килограмм)'] = {
        # Исправить
            # Не используется.
        # К этой смеси в маринад добавляют (варианты):
            # 1) 60-80 стеблей зелёного укропа (с зонтиком)
            # 2) 400 грамм семян укропа
            # 3) 400 грамм семян тмина
        'Семена кориандра (грамм)':200,
        'Корица палочкой (грамм)':150,
        'Перец душистый сушёный (грамм)':150,
        'Семена горчицы белой (грамм)':100,
        'Перец чёрный сушёный (грамм)':100,
        'Лист лавра сушёный (грамм)':50,
        'Перец острый сушёный (грамм)':50,
        'Семена кардамона (грамм)':50,
        'Гвоздика сушёная (грамм)':50,
        'Корень имбиря шинкованный (грамм)':50,
        'Орех мускатный (грамм)':50,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности нежного карри (килограмм)'] = {
        # Западноевропейский.
        'Корень куркумы (грамм)':300,
        'Корень имбиря шинкованный (грамм)':200,
        'Семена кориандра (грамм)':200,
        'Семена фенугрека (грамм)':100,
        'Перец острый сушёный (грамм)':50,
        'Перец чёрный сушёный (грамм)':50,
        'Гвоздика сушёная (грамм)':50,
        'Корица палочкой (грамм)':50,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности светлого карри (килограмм)'] = {
        # Индийский
        'Перец острый сушёный (грамм)':40,
        'Перец душистый сушёный (грамм)':40,
        'Корица палочкой (грамм)':40,
        'Семена кардамона (грамм)':50,
        'Семена кориандра (грамм)':270,
        'Гвоздика сушёная (грамм)':20,
        'Семена зиры (грамм)':80,
        'Семена фенхеля (грамм)':20,
        'Семена фенугрека (грамм)':40,
        'Корень имбиря шинкованный (грамм)':40,
        'Цвет мускатный (грамм)':20,
        'Перец чёрный сушёный (грамм)':40,
        'Корень куркумы (грамм)':300,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности самбар масала (килограмм)'] = {
        # Исправить
            # На самомо деле три вида бобов:
                # Black gram (dhuli urad dal)
                # Bengal gram (channa dal)
                # Yellow lentils (arhar dal)
        # https://food.ndtv.com/recipe-sambar-masala-218687
        'Перец острый сушёный (грамм)':330,
        'Семена кориандра (грамм)':250,
        'Семена горчицы коричневой (грамм)':30,
        'Семена зиры (грамм)':50,
        'Перец душистый сушёный (грамм)':70,
        'Семена фенугрека (грамм)':30,
        'Урд сухой (грамм)':100,
        'Рис шлифованный (грамм)':30,
        'Порошок асафетиды (грамм)':30,
        'Корень куркумы (грамм)':30,
        'Лист карри сушёный (грамм)':50,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности чат масала (килограмм)'] = {
        # Манго незрелый (амчур), соль чёрная гималайская
            # https://food.ndtv.com/recipe-chaat-masala-218600
            # http://www.vedic-culture.in.ua/vegetarian-cooking/VKI/kulinariya/specii/masala.html
        'Семена зиры (грамм)':330,
        'Семена фенхеля (грамм)':80,
        'Пряности гарам масала (грамм)':165,
        'Манго сушёный (грамм)':165,
        'Соль чёрная (грамм)':165,
        'Перец острый сушёный (грамм)':50,
        'Порошок асафетиды (грамм)':30,
        'Корень имбиря шинкованный (грамм)':15,
        '_-Помол пряностей на жерновах (килограмм)':0.85,
        }

metadict_detail['Пряности гарам масала (килограмм)'] = {
        'Семена зиры (грамм)':190,
        'Семена кориандра (грамм)':190,
        'Перец чёрный сушёный (грамм)':190,
        'Семена кардамона (грамм)':190,
        'Корица палочкой (грамм)':180,
        'Гвоздика сушёная (грамм)':25,
        'Орех мускатный (грамм)':25,
        'Шафран сушёный (грамм)':5,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности чили (килограмм)'] = {
        # Исправить
            # Нужен каенский перец
        'Орегано сушёный (грамм)':270,
        'Семена зиры (грамм)':200,
        'Чеснок сушёный (грамм)':200,
        'Паприка сушёная (грамм)':170,
        'Перец острый сушёный (грамм)':100,
        'Лук сушёный (грамм)':60,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности хмели-сунели упрощённые (килограмм)'] = {
        # Исправить
            # Не используется
        'Зелень базилика сушёная (грамм)':250,
        'Майоран сушёный (грамм)':250,
        'Зелень укропа сушёная (грамм)':220,
        'Зелень кориандра сушёная (грамм)':250,
        'Перец чёрный сушёный (грамм)':20,
        'Шафран сушёный (грамм)':1,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности хмели-сунели (килограмм)'] = {
        'Семена фенугрека (грамм)':100,
        'Зелень укропа сушёная (грамм)':100,
        'Зелень сельдерея сушёная (грамм)':100,
        'Зелень кориандра сушёная (грамм)':100,
        'Зелень петрушки сушёная (грамм)':100,
        'Лист лавра сушёный (грамм)':100,
        'Зелень базилика сушёная (грамм)':100,
        'Зелень чабера сушёная (грамм)':100,
        'Зелень мяты сушёная (грамм)':100,
        'Майоран сушёный (грамм)':100,
        'Перец чёрный сушёный (грамм)':20,
        'Шафран сушёный (грамм)':1,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }
