#----
# Фильтрация, брожение, ферментация -- процессы уменьшающие калорийность пищи.
# Процессы (грамм --> 100 грамм):

metadict_detail['_~Баранина нарезанная (варка/грамм)'] = {
        '_~Баранина нарезанная (варка/100 грамм)':1 / 100,
        }

metadict_detail['_~Курица нарезанная (варка/грамм)'] = {
        '_~Курица нарезанная (варка/100 грамм)':1 / 100,
        }

metadict_detail['_~Молоко коровье (сепарация/грамм)'] = {
        '_~Молоко коровье (сепарация/100 грамм)':1 / 100,
        }

metadict_detail['_~Молоко коровье кислое (створаживание/грамм)'] = {
        '_~Молоко коровье кислое (створаживание/100 грамм)':1 / 100,
        }

metadict_detail['_~Сливки коровьи (сепарация/грамм)'] = {
        '_~Сливки коровьи (сепарация/100 грамм)':1 / 100,
        }

metadict_detail['_~Молоко козье (сепарация/грамм)'] = {
        '_~Молоко козье (сепарация/100 грамм)':1 / 100,
        }

metadict_detail['_~Молоко овечье (створаживание/грамм)'] = {
        '_~Молоко овечье (створаживание/100 грамм)':1 / 100,
        }

metadict_detail['_~Кости бараньи (фильтрация/грамм)'] = {
        '_~Кости бараньи (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Жир бараний курдючный (фильтрация/грамм)'] = {
        '_~Жир бараний курдючный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Сахар-сырец тростниковый (рафинирование/грамм)'] = {
        '_~Сахар-сырец тростниковый (рафинирование/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло соевое (фильтрация/грамм)'] = {
        '_~Сусло соевое (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло соевое (брожение/грамм)'] = {
        '_~Сусло соевое (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Яблоко чищеное (фильтрация/грамм)'] = {
        '_~Яблоко чищеное (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Корень имбиря шинкованный (фильтрация/грамм)'] = {
        '_~Корень имбиря шинкованный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Лимон отборный (фильтрация/грамм)'] = {
        '_~Лимон отборный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Гранат отборный (фильтрация/грамм)'] = {
        '_~Гранат отборный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Вишня отборная (фильтрация/грамм)'] = {
        '_~Вишня отборная (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Клюква отборная (фильтрация/грамм)'] = {
        '_~Клюква отборная (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Виноград отборный (фильтрация/грамм)'] = {
        '_~Виноград отборный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Ревень отборный (фильтрация/грамм)'] = {
        '_~Ревень отборный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Овощи сезонные нарезанные для бульона (фильтрация/грамм)'] = {
        '_~Овощи сезонные нарезанные для бульона (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Корнеплоды крахмалистые нарезанные для бульона (фильтрация/грамм)'] = {
        '_~Корнеплоды крахмалистые нарезанные для бульона (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Корнеплоды пряные обжаренные для бульона (фильтрация/грамм)'] = {
        '_~Корнеплоды пряные обжаренные для бульона (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Овощи пряные шинкованные запечённые (фильтрация/грамм)'] = {
        '_~Овощи пряные шинкованные запечённые (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Овощи пряные нарезанные для бульона (фильтрация/грамм)'] = {
        '_~Овощи пряные нарезанные для бульона (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Зелень пряная шинкованная (фильтрация/грамм)'] = {
        '_~Зелень пряная шинкованная (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Пряности букета гарни (фильтрация/грамм)'] = {
        '_~Пряности букета гарни (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Томаты отборные (фильтрация/грамм)'] = {
        '_~Томаты отборные (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Картофель чищеный (крахмализация/грамм)'] = {
        '_~Картофель чищеный (крахмализация/100 грамм)':1 / 100,
        }

metadict_detail['_~Орех карии чищенный (фильтрация/грамм)'] = {
        '_~Орех карии чищенный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Сухари ржаные (осаждение/грамм)'] = {
        '_~Сухари ржаные (осаждение/100 грамм)':1 / 100,
        }

metadict_detail['_~Опара овсяная (фильтрация/грамм)'] = {
        '_~Опара овсяная (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Рис замоченный (фильтрация/грамм)'] = {
        '_~Рис замоченный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Миндаль замоченный (фильтрация/грамм)'] = {
        '_~Миндаль замоченный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Мука миндальная (фильтрация/грамм)'] = {
        '_~Мука миндальная (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Сахар-песок (брожение/грамм)'] = {
        '_~Сахар-песок (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Солод ржаной (брожение/грамм)'] = {
        '_~Солод ржаной (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Солод ржаной (фильтрация/грамм)'] = {
        '_~Солод ржаной (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Солод ржаной (осаждение/грамм)'] = {
        '_~Солод ржаной (осаждение/100 грамм)':1 / 100,
        }

metadict_detail['_~Солод пшеничный (брожение/грамм)'] = {
        '_~Солод пшеничный (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Солод пшеничный (осаждение/грамм)'] = {
        '_~Солод пшеничный (осаждение/100 грамм)':1 / 100,
        }

metadict_detail['_~Мука гречневая (осаждение/грамм)'] = {
        '_~Мука гречневая (осаждение/100 грамм)':1 / 100,
        }

metadict_detail['_~Мука ржаная (брожение/грамм)'] = {
        '_~Мука ржаная (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Мука ржаная (осаждение/грамм)'] = {
        '_~Мука ржаная (осаждение/100 грамм)':1 / 100,
        }

metadict_detail['_~Капуста чищеная (брожение/грамм)'] = {
        '_~Капуста чищеная (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Кабачок чищеный (брожение/грамм)'] = {
        '_~Кабачок чищеный (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Огурцы отборные (брожение/грамм)'] = {
        '_~Огурцы отборные (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Боровики (брожение/грамм)'] = {
        '_~Боровики (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Томаты чищеные (брожение/грамм)'] = {
        '_~Томаты чищеные (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Свёкла чищеная (брожение/грамм)'] = {
        '_~Свёкла чищеная (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Свёкла (фильтрация/грамм)'] = {
        '_~Свёкла (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Репа чищеная (брожение/грамм)'] = {
        '_~Репа чищеная (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Морковь чищеная (брожение/грамм)'] = {
        '_~Морковь чищеная (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Яблоко отборное (брожение/грамм)'] = {
        '_~Яблоко отборное (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Сидр яблочный (окисление/грамм)'] = {
        '_~Сидр яблочный (окисление/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло яблочное (спиртовое брожение/грамм)'] = {
        '_~Сусло яблочное (спиртовое брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло яблочное (фильтрация/грамм)'] = {
        '_~Сусло яблочное (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло виноградное (спиртовое брожение/грамм)'] = {
        '_~Сусло виноградное (спиртовое брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло виноградное (фильтрация/грамм)'] = {
        '_~Сусло виноградное (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Мёд луговой (брожение/грамм)'] = {
        '_~Мёд луговой (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Вино красное сухое (окисление/грамм)'] = {
        '_~Вино красное сухое (окисление/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло грушевое (брожение/грамм)'] = {
        '_~Сусло грушевое (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло грушевое (фильтрация/грамм)'] = {
        '_~Сусло грушевое (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Груша отборная (брожение/грамм)'] = {
        '_~Груша отборная (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Слива отборная (брожение/грамм)'] = {
        '_~Слива отборная (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Морошка отборная (брожение/грамм)'] = {
        '_~Морошка отборная (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Крыжовник отборный (брожение/грамм)'] = {
        '_~Крыжовник отборный (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Вишня отборная (брожение/грамм)'] = {
        '_~Вишня отборная (брожение/100 грамм)':1 / 100,
        }

#----
# Процессы (100 грамм --> килограмм):

metadict_detail['_~Баранина нарезанная (варка/100 грамм)'] = {
        '-Белки животные (грамм)':15.6 * -0.10,
        '-Жиры животные (грамм)':16.3 * -0.15,
        '-Углеводы животные (грамм)':0.0 * -0.10,
        '+Жир снятый (доступно/килограмм)':16.3 * 0.15 / 1000,
        }

metadict_detail['_~Курица нарезанная (варка/100 грамм)'] = {
        '-Белки животные (грамм)':16.0 * -0.10,
        '-Жиры животные (грамм)':14.0 * -0.15,
        '-Углеводы животные (грамм)':0.0 * -0.10,
        '+Жир снятый (доступно/килограмм)':14.0 * 0.15 / 1000,
        }

metadict_detail['_~Сливки коровьи (сепарация/100 грамм)'] = {
        '-Белки животные (грамм)':3.0 * -0.98,
        '-Жиры животные (грамм)':20.5 * -0.05,
        '-Углеводы животные (грамм)':4.9 * -0.88,
        }

metadict_detail['_~Молоко коровье (сепарация/100 грамм)'] = {
        '-Белки животные (грамм)':2.9 * -0.84,
        '-Жиры животные (грамм)':4.2 * -0.25,
        '-Углеводы животные (грамм)':4.7 * -0.84,
        }

metadict_detail['_~Молоко коровье кислое (створаживание/100 грамм)'] = {
        # Творог из простокваши, нагрев при T 80-100°C в течении 3 часов.
        # Побочный продукт: Сыворотка творожная	0.8	0.2	3.5
        '-Белки животные (грамм)':2.9 * -0.3,
        '-Жиры животные (грамм)':1.0 * -0.2,
        '-Углеводы животные (грамм)':4.7 * -0.875,
        }

metadict_detail['_~Молоко овечье (створаживание/100 грамм)'] = {
        '-Белки животные (грамм)':6.5 * -0.3,
        '-Жиры животные (грамм)':7.7 * -0.2,
        '-Углеводы животные (грамм)':4.8 * -0.95,
        }

metadict_detail['_~Сахар-сырец тростниковый (рафинирование/100 грамм)'] = {
        '-Белки растительные (грамм)':0.0 * -1,
        '-Жиры растительные (грамм)':0.0 * -1,
        '-Углеводы растительные (грамм)':100 * -0.1,
        }

metadict_detail['_~Сусло соевое (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':9.1 * -0.6,
        '-Жиры растительные (грамм)':3.7 * -0.6,
        '-Углеводы растительные (грамм)':16.7 * -0.6,
        }

metadict_detail['_~Кости бараньи (фильтрация/100 грамм)'] = {
        '-Белки животные (грамм)':5.1 * -0.8,
        '-Жиры животные (грамм)':2.8 * -0.9,
        '-Углеводы животные (грамм)':0.1 * -0.8,
        '+Жир снятый (доступно/килограмм)':2.8 * 0.9 / 1000,
        }

metadict_detail['_~Жир бараний курдючный (фильтрация/100 грамм)'] = {
        '-Белки животные (грамм)':2.4 * -0.9,
        #'-Жиры животные (грамм)':8.9 * -0.05,
        }

metadict_detail['_~Сусло соевое (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':9.1 * 0.5,
        '-Жиры растительные (грамм)':3.7 * -0.4,
        '-Углеводы растительные (грамм)':16.7 * -0.2,
        }

metadict_detail['_~Яблоко чищеное (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':0.3 * -0.6,
        '-Жиры растительные (грамм)':0.0 * -0.6,
        '-Углеводы растительные (грамм)':11.5 * -0.6,
        }

metadict_detail['_~Корень имбиря шинкованный (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':1.8 * -0.6,
        '-Жиры растительные (грамм)':0.8 * -0.6,
        '-Углеводы растительные (грамм)':15.8 * -0.6,
        }

metadict_detail['_~Лимон отборный (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':0.9 * -0.5,
        '-Жиры растительные (грамм)':0.1 * -0.5,
        '-Углеводы растительные (грамм)':3.0 * -0.5,
        }

metadict_detail['_~Гранат отборный (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':0.9 * -0.5,
        '-Жиры растительные (грамм)':0.0 * -0.5,
        '-Углеводы растительные (грамм)':13.9 * -0.5,
        }

metadict_detail['_~Виноград отборный (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':0.6 * -0.5,
        '-Жиры растительные (грамм)':0.2 * -0.5,
        '-Углеводы растительные (грамм)':16.8 * -0.5,
        }

metadict_detail['_~Вишня отборная (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':0.8 * -0.5,
        '-Жиры растительные (грамм)':0.5 * -0.5,
        '-Углеводы растительные (грамм)':11.3 * -0.5,
        }

metadict_detail['_~Клюква отборная (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':0.5 * -0.5,
        '-Жиры растительные (грамм)':0.0 * -0.5,
        '-Углеводы растительные (грамм)':6.8 * -0.5,
        }

metadict_detail['_~Ревень отборный (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':0.7 * -0.5,
        '-Жиры растительные (грамм)':0.1 * -0.5,
        '-Углеводы растительные (грамм)':2.5 * -0.5,
        }

metadict_detail['_~Зелень пряная шинкованная (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':2.5 * -0.75,
        '-Жиры растительные (грамм)':0.4 * -0.25,
        '-Углеводы растительные (грамм)':5.1 * -0.75,
        }

metadict_detail['_~Пряности букета гарни (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':13.2 * -0.5,
        '-Жиры растительные (грамм)':4.9 * -0.5,
        '-Углеводы растительные (грамм)':43.0 * -0.5,
        }

metadict_detail['_~Корнеплоды пряные обжаренные для бульона (фильтрация/100 грамм)'] = {
        # Масло снимают ложкой когда варят бульон
        '-Белки растительные (грамм)':1.7 * -0.75,
        '-Жиры растительные (грамм)':10.2 * -0.75,
        '-Углеводы растительные (грамм)':11.8 * -0.75,
        '+Масло снятое (доступно/килограмм)':10.2 * 0.75 / 1000,
        }

metadict_detail['_~Овощи пряные нарезанные для бульона (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':1.4 * -0.75,
        '-Жиры растительные (грамм)':0.2 * -0.75,
        '-Углеводы растительные (грамм)':9.8 * -0.75,
        }

metadict_detail['_~Овощи пряные шинкованные запечённые (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':2.4 * -0.75,
        '-Жиры растительные (грамм)':0.1 * -0.75,
        '-Углеводы растительные (грамм)':13.8 * -0.75,
        }

metadict_detail['_~Овощи сезонные нарезанные для бульона (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':1.6 * -0.75,
        '-Жиры растительные (грамм)':0.3 * -0.75,
        '-Углеводы растительные (грамм)':3.9 * -0.75,
        }

metadict_detail['_~Корнеплоды крахмалистые нарезанные для бульона (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':1.6 * -0.75,
        '-Жиры растительные (грамм)':0.2 * -0.75,
        '-Углеводы растительные (грамм)':11.3 * -0.75,
        }

metadict_detail['_~Томаты отборные (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':1.1 * -0.3,
        '-Жиры растительные (грамм)':0.2 * -0.3,
        '-Углеводы растительные (грамм)':3.7 * -0.3,
        }

metadict_detail['_~Картофель чищеный (крахмализация/100 грамм)'] = {
        '-Белки растительные (грамм)':2.0 * -1,
        '-Жиры растительные (грамм)':0.4 * -1,
        '-Углеводы растительные (грамм)':16.1 * -0.76,
        }

metadict_detail['_~Орех карии чищенный (фильтрация/100 грамм)'] = {
        # Из напитка отфильтровывается 50% ореха, калорийность падает.
        '-Белки растительные (грамм)':12.7 * -0.5,
        '-Жиры растительные (грамм)':64.2 * -0.5,
        '-Углеводы растительные (грамм)':18.3 * -0.5,
        }

metadict_detail['_~Сухари ржаные (осаждение/100 грамм)'] = {
        '-Белки растительные (грамм)':9.7 * -0.5,
        '-Жиры растительные (грамм)':1.0 * -0.5,
        '-Углеводы растительные (грамм)':71.9 * -0.5,
        }

metadict_detail['_~Опара овсяная (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':4.3 * -0.5,
        '-Жиры растительные (грамм)':2.1 * -0.5,
        '-Углеводы растительные (грамм)':20.1 * -0.5,
        }

metadict_detail['_~Рис замоченный (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':4.4 * -0.5,
        '-Жиры растительные (грамм)':0.5 * -0.5,
        '-Углеводы растительные (грамм)':51.3 * -0.5,
        }

metadict_detail['_~Миндаль замоченный (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':9.3 * -0.5,
        '-Жиры растительные (грамм)':28.9 * -0.5,
        '-Углеводы растительные (грамм)':8.1 * -0.5,
        }

metadict_detail['_~Мука миндальная (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':18.6 * -0.5,
        '-Жиры растительные (грамм)':57.7 * -0.5,
        '-Углеводы растительные (грамм)':16.2 * -0.5,
        }

metadict_detail['_~Сахар-песок (брожение/100 грамм)'] = {
        # Глюкоза превращается в этиловый спир, выделяется углекислый газ:
        # https://alcodistillers.ru/distill3.html
        '-Углеводы растительные (грамм)':99.4 * -1,
        '-Этанол (грамм)':99.4 * 1 * 0.511 * 0.9,
        }

metadict_detail['_~Солод пшеничный (брожение/100 грамм)'] = {
        # Исправить
            # Уточнить содержание сахара
        '-Углеводы растительные (грамм)':64.9 * -0.50,
        '-Этанол (грамм)':64.9 * 0.50 * 0.511 * 0.9,
        }

metadict_detail['_~Солод пшеничный (осаждение/100 грамм)'] = {
        '-Белки растительные (грамм)':19.2 * -0.5,
        '-Жиры растительные (грамм)':1.2 * -0.5,
        '-Углеводы растительные (грамм)':64.9 * -0.5,
        }

metadict_detail['_~Солод ржаной (брожение/100 грамм)'] = {
        # Исправить
            # Уточнить содержание сахара в солоде
        '-Углеводы растительные (грамм)':61.8 * -0.50,
        '-Этанол (грамм)':61.8 * 0.50 * 0.511 * 0.9,
        }

metadict_detail['_~Солод ржаной (фильтрация/100 грамм)'] = {
        # Сливаем рассол
        '-Белки растительные (грамм)':19.0 * -1,
        '-Жиры растительные (грамм)':1.0 * -1,
        '-Углеводы растительные (грамм)':61.8 * -0.75,
        }

metadict_detail['_~Солод ржаной (осаждение/100 грамм)'] = {
        # Удаляем квасной осадок
        '-Белки растительные (грамм)':19.0 * -0.5,
        '-Жиры растительные (грамм)':1.0 * -0.5,
        '-Углеводы растительные (грамм)':61.8 * -0.5,
        }

metadict_detail['_~Мука гречневая (осаждение/100 грамм)'] = {
        '-Белки растительные (грамм)':12.6 * -0.5,
        '-Жиры растительные (грамм)':3.3 * -0.5,
        '-Углеводы растительные (грамм)':62.1 * -0.5,
        }

metadict_detail['_~Мука ржаная (брожение/100 грамм)'] = {
        '-Углеводы растительные (грамм)':73.0 * -0.33,
        '-Этанол (грамм)':73.0 * 0.15 * 0.9,
        }

metadict_detail['_~Мука ржаная (осаждение/100 грамм)'] = {
        '-Белки растительные (грамм)':9.0 * -0.5,
        '-Жиры растительные (грамм)':1.0 * -0.5,
        '-Углеводы растительные (грамм)':73.0 * -0.5,
        }

metadict_detail['_~Капуста чищеная (брожение/100 грамм)'] = {
        # Длительное молочно-кислое брожение, потеря 50% питательных веществ.
        # https://znaytovar.ru/s/Kvashenaya-kapusta.html
        '-Белки растительные (грамм)':1.8 * -0.5,
        '-Жиры растительные (грамм)':0.1 * -0.5,
        '-Углеводы растительные (грамм)':4.7 * -0.5,
        }

metadict_detail['_~Кабачок чищеный (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':1.5 * -0.5,
        '-Жиры растительные (грамм)':0.2 * -0.5,
        '-Углеводы растительные (грамм)':3.0 * -0.5,
        }

metadict_detail['_~Огурцы отборные (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':0.8 * -0.5,
        '-Жиры растительные (грамм)':0.1 * -0.5,
        '-Углеводы растительные (грамм)':2.8 * -0.5,
        }

metadict_detail['_~Боровики (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':3.7 * -0.5,
        '-Жиры растительные (грамм)':1.7 * -0.5,
        '-Углеводы растительные (грамм)':1.1 * -0.5,
        }

metadict_detail['_~Томаты чищеные (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':1.1 * -0.5,
        '-Жиры растительные (грамм)':0.2 * -0.5,
        '-Углеводы растительные (грамм)':3.7 * -0.5,
        }

metadict_detail['_~Репа чищеная (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':1.1 * -0.5,
        '-Жиры растительные (грамм)':0.1 * -0.5,
        '-Углеводы растительные (грамм)':6.2 * -0.5,
        }

metadict_detail['_~Свёкла чищеная (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':1.8 * -0.5,
        '-Жиры растительные (грамм)':0.0 * -0.5,
        '-Углеводы растительные (грамм)':10.8 * -0.5,
        }

metadict_detail['_~Свёкла (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':1.8 * -0.5,
        '-Жиры растительные (грамм)':0.0 * -0.5,
        '-Углеводы растительные (грамм)':10.8 * -0.5,
        }

metadict_detail['_~Яблоко отборное (брожение/100 грамм)'] = {
        # Молочно-кислое брожение
        '-Белки растительные (грамм)':0.3 * -0.5,
        '-Жиры растительные (грамм)':0.0 * -0.5,
        '-Углеводы растительные (грамм)':11.5 * -0.5,
        }

metadict_detail['_~Морковь чищеная (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':1.3 * -0.5,
        '-Жиры растительные (грамм)':0.1 * -0.5,
        '-Углеводы растительные (грамм)':6.9 * -0.5,
        }

metadict_detail['_~Мёд луговой (брожение/100 грамм)'] = {
        '-Углеводы растительные (грамм)':81.6 * -0.9,
        '-Этанол (грамм)':81.6 * 0.9 * 0.511 * 0.9,
        }

metadict_detail['_~Сусло яблочное (спиртовое брожение/100 грамм)'] = {
        '-Углеводы растительные (грамм)':11.5 * -0.5,
        '-Этанол (грамм)':11.5 * 0.5 * 0.511 * 0.8,
        }

metadict_detail['_~Сусло яблочное (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':0.3 * -0.5,
        '-Жиры растительные (грамм)':0.0 * -0.5,
        '-Углеводы растительные (грамм)':11.5 * -0.5,
        }

metadict_detail['_~Сидр яблочный (окисление/100 грамм)'] = {
        # Уксуснокислое брожение
        '-Этанол (грамм)':11.5 * 0.511 * 0.8 * -1,
        '-Уксусная кислота (грамм)':11.5 * 0.511 * 0.8,
        }

metadict_detail['_~Сусло виноградное (спиртовое брожение/100 грамм)'] = {
        '-Углеводы растительные (грамм)':16.8 * -0.5,
        '-Этанол (грамм)':16.8 * 0.5 * 0.511 * 0.8,
        }

metadict_detail['_~Сусло виноградное (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':0.6 * -0.5,
        '-Жиры растительные (грамм)':0.2 * -0.5,
        '-Углеводы растительные (грамм)':16.8 * -0.5,
        }

metadict_detail['_~Вино красное сухое (окисление/100 грамм)'] = {
        '-Этанол (грамм)':16.8 * 0.511 * 0.8 * -1,
        '-Уксусная кислота (грамм)':16.8 * 0.511 * 0.8,
        }

metadict_detail['_~Груша отборная (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':0.4 * -0.5,
        '-Жиры растительные (грамм)':0.3 * -0.5,
        '-Углеводы растительные (грамм)':10.9 * -0.5,
        }

metadict_detail['_~Сусло грушевое (брожение/100 грамм)'] = {
        '-Углеводы растительные (грамм)':10.9 * -0.5,
        '-Этанол (грамм)':10.9 * 0.5 * 0.511 * 0.8,
        }

metadict_detail['_~Сусло грушевое (фильтрация/100 грамм)'] = {
        '-Белки растительные (грамм)':0.4 * -0.5,
        '-Жиры растительные (грамм)':0.3 * -0.5,
        '-Углеводы растительные (грамм)':10.9 * -0.5,
        }

metadict_detail['_~Слива отборная (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':0.8 * -0.5,
        '-Жиры растительные (грамм)':0.3 * -0.5,
        '-Углеводы растительные (грамм)':9.6 * -0.5,
        }

metadict_detail['_~Морошка отборная (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':0.8 * -0.5,
        '-Жиры растительные (грамм)':0.0 * -0.5,
        '-Углеводы растительные (грамм)':9.8 * -0.5,
        }

metadict_detail['_~Вишня отборная (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':0.8 * -0.5,
        '-Жиры растительные (грамм)':0.5 * -0.5,
        '-Углеводы растительные (грамм)':11.3 * -0.5,
        }

metadict_detail['_~Крыжовник отборный (брожение/100 грамм)'] = {
        '-Белки растительные (грамм)':0.7 * -0.5,
        '-Жиры растительные (грамм)':0.2 * -0.5,
        '-Углеводы растительные (грамм)':9.1 * -0.5,
        }
