#----
# Подавление вывода данных:

metadict_detail['-Рыночная цена (фоллисов)'] = {
        }

metadict_detail['-Мёд (требуется/килограмм)'] = {
        }

metadict_detail['-Сыворотка творожная коровья (требуется/килограмм)'] = {
        }

metadict_detail['-Молоко коровье (требуется/килограмм)'] = {
        }

metadict_detail['-Молоко коровье снятое (требуется/килограмм)'] = {
        }

metadict_detail['-Молоко овечье (требуется/килограмм)'] = {
        }

metadict_detail['+Молоко коровье (доступно/килограмм)'] = {
        }

metadict_detail['+Молоко коровье снятое (доступно/килограмм)'] = {
        }

metadict_detail['+Молоко овечье (доступно/килограмм)'] = {
        }

metadict_detail['+Солома просяная (доступно/килограмм)'] = {
        }

metadict_detail['+Солома пшеничная (доступно/килограмм)'] = {
        }

metadict_detail['+Солома рисовая (доступно/килограмм)'] = {
        }

metadict_detail['+Солома ячменная (доступно/килограмм)'] = {
        }

metadict_detail['+Сыворотка творожная коровья (доступно/килограмм)'] = {
        }

metadict_detail['+Сыворотка творожная овечья (доступно/килограмм)'] = {
        }

metadict_detail['+Шерсть овечья (доступно/килограмм)'] = {
        }

metadict_detail['+Яйцо куриное (доступно/штук)'] = {
        }

metadict_detail['-Масло растительное (требуется/килограмм)'] = {
        }

metadict_detail['-Яйцо куриное (требуется/штук)'] = {
        }


#----
# Подавление вывода данных:

metadict_detail['+Бульон мясной бараний (доступно/килограмм)'] = {
        }

metadict_detail['+Бульон мясной куриный (доступно/килограмм)'] = {
        }

metadict_detail['+Жир бараний (доступно/килограмм)'] = {
        }

metadict_detail['+Жир говяжий (доступно/килограмм)'] = {
        }

metadict_detail['+Икра осетровых (доступно/килограмм)'] = {
        }

metadict_detail['+Ливер бараний (доступно/килограмм)'] = {
        }

metadict_detail['+Ливер говяжий (доступно/килограмм)'] = {
        }

metadict_detail['+Субпродукты бараньи (доступно/килограмм)'] = {
        }

metadict_detail['+Субпродукты говяжьи (доступно/килограмм)'] = {
        }

metadict_detail['+Субпродукты куриные (доступно/килограмм)'] = {
        }

metadict_detail['-Бульон мясной бараний (требуется/килограмм)'] = {
        }

metadict_detail['-Бульон мясной куриный (требуется/килограмм)'] = {
        }

metadict_detail['-Жир бараний (требуется/килограмм)'] = {
        }

metadict_detail['-Ливер бараний (требуется/килограмм)'] = {
        }

metadict_detail['-Ливер говяжий (требуется/килограмм)'] = {
        }

metadict_detail['-Субпродукты говяжьи (требуется/килограмм)'] = {
        }



#metadict_model['+Молоко коровье снятое (доступно/килограмм)'] = {
#        }
#
#metadict_model['+Пахта сливочная коровья (доступно/килограмм)'] = {
#        }

#metadict_model['-Молоко коровье снятое (требуется/килограмм)'] = {
#        }
#
#metadict_model['-Сыворотка творожная коровья (требуется/килограмм)'] = {
#        }

#metadict_model['+Сыворотка творожная овечья (доступно/килограмм)'] = {
#        }

metadict_detail['-Мясо по убойному выходу (килограмм)'] = {
        }

metadict_detail['-Рыба по убойному выходу (килограмм)'] = {
        }

metadict_model['-Животное на убой белуга (требуется/особь)'] = {
        }

metadict_model['-Животное на убой форель (требуется/особь)'] = {
        }

metadict_model['-Животное на убой осётр (требуется/особь)'] = {
        }

metadict_model['-Животное на убой севрюга (требуется/особь)'] = {
        }

metadict_model['-Кости бараньи (требуется/килограмм)'] = {
        }

metadict_model['-Кости говяжьи (требуется/килограмм)'] = {
        }

metadict_model['Соль поваренная (килограмм)'] = {
        }

metadict_model['Вода хозяйственная (литр)'] = {
        }

metadict_model['+Шкура баранья (доступно/квадратный метр)'] = {
        }

metadict_model['+Шкура коровья (доступно/квадратный метр)'] = {
        }

metadict_detail['+Перо куриное (доступно/килограмм)'] = {
        }

#----
# Подавление вывода данных:

metadict_model['-Жир бараний курдючный (требуется/килограмм)'] = {
        '-Жир бараний (требуется/килограмм)':1,
        }

metadict_model['-Диафрагма баранья (требуется/килограмм)'] = {
        '-Ливер бараний (требуется/килограмм)':1,
        }

metadict_model['-Лёгкие бараньи (требуется/килограмм)'] = {
        '-Ливер бараний (требуется/килограмм)':1,
        }

metadict_model['-Печень баранья (требуется/килограмм)'] = {
        '-Ливер бараний (требуется/килограмм)':1,
        }

metadict_model['-Почки бараньи (требуется/килограмм)'] = {
        '-Ливер бараний (требуется/килограмм)':1,
        }

metadict_model['-Рубец бараний (требуется/килограмм)'] = {
        '-Ливер бараний (требуется/килограмм)':1,
        }

metadict_model['-Селезёнка баранья (требуется/килограмм)'] = {
        '-Ливер бараний (требуется/килограмм)':1,
        }

metadict_model['-Сердце баранье (требуется/килограмм)'] = {
        '-Ливер бараний (требуется/килограмм)':1,
        }

metadict_detail['-Вымя говяжье (требуется/килограмм)'] = {
        '-Субпродукты говяжьи (требуется/килограмм)':1,
        }

metadict_detail['-Диафрагма говяжья (требуется/килограмм)'] = {
        '-Ливер говяжий (требуется/килограмм)':1,
        }

metadict_detail['-Книжка говяжья (требуется/килограмм)'] = {
        '-Субпродукты говяжьи (требуется/килограмм)':1,
        }

metadict_detail['-Лёгкие говяжьи (требуется/килограмм)'] = {
        '-Ливер говяжий (требуется/килограмм)':1,
        }

metadict_detail['-Ноги говяжьи (требуется/килограмм)'] = {
        '-Субпродукты говяжьи (требуется/килограмм)':1,
        }

metadict_detail['-Печень говяжья (требуется/килограмм)'] = {
        '-Ливер говяжий (требуется/килограмм)':1,
        }

metadict_detail['-Почки говяжьи (требуется/килограмм)'] = {
        '-Ливер говяжий (требуется/килограмм)':1,
        }

metadict_detail['-Рубец говяжий (требуется/килограмм)'] = {
        '-Субпродукты говяжьи (требуется/килограмм)':1,
        }

metadict_detail['-Сердце говяжье (требуется/килограмм)'] = {
        '-Ливер говяжий (требуется/килограмм)':1,
        }

metadict_detail['-Сычуг говяжий (требуется/килограмм)'] = {
        '-Субпродукты говяжьи (требуется/килограмм)':1,
        }

metadict_detail['-Уши говяжьи (требуется/килограмм)'] = {
        '-Субпродукты говяжьи (требуется/килограмм)':1,
        }

metadict_detail['-Хвост говяжий (требуется/килограмм)'] = {
        '-Субпродукты говяжьи (требуется/килограмм)':1,
        }

#----
# Подавление вывода данных:

metadict_detail['|=Корзина алычи (килограмм)'] = {
        # Местная перевозка грузов
        }

metadict_detail['|=Корзина фиников (килограмм)'] = {
        }

metadict_detail['|=Корзина винограда (килограмм)'] = {
        }

metadict_detail['|=Корзина гороха в стручках (килограмм)'] = {
        }

metadict_detail['|=Корзина граната (килограмм)'] = {
        }

metadict_detail['|=Корзина груш (килограмм)'] = {
        }

metadict_detail['|=Корзина дикорастущих орехов (килограмм)'] = {
        }

metadict_detail['|=Корзина дикорастущих растений (килограмм)'] = {
        }

metadict_detail['|=Корзина зерна просо (килограмм)'] = {
        }

metadict_detail['|=Корзина зерна пшеницы (килограмм)'] = {
        }

metadict_detail['|=Корзина зерна риса посевного (килограмм)'] = {
        }

metadict_detail['|=Корзина зерна ячменя (килограмм)'] = {
        }

metadict_detail['|=Корзина инжира (килограмм)'] = {
        }

metadict_detail['|=Корзина капусты белокочанной (килограмм)'] = {
        }

metadict_detail['|=Корзина лука зелёного (килограмм)'] = {
        }

metadict_detail['|=Корзина лука репчатого (килограмм)'] = {
        }

metadict_detail['|=Корзина моркови (килограмм)'] = {
        }

metadict_detail['|=Корзина нута бараньего в стручках (килограмм)'] = {
        }

metadict_detail['|=Корзина оливок (килограмм)'] = {
        }

metadict_detail['|=Корзина плодов чёрного перца (килограмм)'] = {
        }

metadict_detail['|=Корзина семян льна (килограмм)'] = {
        }

metadict_detail['|=Корзина сливы (килограмм)'] = {
        }

metadict_detail['|=Корзина цветов шафрана (килограмм)'] = {
        }

metadict_detail['|=Корзина чеснока (килограмм)'] = {
        }

metadict_detail['|=Корзина чечевицы (килограмм)'] = {
        }

metadict_detail['|=Корзина яблок (килограмм)'] = {
        }

metadict_detail['|=Сноп льна (килограмм)'] = {
        }

metadict_detail['|=Сноп просо (килограмм)'] = {
        }

metadict_detail['|=Сноп просяной соломы (килограмм)'] = {
        }

metadict_detail['|=Сноп пшеницы (килограмм)'] = {
        }

metadict_detail['|=Сноп пшеничной соломы (килограмм)'] = {
        }

metadict_detail['|=Сноп риса посевного (килограмм)'] = {
        }

metadict_detail['|=Сноп рисовой соломы (килограмм)'] = {
        }

metadict_detail['|=Сноп сена лугового (килограмм)'] = {
        }

metadict_detail['|=Сноп ячменной соломы (килограмм)'] = {
        }

metadict_detail['|=Сноп ячменя (килограмм)'] = {
        }

#----
# Подавление вывода данных:

metadict_model['||Блюдо густое горячее (250-грамм/порция)'] = {
        # Можно посуду подключить.
        }

metadict_detail['||Блюдо густое холодное (250-грамм/порция)'] = {
        }

metadict_detail['||Блюдо твёрдое горячее (250-грамм/порция)'] = {
        }

metadict_detail['||Выпечка вчерашняя (50-грамм/порция)'] = {
        }

metadict_detail['||Выпечка свежая (250-грамм/порция)'] = {
        }

metadict_detail['||Выпечка свежая (50-грамм/порция)'] = {
        }

metadict_detail['||Мясо-мучные изделия (50-грамм/порция)'] = {
        }

metadict_detail['||Сладости (50-грамм/порция)'] = {
        }

metadict_detail['||Соус (50-грамм/порция)'] = {
        }

metadict_detail['||Фрукты (250-грамм/порция)'] = {
        }

metadict_model['||Блюдо жидкое горячее (250-грамм/порция)'] = {
        }

metadict_model['||Блюдо твёрдое холодное (125-грамм/порция)'] = {
        }

metadict_model['||Фрукты (125-грамм/порция)'] = {
        }

metadict_model['||Питьё холодное (250-грамм/порция)'] = {
        }

metadict_model['||Хлеб вчерашний (50-грамм/порция)'] = {
        }

metadict_model['||Хлеб свежий (50-грамм/порция)'] = {
        }

metadict_model['||Блюдо густое холодное (125-грамм/порция)'] = {
        }

metadict_model['||Выпечка (250-грамм/порция)'] = {
        }

#----
# Подавление вывода данных:

metadict_model['-Испарение воды в котле (килограмм)'] = {
        # Для расчётов очага. Позже допилю.
        }

metadict_model['-Испарение воды на воздухе (килограмм)'] = {
        }

metadict_model['-Испарение воды на очаге (килограмм)'] = {
        }

metadict_model['-Кипячение воды в котле (килограмм)'] = {
        }

metadict_model['-Кипячение воды на очаге (килограмм)'] = {
        }

metadict_model['-Испарение воды в печи (килограмм)'] = {
        }

metadict_model['-Кипячение воды в печи (килограмм)'] = {
        }

metadict_detail['-Испарение воды на костре (килограмм)'] = {
        }

metadict_detail['-Кипячение воды на костре (килограмм)'] = {
        }

#----
# Подавление вывода данных:

metadict_model['_-Варка костного бульона в котелке (килограмм)'] = {
        # Будет использоваться для оценки трудозатрат.
        }

metadict_model['_-Варка гороха в котелке (килограмм)'] = {
        }

metadict_model['_-Варка нута в котелке (килограмм)'] = {
        }

metadict_model['_-Варка пшеницы в котелке (килограмм)'] = {
        }

metadict_model['_-Варка чечевицы в котелке (килограмм)'] = {
        }

metadict_model['_-Выпечка лепёшек в тандыре (килограмм)'] = {
        }

metadict_model['_-Замачивание бобов (килограмм)'] = {
        }

metadict_model['_-Замачивание пшеницы (килограмм)'] = {
        }

metadict_model['_-Измельчение орехов в ступе (килограмм)'] = {
        }

metadict_model['_-Обмолот бобов (килограмм)'] = {
        }

metadict_model['_-Перебор бобов (килограмм)'] = {
        }

metadict_model['_-Перебор зерна (килограмм)'] = {
        }

metadict_model['_-Переработка оливок в масло (килограмм)'] = {
        }

metadict_model['_-Подготовка теста для лепёшек (килограмм)'] = {
        }

metadict_model['_-Помол зерна (килограмм)'] = {
        }

metadict_detail['_-Обмолот зерновых (килограмм)'] = {
        }

metadict_detail['_-Обмолот масличных культур (килограмм)'] = {
        }

metadict_detail['_-Обмолот пряных растений (килограмм)'] = {
        }

metadict_model['_-Приготовление бездрожжевого теста (килограмм)'] = {
        }

metadict_model['_-Прокаливание муки на сковороде (килограмм)'] = {
        }

metadict_model['_-Протирание бобов в ступе (килограмм)'] = {
        }

metadict_model['_-Чистка орехов (килограмм)'] = {
        }

metadict_model['_-Шинковка зелени (килограмм)'] = {
        }

metadict_model['_-Варка пшённой каши в котелке (килограмм)'] = {
        }

metadict_model['_-Вытапливание жира в казане (килограмм)'] = {
        }

metadict_model['_-Дробление зерна (килограмм)'] = {
        }

metadict_model['_-Замачивание риса (килограмм)'] = {
        }

metadict_model['_-Обмолот зерна (килограмм)'] = {
        }

metadict_model['_-Прокаливание масла на сковороде (килограмм)'] = {
        }

metadict_model['_-Тушение риса в котелке (килограмм)'] = {
        }

metadict_model['_-Чистка фруктов (килограмм)'] = {
        }

metadict_model['_-Варка перловой каши в котелке (килограмм)'] = {
        }

metadict_model['_-Замачивание зерна (килограмм)'] = {
        }

metadict_model['_-Запекание корнеплодов на противене (килограмм)'] = {
        }

metadict_model['_-Запекание костей на противене (килограмм)'] = {
        }

metadict_model['_-Запекание овощей на противене (килограмм)'] = {
        }

metadict_model['_-Нарезка мяса (килограмм)'] = {
        }

metadict_model['_-Обжаривание мяса в казане (килограмм)'] = {
        }

metadict_model['_-Обжаривание овощей в казане (килограмм)'] = {
        }

metadict_model['_-Перебор крупы (килограмм)'] = {
        }

metadict_model['_-Перебор фруктов (килограмм)'] = {
        }

metadict_model['_-Перебор ягод (килограмм)'] = {
        }

metadict_model['_-Приготовление вина (килограмм)'] = {
        }

metadict_model['_-Припускание мяса в казане (килограмм)'] = {
        }

metadict_model['_-Прокаливание крупы на сковороде (килограмм)'] = {
        }

metadict_model['_-Промывание крупы (килограмм)'] = {
        }

metadict_model['_-Процеживание бульона через мешок (килограмм)'] = {
        }

metadict_model['_-Сушка фруктов (килограмм)'] = {
        }

metadict_model['_-Чистка корнеплодов (килограмм)'] = {
        }

metadict_model['_-Разделка мяса (килограмм)'] = {
        }

metadict_model['_-Чистка овощей (килограмм)'] = {
        }

metadict_model['_-Шинковка овощей (килограмм)'] = {
        }

metadict_model['_-Кипячение воды в котелке (килограмм)'] = {
        }

metadict_model['_-Перебор трав (килограмм)'] = {
        }

metadict_model['_-Отжим семян в масло (килограмм)'] = {
        }

metadict_model['_-Сушка трав (килограмм)'] = {
        }

metadict_model['_-Чистка и шлифование зерна (килограмм)'] = {
        }

metadict_model['_-Вяление рыбы (килограмм)'] = {
        }

metadict_model['_-Разделка крупной рыбы (килограмм)'] = {
        }

metadict_model['_-Разделка мелкого рогатого скота (килограмм)'] = {
        }

metadict_model['_-Разделка крупного рогатого скота (килограмм)'] = {
        }

metadict_model['_-Бланширование зелени в котелке (килограмм)'] = {
        }

metadict_model['_-Вымешивание раствора в миске (килограмм)'] = {
        }

metadict_model['_-Выпечка пирогов на тандыре (килограмм)'] = {
        }

metadict_model['_-Перебор овощей (килограмм)'] = {
        }

metadict_model['_-Проваривание супа в котелке (килограмм)'] = {
        }

metadict_model['_-Протирание начинки в ступе (килограмм)'] = {
        }

metadict_model['_-Протирание сыра в ступе (килограмм)'] = {
        }

metadict_model['_-Тушение овощей в котелке (килограмм)'] = {
        }

metadict_model['_-Фаршировка теста для лепёшек (килограмм)'] = {
        }

metadict_detail['_-Запекание баранины в шкуре барана (килограмм)'] = {
        }

metadict_detail['_-Помол пряностей на жерновах (килограмм)'] = {
        }

metadict_detail['_-Разделка ливера (килограмм)'] = {
        }

metadict_detail['_-Варка мяса в котелке (килограмм)'] = {
        }

metadict_detail['_-Варка риса в котелке (килограмм)'] = {
        }

metadict_detail['_-Варка субпродуктов в котелке (килограмм)'] = {
        }

metadict_detail['_-Варка хаша в котелке (килограмм)'] = {
        }

metadict_detail['_-Варка хинкали в котелке (килограмм)'] = {
        }

metadict_detail['_-Взбивание яйца (килограмм)'] = {
        }

metadict_detail['_-Вымешивание пасты в миске (килограмм)'] = {
        }

metadict_detail['_-Вымешивание фарша в миске (килограмм)'] = {
        }

metadict_detail['_-Запекание рыбы на костре (килограмм)'] = {
        }

metadict_detail['_-Отжим фруктов (килограмм)'] = {
        }

metadict_detail['_-Подготовка теста для хинкали (килограмм)'] = {
        }

metadict_detail['_-Приготовление чурчхелы (килограмм)'] = {
        }

metadict_detail['_-Протирание фруктов в ступе (килограмм)'] = {
        }

metadict_detail['_-Разделка мелкой рыбы (килограмм)'] = {
        }

metadict_detail['_-Разделка птицы (килограмм)'] = {
        }

metadict_detail['_-Смешивание салата в миске (килограмм)'] = {
        }

metadict_detail['_-Сушка ягод (килограмм)'] = {
        }

metadict_detail['_-Уваривание виноградного сока в котле (килограмм)'] = {
        }

metadict_detail['_-Уваривание фруктов в котелке (килограмм)'] = {
        }

metadict_detail['_-Фаршировка рыбы (килограмм)'] = {
        }

metadict_detail['_-Фаршировка теста для хинкали (килограмм)'] = {
        }

metadict_detail['_-Шинковка мяса (килограмм)'] = {
        }

metadict_detail['_-Замачивание солонины (килограмм)'] = {
        }

metadict_detail['_-Обжаривание орехов в казане (килограмм)'] = {
        }

metadict_detail['_-Раскатка и нарезка теста (килограмм)'] = {
        }

metadict_detail['_-Соление мяса всухую (килограмм)'] = {
        }

metadict_detail['_-Тушение мяса в котле (килограмм)'] = {
        }

metadict_detail['_-Уваривание мёда в сотейнике (килограмм)'] = {
        }

metadict_detail['_-Шинковка орехов (килограмм)'] = {
        }

metadict_detail['_-Варка пшеничной каши в котелке (килограмм)'] = {
        }

metadict_detail['_-Варка ячневой каши в котелке (килограмм)'] = {
        }

metadict_detail['_-Чистка и дробление зерна (килограмм)'] = {
        }

metadict_detail['_-Покос травы на сено (килограмм)'] = {
        }

metadict_detail['_-Работа в поле бобовых (нормо-часов)'] = {
        }

metadict_detail['_-Работа в поле зерновых (нормо-часов)'] = {
        }

metadict_detail['_-Работа во фруктовых садах (нормо-часов)'] = {
        }

metadict_detail['_-Работа на винограднике (нормо-часов)'] = {
        }

metadict_detail['_-Работа на оливковых садах (нормо-часов)'] = {
        }

metadict_detail['Сбор дикорастущих орехов (центнер)'] = {
        }

metadict_detail['Сбор дикорастущих растений (центнер)'] = {
        }

#----
# Подавление вывода данных:

#metadict_model['-----Регионы'] = {
#        }
#
#metadict_model['----Округа'] = {
#        }
#
#metadict_model['---Города'] = {
#        }
#
#metadict_model['---Городища'] = {
#        }
#
#metadict_model['---Селения'] = {
#        }
#
#metadict_model['--Общины'] = {
#        }
#
#metadict_model['-Семьи'] = {
#        }
#
#metadict_model['--Население'] = {
#        }

metadict_model['-Едоки'] = {
        }

metadict_model['-Работники'] = {
        }

metadict_model['-Бедняки'] = {
        }

metadict_model['-Горожане'] = {
        }

metadict_model['-Горожане-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Горожане-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Горожане-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Горожане-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Горожане-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Горожане-мужчины старики (50+ лет)'] = {
        }

metadict_model['-Знатные'] = {
        }

metadict_model['-Знатные-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Знатные-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Знатные-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Знатные-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Знатные-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Знатные-мужчины старики (50+ лет)'] = {
        }

metadict_model['-Рабы'] = {
        }

metadict_detail['-Скотоводы'] = {
        }

metadict_detail['-Скотоводы-женщины взрослые (15-50 лет)'] = {
        }

metadict_detail['-Скотоводы-женщины дети (0-15 лет)'] = {
        }

metadict_detail['-Скотоводы-женщины старухи (50+ лет)'] = {
        }

metadict_detail['-Скотоводы-мужчины взрослые (15-50 лет)'] = {
        }

metadict_detail['-Скотоводы-мужчины дети (0-15 лет)'] = {
        }

metadict_detail['-Скотоводы-мужчины старики (50+ лет)'] = {
        }

metadict_detail['-Рыбаки'] = {
        }

metadict_detail['-Рыбаки-женщины взрослые (15-50 лет)'] = {
        }

metadict_detail['-Рыбаки-женщины дети (0-15 лет)'] = {
        }

metadict_detail['-Рыбаки-женщины старухи (50+ лет)'] = {
        }

metadict_detail['-Рыбаки-мужчины взрослые (15-50 лет)'] = {
        }

metadict_detail['-Рыбаки-мужчины дети (0-15 лет)'] = {
        }

metadict_detail['-Рыбаки-мужчины старики (50+ лет)'] = {
        }

metadict_model['-Селяне'] = {
        }

metadict_model['-Селяне-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Селяне-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Селяне-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Селяне-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Селяне-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Селяне-мужчины старики (50+ лет)'] = {
        }

metadict_model['-Карлы-самки взрослые (15-50 лет)'] = {
        }

metadict_model['-Карлы-самки дети (0-15 лет)'] = {
        }

metadict_model['-Карлы-самки старухи (50+ лет)'] = {
        }

metadict_model['-Карлы-самцы взрослые (15-50 лет)'] = {
        }

metadict_model['-Карлы-самцы дети (0-15 лет)'] = {
        }

metadict_model['-Карлы-самцы старики (50+ лет)'] = {
        }

metadict_model['-Рабы-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Рабы-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Рабы-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Рабы-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Рабы-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Рабы-мужчины старики (50+ лет)'] = {
        }

#----

metadict_detail['_+Работа вола (дней/год)'] = {
        }

metadict_detail['_+Работа женщины-скотовода (нормо-часов)'] = {
        }

metadict_detail['_+Работа мужчины-скотовода (нормо-часов)'] = {
        }

metadict_detail['_+Работа женщины-рыбака (нормо-часов)'] = {
        }

metadict_detail['_+Работа мужчины-рыбака (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-горожанки (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-знатной (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-селянки (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-горожанина (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-знатного (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-селянина (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-карлы (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-рабыни (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-карла (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-раба (нормо-часов)'] = {
        }

#----
# Субпродукты бараньи:

metadict_model['+Курдюк бараний (доступно/килограмм)'] = {
        '+Жир бараний курдючный (доступно/килограмм)':0.8,
        }

metadict_model['+Жир бараний курдючный (доступно/килограмм)'] = {
        '+Жир бараний (доступно/килограмм)':1,
        }

metadict_model['+Жир бараний почечный (доступно/килограмм)'] = {
        '+Жир бараний (доступно/килограмм)':1,
        }

metadict_model['+Жир бараний прочий (доступно/килограмм)'] = {
        '+Жир бараний (доступно/килограмм)':1,
        }

metadict_model['+Голова баранья (доступно/килограмм)'] = {
        '+Череп бараний (доступно/килограмм)':0.40,
        '+Челюсть баранья (доступно/килограмм)':0.15,
        '+Субпродукты бараньи (доступно/килограмм)':0.45,
        }

metadict_model['+Сухожилия бараньи (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Диафрагма баранья (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Калтык бараний (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Кишечник бараний (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Ноги с копытами бараньи (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Кровь баранья (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Лёгкие бараньи (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Мозги бараньи (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Печень баранья (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Почки бараньи (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Рубец бараний (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Селезёнка баранья (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Сердце баранье (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Шкура баранья (доступно/килограмм)'] = {
        '+Шкура баранья (доступно/штук)':0.3,
        }

metadict_model['+Язык бараний (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Череп бараний (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

metadict_model['+Челюсть баранья (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

metadict_model['+Кости бараньи (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

#----
# Субпродукты коровьи, КРС:

metadict_model['+Жир говяжий почечный (доступно/килограмм)'] = {
        # Исправить
            # Это очень ценный нутряной жир
        '+Жир говяжий (доступно/килограмм)':1,
        }

metadict_model['+Жир говяжий с ливера (доступно/килограмм)'] = {
        '+Жир говяжий (доступно/килограмм)':1,
        }

metadict_model['+Жир говяжий прочий (доступно/килограмм)'] = {
        '+Жир говяжий (доступно/килограмм)':1,
        }

metadict_model['+Голова говяжья (доступно/килограмм)'] = {
        # Череп 350 кг коровы -- 4-5 кг.
        '+Череп говяжий (доступно/килограмм)':0.4,
        '+Челюсть говяжья (доступно/килограмм)':0.15,
        '+Субпродукты говяжьи (доступно/килограмм)':0.45,
        }

metadict_model['+Вымя говяжье (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Калтык говяжий (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Кишечник говяжий (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Книжка говяжья (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Кровь говяжья (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Лёгкие говяжьи (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Ноги с копытами говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Хвост говяжий (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Печень говяжья (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Пищевод говяжий (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Почки говяжьи (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Рога говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Рубец говяжий (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Сальник говяжий (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Селезёнка говяжья (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Сердце говяжье (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Диафрагма говяжья (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Сухожилия говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Сычуг говяжий (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Трахея говяжья (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Уши говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Шкура коровья (доступно/килограмм)'] = {
        # Выделанная шкура весит вдвое меньше.
        # Толщина 1-4 мм, площадь одной шкуры -- 2.5 кв.метра, плотность (сырой) -- 8-10 кг/кв.метр
        # Характеристика и классификация кожевенного сырья
            # https://vuzlit.ru/264222/harakteristika_klassifikatsiya_kozhevennogo_syrya
        '+Шкура коровья (доступно/штук)':0.10,
        }

metadict_model['+Язык говяжий (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Мозги говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Губы говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Череп говяжий (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

metadict_model['+Челюсть говяжья (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

metadict_model['+Кости говяжьи (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

#----
# Субпродукты куриные:

metadict_detail['+Голова куриная (доступно/килограмм)'] = {
        '+Субпродукты куриные (доступно/килограмм)':1,
        }

metadict_detail['+Жир куриный (доступно/килограмм)'] = {
        '+Субпродукты куриные (доступно/килограмм)':1,
        }

metadict_detail['+Мышечный желудок куриный (доступно/килограмм)'] = {
        '+Субпродукты куриные (доступно/килограмм)':1,
        }

metadict_detail['+Ноги куриные (доступно/килограмм)'] = {
        '+Субпродукты куриные (доступно/килограмм)':1,
        }

metadict_detail['+Печень куриная (доступно/килограмм)'] = {
        '+Субпродукты куриные (доступно/килограмм)':1,
        }

metadict_detail['+Шея куриная (доступно/килограмм)'] = {
        '+Субпродукты куриные (доступно/килограмм)':1,
        }

metadict_detail['+Кости куриные (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

#----
# Субпродукты рыбные:

metadict_model['+Кости рыбьи (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

#----
# Кожевенное сырьё:

metadict_model['+Шкура баранья (доступно/штук)'] = {
        '+Шкура баранья (доступно/квадратный метр)':0.6,
        }

metadict_model['+Шкура коровья (доступно/штук)'] = {
        '+Шкура коровья (доступно/квадратный метр)':2.5,
        }

#----
# Побочные продукты:

metadict_model['+Мезга овощная (доступно/килограмм)'] = {
        '+Пищевые отходы овощные (доступно/килограмм)':1,
        }

metadict_model['+Мезга виноградная (доступно/килограмм)'] = {
        '+Пищевые отходы фруктовые (доступно/килограмм)':1,
        }

metadict_model['+Мезга вишнёвая (доступно/килограмм)'] = {
        '+Пищевые отходы фруктовые (доступно/килограмм)':1,
        }

metadict_model['+Мезга гранатовая (доступно/килограмм)'] = {
        '+Пищевые отходы фруктовые (доступно/килограмм)':1,
        }

metadict_model['+Мезга яблочная (доступно/килограмм)'] = {
        '+Пищевые отходы фруктовые (доступно/килограмм)':1,
        }

metadict_model['+Отруби бобовые (доступно/килограмм)'] = {
        '+Пищевые отходы бобовые (доступно/килограмм)':1,
        }

metadict_model['+Отруби просяные (доступно/килограмм)'] = {
        '++Отруби зерновые (доступно/килограмм)':1,
        }

metadict_model['+Отруби пшеничные (доступно/килограмм)'] = {
        '++Отруби зерновые (доступно/килограмм)':1,
        }

metadict_model['+Отруби рисовые (доступно/килограмм)'] = {
        '++Отруби зерновые (доступно/килограмм)':1,
        }

metadict_model['+Отруби ячменные (доступно/килограмм)'] = {
        '++Отруби зерновые (доступно/килограмм)':1,
        }

metadict_model['+Маринад оливковый (доступно/килограмм)'] = {
        '+Маринад (доступно/килограмм)':1,
        }

metadict_model['+Маринад морковный (доступно/килограмм)'] = {
        '+Маринад (доступно/килограмм)':1,
        }

metadict_model['+Маринад овощной (доступно/килограмм)'] = {
        '+Маринад (доступно/килограмм)':1,
        }

metadict_model['+Сусло виноградное (доступно/килограмм)'] = {
        '+Сусло (доступно/килограмм)':1,
        }

metadict_model['+Сусло вишнёвое (доступно/килограмм)'] = {
        '+Сусло (доступно/килограмм)':1,
        }

metadict_model['+Масло снятое (доступно/килограмм)'] = {
        # От фритюра, от бульона на обжаренных овощах
        }

metadict_model['+Жир снятый (доступно/килограмм)'] = {
        # От бульонов, супов
        }

#----
# Мусор, компост:

metadict_model['+Маринад (доступно/килограмм)'] = {
        }

metadict_model['+Рассол (доступно/килограмм)'] = {
        }

metadict_model['+Сусло (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы мясные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы рыбные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы костные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы грибные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы корнеплодов (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы овощные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы ореховые (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы травяные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы фруктовые (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы бобовые (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы зерновые (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['++Отруби зерновые (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['++Пищевые отходы (доступно/килограмм)'] = {
        # Исправить
            # Уточни плотность в компостной яме.
        '++Пищевые отходы (доступно/кубометр)':1 / 700,
        }

metadict_model['++Солома сухая (доступно/килограмм)'] = {
        '++Солома сухая (доступно/кубометр)':1 / 50,
        }

metadict_model['++Пищевые отходы (доступно/кубометр)'] = {
        }

metadict_model['++Солома сухая (доступно/кубометр)'] = {
        }

#----
# Убираем лишние параметры из вывода (их можно вызвать по ключу -e)

metadict_model['--Питательные вещества (грамм)'] = {
        }

metadict_model['---Алкоголь (литров)'] = {
        }

metadict_model['-Уксусная кислота (грамм)'] = {
        }

#----
# Энергетическая ценность пищи:

metadict_detail['-Белки животные (грамм)'] = {
        '--Калорийность животных белков (килокалорий)':4,
        '-Белки (грамм)':1,
        }

metadict_detail['-Белки растительные (грамм)'] = {
        '--Калорийность растительных белков (килокалорий)':4,
        '-Белки (грамм)':1,
        }

metadict_detail['-Белки растительные для скота (грамм)'] = {
        '--Калорийность растительных белков для скота (килокалорий)':4,
        '-Белки для скота (грамм)':1,
        }

metadict_detail['-Жиры животные (грамм)'] = {
        '--Калорийность животных жиров (килокалорий)':9,
        '-Жиры (грамм)':1,
        }

metadict_detail['-Жиры растительные (грамм)'] = {
        '--Калорийность растительных жиров (килокалорий)':9,
        '-Жиры (грамм)':1,
        }

metadict_detail['-Жиры растительные для скота (грамм)'] = {
        '--Калорийность растительных жиров для скота (килокалорий)':9,
        '-Жиры для скота (грамм)':1,
        }

metadict_detail['-Углеводы животные (грамм)'] = {
        '--Калорийность животных углеводов (килокалорий)':4,
        '-Углеводы (грамм)':1,
        }

metadict_detail['-Углеводы растительные (грамм)'] = {
        '--Калорийность растительных углеводов (килокалорий)':4,
        '-Углеводы (грамм)':1,
        }

metadict_detail['-Углеводы растительные для скота (грамм)'] = {
        '--Калорийность растительных углеводов для скота (килокалорий)':4,
        '-Углеводы для скота (грамм)':1,
        }

#----
# Энергетическая ценность пищи:

metadict_detail['--Калорийность животных белков (килокалорий)'] = {
        '--Калорийность белков (килокалорий)':1,
        '--Калорийность животной пищи (килокалорий)':1,
        }

metadict_detail['--Калорийность животных жиров (килокалорий)'] = {
        '--Калорийность жиров (килокалорий)':1,
        '--Калорийность животной пищи (килокалорий)':1,
        }

metadict_detail['--Калорийность животных углеводов (килокалорий)'] = {
        '--Калорийность углеводов (килокалорий)':1,
        '--Калорийность животной пищи (килокалорий)':1,
        }

metadict_detail['--Калорийность растительных белков (килокалорий)'] = {
        '--Калорийность белков (килокалорий)':1,
        '--Калорийность растительной пищи (килокалорий)':1,
        }

metadict_detail['--Калорийность растительных углеводов (килокалорий)'] = {
        '--Калорийность углеводов (килокалорий)':1,
        '--Калорийность растительной пищи (килокалорий)':1,
        }

metadict_detail['--Калорийность растительных жиров (килокалорий)'] = {
        '--Калорийность жиров (килокалорий)':1,
        '--Калорийность растительной пищи (килокалорий)':1,
        }

metadict_detail['--Калорийность растительных белков для скота (килокалорий)'] = {
        '--Калорийность растительной пищи для скота (килокалорий)':1,
        }

metadict_detail['--Калорийность растительных жиров для скота (килокалорий)'] = {
        '--Калорийность растительной пищи для скота (килокалорий)':1,
        }

metadict_detail['--Калорийность растительных углеводов для скота (килокалорий)'] = {
        '--Калорийность растительной пищи для скота (килокалорий)':1,
        }

#----
# Энергетическая ценность пищи (убираем параметры):

metadict_detail['--Калорийность животной пищи (килокалорий)'] = {
        }

metadict_detail['--Калорийность растительной пищи (килокалорий)'] = {
        }

metadict_detail['--Калорийность растительной пищи для скота (килокалорий)'] = {
        }

#----
# Энергетическая ценность пищи:

metadict_model['-Белки (грамм)'] = {
        '--Питательные вещества (грамм)':1,
        }

metadict_model['-Белки для скота (грамм)'] = {
        #'--Питательные вещества (грамм)':1,
        }

metadict_model['-Жиры (грамм)'] = {
        '--Питательные вещества (грамм)':1,
        }

metadict_model['-Жиры для скота (грамм)'] = {
        #'--Питательные вещества (грамм)':1,
        }

metadict_model['-Углеводы (грамм)'] = {
        '--Питательные вещества (грамм)':1,
        }

metadict_model['-Углеводы для скота (грамм)'] = {
        #'--Питательные вещества (грамм)':1,
        }

metadict_model['-Этанол (грамм)'] = {
        '--Этанол (миллилитров)':1 / 0.7893,
        '--Калорийность этанола (килокалорий)':7.1,
        '--Питательные вещества (грамм)':1,
        }

#----
# Энергетическая ценность (группировка):

metadict_model['--Калорийность этанола (килокалорий)'] = {                                          
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_model['--Калорийность белков (килокалорий)'] = {
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_model['--Калорийность жиров (килокалорий)'] = {
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_model['--Калорийность углеводов (килокалорий)'] = {
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_model['---Калорийность пищи (килокалорий)'] = {
        '++Энергия пищи (килокалорий)':1,
        '++Энергия пищи (рационы 3000 ккал)':1/3000,
        }

metadict_model['++Энергия пищи (килокалорий)'] = {
        '++Энергия пищи (МДж)':4.1868 / 1000,
        }

metadict_model['++Энергия пищи (рационы 3000 ккал)'] = {
        '++Энергия пищи (месячные рационы)':1/30,
        '+++Энергия пищи (годовые рационы)':1/30/12,
        }

metadict_model['++Энергия пищи (МДж)'] = {
        }

#----
# Считаем потребление алкоголя:
    # https://ru.wikipedia.org/wiki/Этанол

metadict_model['--Этанол (миллилитров)'] = {
        '---Алкоголь (литров)':1 / 1000,
        }
