#----
# Обработка пищи (домашняя):

#----
# Готовые блюда (вариации):

metadict_detail['Рыба морская красная вяленая (килограмм)'] = {
        'Осётр вяленый (грамм)':500,
        'Севрюга вяленая (грамм)':300,
        'Белуга вяленая (грамм)':200,
        }

metadict_detail['Каша пшённая с фруктами (килограмм)'] = {
        'Каша пшённая на молоке (грамм)':700,
        'Фрукты закавказские летние (грамм)':300,
        }

metadict_detail['Каша пшённая с изюмом (килограмм)'] = {
        'Каша пшённая на молоке (грамм)':900,
        'Виноград сушёный (грамм)':100,
        }

metadict_detail['Лаваш пшеничный с пряной зеленью (килограмм)'] = {
        'Лаваш пшеничный (грамм)':900,
        'Зелень пряная шинкованная (грамм)':100,
        }

#----
# Готовые блюда (сыры):

metadict_detail['Сыр овечий толчёный с травами (килограмм)'] = {
        # Мята, тархун, чабер (вместо перца) -- основные местные пряности
        'Сыр овечий рассольный (грамм)':900,
        'Зелень мяты отборная (грамм)':50,
        'Зелень эстрагона отборная (грамм)':30,
        'Зелень чабера отборная (грамм)':20,
        '_-Протирание сыра в ступе (килограмм)':1,
        }

metadict_detail['Сыр овечий толчёный с чесноком (килограмм)'] = {
        # Моретум.
        'Сыр овечий рассольный (грамм)':700,
        'Чеснок давленый (грамм)':140,
        'Масло оливковое (грамм)':40,
        'Уксус виноградный 6% (грамм)':20,
        'Зелень пряная шинкованная (грамм)':100,
        '_-Протирание сыра в ступе (килограмм)':1,
        }

#----
# Готовые блюда (варка в большой воде):

metadict_detail['Хинкали с телятиной варёные (килограмм)'] = {
        # Исправить
            # Хау, воду не сливают после каждого килограмма.
        'Хинкали с телятиной (грамм)':1300,
        'Соль поваренная (грамм)':5,
        'Вода кипячёная в котелке (грамм)':3100,
        '_-Варка хинкали в котелке (килограмм)':3.6,
        '-Испарение воды в котле (килограмм)':0.3,
        }

#----
# Готовые блюда (мясо-мучные):

metadict_detail['Хинкали с телятиной (килограмм)'] = {
        # Блюдо 17-18 века. Раньше кусочки теста и мясо варили отдельно.
        'Тесто пшеничное бездрожжевое для лаваша (грамм)':500,
        'Фарш телячий для хинкали (грамм)':500,
        '_-Подготовка теста для хинкали (килограмм)':0.5,
        '_-Фаршировка теста для хинкали (килограмм)':1.0,
        }

#----
# Готовые блюда (мясо):

metadict_detail['Заливное из говяжьих ног (килограмм)'] = {
        # Хаш
            # Варят 8-12 часов в несолёной воде.
        'Говяжьи субпродукты варёные (грамм)':300,
        'Ноги говяжьи нарубленные (грамм)':300,
        'Ливер говяжий нарезанный (грамм)':300,
        'Лук чищеный (грамм)':100,
        'Вода для готовки (грамм)':4000,
        '_-Варка хаша в котелке (килограмм)':5.0,
        '-Испарение воды в котле (килограмм)':4.0,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Говяжьи субпродукты варёные (килограмм)'] = {
        # Рубец нужно варить отдельно, сливая воду каждые 10 минут (5 раз)
        # Либо отскоблить и промыть в проточной воде.
        'Говяжьи субпродукты для хаша (грамм)':1500,
        'Вода для готовки (грамм)':5700,
        '_-Варка субпродуктов в котелке (килограмм)':7.2,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':6.6,
        }

metadict_detail['Баранина запечённая с ливером, луком и пряностями (килограмм)'] = {
        # Каурма пастушеская -- баранина с курдючным жиром и пряностями,
            # Запекается 6 часов в вывернутой шкуре барана, в яме под костром.
            # Почки, сердце, печень -- весь ливер туда же. 50% ливера, 50% мяса.
            # Зелень кориандра, петрушка, укроп -- в равных пропорциях.
        'Баранина нарезанная (грамм)':500,
        'Ливер бараний нарезанный (грамм)':500,
        'Лук шинкованный (грамм)':150,
        'Зелень пряная шинкованная (грамм)':100,
        'Жир бараний курдючный (грамм)':50,
        'Перец чёрный молотый (грамм)':3,
        'Соль поваренная (грамм)':5,
        '_-Запекание баранины в шкуре барана (килограмм)':1.3,
        '-Испарение воды на костре (килограмм)':0.3,
        '-Кипячение воды на костре (килограмм)':1,
        }

#----
# Готовые блюда (рыба):

metadict_detail['Форель фаршированная рисом и изюмом (килограмм)'] = {
        # Исправить
            # Допилить
            # Без имбиря не то.
        # Кутап
        'Форель филе (грамм)':500,
        'Рис варёный (грамм)':350,
        'Виноград сушёный (грамм)':100,
        'Зелень пряная шинкованная (грамм)':50,
        'Перец чёрный молотый (грамм)':2,
        'Соль поваренная (грамм)':5,
        '_-Фаршировка рыбы (килограмм)':1.3,
        '_-Запекание рыбы на костре (килограмм)':1.3,
        '-Испарение воды на костре (килограмм)':0.3,
        '-Кипячение воды на костре (килограмм)':1,
        }

#----
# Готовые блюда (фрукты):

metadict_detail['Фрукты закавказские летние (килограмм)'] = {
        # Исправить
            # Уточнить сезонность
            # Алыча (ткемали), слива, груша, яблоки, инжир, гранат.
        'Виноград отборный (грамм)':200,
        'Яблоко чищеное (грамм)':200,
        'Алыча отборная (грамм)':100,
        'Инжир отборный (грамм)':100,
        'Груша чищеная (грамм)':200,
        'Слива чищеная (грамм)':100,
        'Гранат чищеный (грамм)':100,
        }

#----
# Готовые блюда (супы):

metadict_detail['Суп из баранины с чечевицей и пряностями (килограмм)'] = {
        # Бозбаш, суп из баранины и дроблёной крупы.
        'Баранина нарезанная варёная обжаренная (грамм)':250,
        'Морковь шинкованная обжаренная (грамм)':100,
        'Лук шинкованный обжаренный (грамм)':100,
        'Чечевица варёная (грамм)':100,
        'Алыча сушёная (грамм)':30,
        'Соль поваренная (грамм)':5,
        'Перец чёрный молотый (грамм)':2,
        'Пряности хмели-сунели (грамм)':5,
        #'Зелень базилика сушёная (грамм)':3,
        #'Зелень чабреца сушёная (грамм)':3,
        'Бульон мясной бараний (грамм)':600,
        '_-Проваривание супа в котелке (килограмм)':1.2,
        '-Испарение воды в котле (килограмм)':0.2,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Суп из баранины с рисом и зеленью (килограмм)'] = {
        'Баранина нарезанная варёная обжаренная (грамм)':250,
        'Лук шинкованный обжаренный (грамм)':200,
        'Рис замоченный (грамм)':100,
        'Зелень пряная шинкованная (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Перец чёрный молотый (грамм)':2,
        'Пряности хмели-сунели (грамм)':5,
        'Бульон мясной бараний (грамм)':600,
        '_-Проваривание супа в котелке (килограмм)':1.2,
        '-Испарение воды в котле (килограмм)':0.2,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Суп из курицы с яичной заправкой (килограмм)'] = {
        # Чихиртма
            # Куры беспородные, с жёстким мясом. Только варить.
        'Курица нарезанная варёная (грамм)':250,
        'Яйцо куриное взбитое с солью и уксусом (грамм)':200,
        'Лук шинкованный обжаренный (грамм)':150,
        'Мука пшеничная прокаленная (грамм)':25,
        'Зелень пряная шинкованная (грамм)':50,
        'Перец чёрный молотый (грамм)':2,
        'Пряности хмели-сунели (грамм)':5,
        'Бульон мясной куриный (грамм)':500,
        '_-Проваривание супа в котелке (килограмм)':1.1,
        '-Испарение воды в котле (килограмм)':0.1,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Суп чечевичный на молоке (килограмм)'] = {
        'Чечевица замоченная (грамм)':400,
        'Овощи пряные шинкованные обжаренные (грамм)':200,
        'Масло сливочное коровье (грамм)':25,
        'Зелень пряная сушёная (грамм)':5,
        'Семена кориандра (грамм)':1,
        'Семена зиры (грамм)':1,
        'Вода для готовки (грамм)':300,
        'Молоко коровье кислое (грамм)':400,
        '_-Варка чечевицы в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Суп чечевичный на сыворотке (килограмм)'] = {
        'Чечевица замоченная (грамм)':400,
        'Овощи пряные шинкованные обжаренные (грамм)':200,
        'Масло оливковое (грамм)':25,
        'Зелень пряная сушёная (грамм)':5,
        'Семена кориандра (грамм)':1,
        'Семена зиры (грамм)':1,
        'Вода для готовки (грамм)':300,
        'Сыворотка творожная коровья (грамм)':400,
        '_-Варка чечевицы в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Суп-пюре чечевичный с пряной зеленью (килограмм)'] = {
        # Исправить
            # Сделай ароматизированное масло
            # Да и с пряностями уточни.
        'Чечевица замоченная (грамм)':400,
        'Овощи пряные шинкованные обжаренные (грамм)':100,
        'Зелень пряная сушёная (грамм)':5,
        'Семена кориандра (грамм)':1,
        'Семена зиры (грамм)':1,
        'Соль поваренная (грамм)':5,
        'Масло оливковое (грамм)':50,
        'Вода для готовки (грамм)':700,
        '_-Протирание бобов в ступе (килограмм)':0.4,
        '_-Варка чечевицы в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Суп-пюре нутовый с пряной зеленью (килограмм)'] = {
        'Нут замоченный (грамм)':400,
        'Овощи пряные шинкованные обжаренные (грамм)':100,
        'Зелень пряная сушёная (грамм)':5,
        'Семена кориандра (грамм)':1,
        'Семена зиры (грамм)':1,
        'Соль поваренная (грамм)':5,
        'Масло оливковое (грамм)':50,
        'Вода для готовки (грамм)':700,
        '_-Протирание бобов в ступе (килограмм)':0.4,
        '_-Варка чечевицы в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Суп крупяно-бобовый с грецкими орехами (килограмм)'] = {
        # Зернушка
            # http://www.rus-food-recipes.ru/P_6/1/19.htm
        'Крупа пшеничная варёная (грамм)':200,
        'Нут варёный (грамм)':100,
        'Горох варёный (грамм)':100,
        'Чечевица варёная (грамм)':100,
        'Орех грецкий толчёный (грамм)':25,
        'Лук шинкованный обжаренный (грамм)':50,
        'Мука пшеничная прокаленная (грамм)':25,
        'Масло оливковое (грамм)':25,
        'Зелень базилика сушёная (грамм)':5,
        'Зелень чабера сушёная (грамм)':5,
        'Зелень мяты сушёная (грамм)':2,
        'Вода для готовки (грамм)':500,
        '_-Проваривание супа в котелке (килограмм)':1.1,
        '-Испарение воды в котле (килограмм)':0.1,
        '-Кипячение воды в котле (килограмм)':1,
        }

#----
# Готовые блюда (каши):

metadict_detail['Каша пшеничная с говядиной (килограмм)'] = {
        # Армянская хариса (ариса)
            # Варится 7 часов (чтобы пшеница разварилась)
        'Крупа пшеничная замоченная (грамм)':350,
        'Говядина нарезанная (грамм)':200,
        'Масло сливочное коровье (грамм)':25,
        'Зелень пряная сушёная (грамм)':10,
        'Соль поваренная (грамм)':7,
        'Вода для готовки (грамм)':1500,
        '_-Варка пшеничной каши в котелке (килограмм)':2.1,
        '-Испарение воды в котле (килограмм)':1.1,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша пшеничная с бараниной (килограмм)'] = {
        # Армянская хариса (ариса)
            # Варится 7 часов (чтобы пшеница разварилась)
        'Крупа пшеничная замоченная (грамм)':350,
        'Баранина нарезанная (грамм)':200,
        'Зелень пряная сушёная (грамм)':10,
        'Соль поваренная (грамм)':7,
        'Вода для готовки (грамм)':1500,
        '_-Варка пшеничной каши в котелке (килограмм)':2.1,
        '-Испарение воды в котле (килограмм)':1.1,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша перловая с рыбой и овощами (килограмм)'] = {
        # Исправить
            # Рыбу не мешало бы порезать. Да и лучше копчёную взять.
        'Крупа перловая замоченная прокаленная (грамм)':300,
        'Овощи пряные шинкованные обжаренные (грамм)':300,
        'Рыба морская красная вяленая (грамм)':100,
        'Гранат чищеный (грамм)':50,
        'Семена зиры (грамм)':3,
        'Зелень пряная сушёная (грамм)':3,
        'Вода для готовки (грамм)':1000,
        '_-Варка перловой каши в котелке (килограмм)':1.6,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша перловая с овощами (килограмм)'] = {
        'Крупа перловая замоченная прокаленная (грамм)':300,
        'Овощи пряные шинкованные обжаренные (грамм)':300,
        'Гранат чищеный (грамм)':50,
        'Масло оливковое (грамм)':25,
        'Семена зиры (грамм)':3,
        'Зелень пряная сушёная (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '_-Варка перловой каши в котелке (килограмм)':1.6,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша перловая с бараниной (килограмм)'] = {
        # Шавля
        'Крупа перловая замоченная прокаленная (грамм)':300,
        'Баранина нарезанная припущенная обжаренная (грамм)':100,
        'Овощи пряные шинкованные обжаренные (грамм)':100,
        'Алыча сушёная (грамм)':15,
        'Семена зиры (грамм)':3,
        'Зелень пряная сушёная (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':750,
        'Бульон костный бараний (грамм)':250,
        '_-Варка перловой каши в котелке (килограмм)':1.6,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша перловая с солониной (килограмм)'] = {
        'Крупа перловая замоченная прокаленная (грамм)':300,
        'Говядина нарезанная солёная тушёная (грамм)':100,
        'Овощи пряные шинкованные обжаренные (грамм)':100,
        'Алыча сушёная (грамм)':15,
        'Семена зиры (грамм)':3,
        'Зелень пряная сушёная (грамм)':3,
        'Вода для готовки (грамм)':750,
        'Бульон костный говяжий (грамм)':250,
        '_-Варка перловой каши в котелке (килограмм)':1.6,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша перловая с говядиной и овощами (килограмм)'] = {
        'Крупа перловая замоченная прокаленная (грамм)':300,
        'Говядина нарезанная припущенная обжаренная (грамм)':100,
        'Овощи пряные шинкованные обжаренные (грамм)':300,
        'Алыча сушёная (грамм)':15,
        'Семена зиры (грамм)':3,
        'Зелень пряная сушёная (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':750,
        'Бульон костный говяжий (грамм)':250,
        '_-Варка перловой каши в котелке (килограмм)':1.6,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша перловая с телятиной и овощами (килограмм)'] = {
        # Осень, много овощей
        'Крупа перловая замоченная прокаленная (грамм)':300,
        'Телятина нарезанная припущенная обжаренная (грамм)':100,
        'Овощи пряные шинкованные обжаренные (грамм)':300,
        'Алыча отборная (грамм)':60,
        'Семена зиры (грамм)':3,
        'Зелень пряная сушёная (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':900,
        '_-Варка перловой каши в котелке (килограмм)':1.6,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша рисовая с телятиной и овощами (килограмм)'] = {
        # Нет, не плов, тоже шавля
        'Рис замоченный (грамм)':300,
        'Телятина нарезанная припущенная обжаренная (грамм)':100,
        'Овощи пряные шинкованные обжаренные (грамм)':300,
        'Гранат чищеный (грамм)':50,
        'Семена зиры (грамм)':3,
        'Зелень пряная сушёная (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':600,
        '_-Тушение риса в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша пшённая на молоке (килограмм)'] = {
        'Крупа пшённая промытая (грамм)':300,
        'Масло сливочное коровье (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Молоко коровье снятое (грамм)':1000,
        '_-Варка пшённой каши в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша ячнево-гороховая (килограмм)'] = {
        # Кашица костромская:
            # http://www.rus-food-recipes.ru/P_1/104.htm
        'Крупа ячневая промытая (грамм)':150,
        'Горох варёный (грамм)':300,
        'Лук шинкованный (грамм)':100,
        'Масло оливковое (грамм)':25,
        'Соль поваренная (грамм)':7,
        'Тимьян сушёный (грамм)':1,
        'Зелень чабера сушёная (грамм)':1,
        'Вода для готовки (грамм)':700,
        '_-Перебор крупы (килограмм)':0.15,
        '_-Промывание крупы (килограмм)':0.15,
        '_-Варка ячневой каши в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша ячневая со сливочным маслом (килограмм)'] = {
        'Крупа ячневая промытая (грамм)':300,
        'Масло сливочное коровье (грамм)':25,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '_-Варка ячневой каши в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша ячневая с овощами (килограмм)'] = {
        'Крупа ячневая промытая (грамм)':300,
        'Овощи пряные шинкованные обжаренные (грамм)':200,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':800,
        '_-Варка ячневой каши в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша ячневая с рыбой и овощами (килограмм)'] = {
        # Исправить
            # Рыбу не мешало бы порезать. Да и лучше копчёную взять.
        'Крупа ячневая промытая (грамм)':300,
        'Овощи пряные шинкованные обжаренные (грамм)':300,
        'Рыба морская красная вяленая (грамм)':100,
        'Семена зиры (грамм)':3,
        'Зелень пряная сушёная (грамм)':3,
        'Вода для готовки (грамм)':1000,
        '_-Варка перловой каши в котелке (килограмм)':1.6,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша ячневая (килограмм)'] = {
        'Крупа ячневая промытая (грамм)':300,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '_-Варка ячневой каши в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

#----
# Готовые блюда (овощные):

metadict_detail['Капуста тушёная с пряным соусом (килограмм)'] = {
        # Пхали
        'Капуста тушёная (грамм)':800,
        'Соус пряный с грецкими орехами (грамм)':150,
        'Гранат чищеный (грамм)':50,
        '_-Смешивание салата в миске (килограмм)':1,
        }

metadict_detail['Зелень весенняя с пряным соусом (килограмм)'] = {
        'Зелень весенняя бланшированная шинкованная (грамм)':800,
        'Соус пряный с грецкими орехами (грамм)':200,
        '_-Смешивание салата в миске (килограмм)':1,
        }

#----
# Готовые блюда (хлеб):

metadict_detail['Лаваш пшеничный (килограмм)'] = {
        # Лаваш, маца, chapati
        'Тесто пшеничное бездрожжевое для лаваша (грамм)':1200,
        '_-Подготовка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка лепёшек в тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Лепёшки пшеничные с овечьим сыром (килограмм)'] = {
        # Исправить
            # Сыр слишком солёный, нужно замочить.
            # Можно выпекать на костре, в глиняном блюде, накрыв его вторым и раскалённым углём.
        # Хачапури с сыром (имеретинские, на тонком тесте)
            # http://www.rus-food-recipes.ru/P_7/1/44.htm
        'Тесто пшеничное бездрожжевое для хачапури (грамм)':600,
        'Начинка для лепёшек на овечьем сыре (грамм)':600,
        '_-Подготовка теста для лепёшек (килограмм)':0.6,
        '_-Фаршировка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка лепёшек в тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Лепёшки пшеничные с творогом (килограмм)'] = {
        # Хачапури (хачо -- творог, пури -- хлеб)
        'Тесто пшеничное бездрожжевое для хачапури (грамм)':600,
        'Начинка для лепёшек на твороге (грамм)':600,
        '_-Подготовка теста для лепёшек (килограмм)':0.6,
        '_-Фаршировка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка лепёшек в тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Лепёшки пшеничные на сыворотке (килограмм)'] = {
        'Тесто пшеничное бездрожжевое на сыворотке (грамм)':1200,
        '_-Подготовка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка лепёшек в тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Лепёшки пшеничные с изюмом (килограмм)'] = {
        'Тесто пшеничное бездрожжевое на сыворотке (грамм)':1100,
        'Виноград сушёный (грамм)':100,
        '_-Подготовка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка лепёшек в тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Лепёшки ячменно-пшеничные на сыворотке (килограмм)'] = {
        # Пресная лепешка из ячменной муки на простокваше (1840-е годы) 
            # https://cook-weekend.blogspot.com/2011/07/1840.html
        'Тесто ячменно-пшеничное бездрожжевое на сыворотке (грамм)':1200,
        '_-Подготовка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка лепёшек в тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

#----
# Готовые блюда (выпечка):

metadict_detail['Пирог закрытый с творогом, зеленью и яйцом (килограмм)'] = {
        # Выпекают в двух глиняных сковородах (кеци), на кострище, присыпав раскалённым углём.
        'Тесто пшеничное бездрожжевое на кислом молоке (грамм)':600,
        'Начинка на твороге с зеленью и яйцом (грамм)':600,
        '_-Подготовка теста для лепёшек (килограмм)':0.6,
        '_-Фаршировка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка пирогов на тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Пирог закрытый с овечьим сыром и черемшой (килограмм)'] = {
        # Давонджин
        'Тесто пшеничное бездрожжевое на кислом молоке (грамм)':600,
        'Начинка из овечьего сыра с черемшой (грамм)':600,
        '_-Подготовка теста для лепёшек (килограмм)':0.6,
        '_-Фаршировка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка пирогов на тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Пирог закрытый с капустой и грецкими орехами (килограмм)'] = {
        # Кабускаджын
        'Тесто пшеничное бездрожжевое на кислом молоке (грамм)':600,
        'Начинка капустная с грецкими орехами (грамм)':600,
        '_-Подготовка теста для лепёшек (килограмм)':0.6,
        '_-Фаршировка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка пирогов на тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Пирог закрытый со сливками и зелёным горошком (килограмм)'] = {
        'Тесто пшеничное бездрожжевое на кислом молоке (грамм)':600,
        'Зелёный горошек протёртый тушёный в сливках (грамм)':600,
        '_-Подготовка теста для лепёшек (килограмм)':0.6,
        '_-Фаршировка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка пирогов на тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Пирог закрытый с бараниной (килограмм)'] = {
        # Фыдджин
        'Тесто пшеничное бездрожжевое с яйцом (грамм)':600,
        'Начинка из баранины с луком и пряностями (грамм)':600,
        '_-Подготовка теста для лепёшек (килограмм)':0.6,
        '_-Фаршировка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка пирогов на тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

#----
# Тепловая обработка (сладости):

metadict_detail['Чурчхела с грецкими орехами (килограмм)'] = {
        'Сок виноградный уваренный с мукой (грамм)':800,
        'Орех грецкий чищенный (грамм)':400,
        '_-Приготовление чурчхелы (килограмм)':1,
        '-Испарение воды на воздухе (килограмм)':0.2,
        }

metadict_detail['Козинаки медовые с грецкими орехами (килограмм)'] = {
        # Гозинаки
        'Орех грецкий шинкованный обжаренный (грамм)':500,
        'Карамель медовая (грамм)':600,
        '_-Уваривание мёда в сотейнике (килограмм)':1.1,
        '_-Раскатка и нарезка теста (килограмм)':1,
        '-Испарение воды в печи (килограмм)':0.1,
        '-Кипячение воды в печи (килограмм)':1,
        }

#----
# Готовые блюда (напитки):

metadict_detail['Вино красное разбавленное (килограмм)'] = {
        # Венеция 14 век, галерная мастерская (Арсенал), 1700 рабочих, раздавали вино разбавленное 1:2
            # https://antoin.livejournal.com/866393.html
        'Вино красное сухое (грамм)':333,
        'Вода кипячёная в котелке (грамм)':666,
        }

#----
# Ингредиенты (сыры):

metadict_detail['Сыр овечий рассольный (килограмм)'] = {
        # Нужен сучужный фермент (из отдела желудка овец/ягнят)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Брынза
            # https://ru.wikisource.org/wiki/ЭСБЕ/Сыры_и_сыроварение
        # 5 литров овечьего молока на килограмм сыра.
        # Вымешивают сгусток 30 минут, затем прессуют.
        # Рассол 20%, 5 суток.
        'Молоко овечье (грамм)':5000,
        'Рассол 20% (грамм)':500,
        '+Сыворотка творожная овечья (доступно/килограмм)':4,
        '_~Молоко овечье (створаживание/грамм)':5000,
        }

#----
# Ингредиенты (творог):

metadict_detail['Творог коровий (килограмм)'] = {
        # Из простокваши, нагрев при T 80-100°C в течении 3 часов.
        'Молоко коровье кислое (грамм)':8000,
        '_~Молоко коровье кислое (створаживание/грамм)':8000,
        '+Сыворотка творожная коровья (доступно/килограмм)':7,
        }

#----
# Ингредиенты (масло):

metadict_detail['Масло сливочное коровье (килограмм)'] = {
        # Пахта по составу то же снятое молоко (хотя вкус и другой)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Масло_коровье
        'Сливки коровьи (грамм)':4000,
        #'+Пахта сливочная коровья (доступно/килограмм)':3,
        '+Молоко коровье снятое (доступно/килограмм)':3,
        '_~Сливки коровьи (сепарация/грамм)':4000,
        }

#----
# Ингредиенты (кисломолочные):

metadict_detail['Молоко коровье кислое (килограмм)'] = {
        'Молоко коровье снятое (грамм)':1000,
        }

#----
# Ингредиенты (сливки):

metadict_detail['Сливки коровьи (килограмм)'] = {
        # Жирность снятого молока -- 1%
        # https://ru.wikisource.org/wiki/ЭСБЕ/Сливки
        'Молоко коровье (грамм)':6500,
        '+Молоко коровье снятое (доступно/килограмм)':5.5,
        '_~Молоко коровье (сепарация/грамм)':6500,
        }

#----
# Ингредиенты (спиртовое брожение):

metadict_detail['Уксус виноградный 3% (килограмм)'] = {
        'Уксус виноградный 6% (грамм)':500,
        'Вода кипячёная в котелке (грамм)':500,
        '_-Вымешивание раствора в миске (килограмм)':1,
        }

metadict_detail['Уксус виноградный 6% (килограмм)'] = {
        'Вино красное сухое (грамм)':1000,
        #'|=Бочка виноградного уксуса (килограмм)':1,
        '_~Вино красное сухое (окисление/грамм)':1000,
        }

metadict_detail['Вино красное сухое (килограмм)'] = {
        # Нормы технологического проектирования винодельческих заводов по переработке винограда:
            # http://xcook.info/product/krasnoe-suhoe-vino.html
            # http://www.norm-load.ru/SNiP/Data1/9/9947/index.htm#i831023
            # https://ru.wikisource.org/wiki/ЭСБЕ/Виноделие
        'Виноград отборный (грамм)':2000,
        '_-Приготовление вина (килограмм)':2,
        '_~Сусло виноградное (спиртовое брожение/грамм)':2000,
        '_~Сусло виноградное (фильтрация/грамм)':2000,
        '+Сусло виноградное (доступно/килограмм)':1,
        }

metadict_detail['Вино белое сухое (килограмм)'] = {
        # Вино окрашивает кожица ягод, так что сорт может быть тот же.
        'Виноград отборный (грамм)':2000,
        '_-Приготовление вина (килограмм)':2,
        '_~Сусло виноградное (спиртовое брожение/грамм)':2000,
        '_~Сусло виноградное (фильтрация/грамм)':2000,
        '+Сусло виноградное (доступно/килограмм)':1,
        }

#----
# Ингредиенты (соусы):

metadict_detail['Соус алычовый (килограмм)'] = {
        # Исправить
            # Без красного перца так себе
            # А с чабером и вовсе другое.
        # Ткемали
        'Алыча уваренная протёртая (грамм)':600,
        'Зелень мяты отборная (грамм)':100,
        'Зелень укропа отборная (грамм)':100,
        'Зелень кориандра отборная (грамм)':100,
        'Зелень чабера отборная (грамм)':50,
        'Чеснок давленый (грамм)':30,
        'Семена зиры (грамм)':5,
        'Семена кориандра (грамм)':3,
        'Соль поваренная (грамм)':10,
        '_-Вымешивание пасты в миске (килограмм)':1,
        }

metadict_detail['Соус пряный с грецкими орехами (килограмм)'] = {
        'Орех грецкий толчёный (грамм)':400,
        'Уксус виноградный 6% (грамм)':150,
        'Чеснок давленый (грамм)':150,
        'Зелень пряная шинкованная (грамм)':250,
        'Пряности хмели-сунели (грамм)':10,
        'Соль поваренная (грамм)':25,
        '_-Вымешивание пасты в миске (килограмм)':1,
        }

#----
# Ингредиенты (суповые заправки):

metadict_detail['Яйцо куриное взбитое с солью и уксусом (килограмм)'] = {
        'Яйцо куриное (грамм)':650,
        'Соль поваренная (грамм)':30,
        'Уксус виноградный 3% (грамм)':320,
        '_-Взбивание яйца (килограмм)':1.0,
        }

#----
# Ингредиенты (начинки):

metadict_detail['Начинка для лепёшек на овечьем сыре (килограмм)'] = {
        # Исправить
            # Сыр слишком солёный, нужно замочить.
        'Сыр овечий рассольный (грамм)':800,
        'Масло оливковое (грамм)':100,
        'Яйцо куриное (грамм)':100,
        '_-Протирание начинки в ступе (килограмм)':1,
        }

metadict_detail['Начинка для лепёшек на твороге (килограмм)'] = {
        'Творог коровий (грамм)':800,
        'Масло сливочное коровье (грамм)':100,
        'Яйцо куриное (грамм)':100,
        '_-Протирание начинки в ступе (килограмм)':1,
        }

metadict_detail['Начинка на твороге с зеленью и яйцом (килограмм)'] = {
        'Творог коровий (грамм)':300,
        'Зелень весенняя бланшированная шинкованная (грамм)':300,
        'Зелень пряная шинкованная (грамм)':100,
        'Зелень лука шинкованная (грамм)':150,
        'Масло оливковое (грамм)':50,
        'Яйцо куриное (грамм)':100,
        'Чеснок давленый (грамм)':15,
        'Соль поваренная (грамм)':5,
        '_-Протирание начинки в ступе (килограмм)':1,
        }

metadict_detail['Начинка капустная с грецкими орехами (килограмм)'] = {
        'Капуста тушёная (грамм)':900,
        'Орех грецкий толчёный (грамм)':75,
        'Масло сливочное коровье (грамм)':25,
        'Зелень чабреца сушёная (грамм)':3,
        'Зелень чабера сушёная (грамм)':3,
        '_-Протирание начинки в ступе (килограмм)':1,
        }

metadict_detail['Начинка из баранины с луком и пряностями (килограмм)'] = {
        'Баранина шинкованная (грамм)':600,
        'Бульон костный бараний (грамм)':200,
        'Лук шинкованный (грамм)':200,
        'Чеснок давленый (грамм)':25,
        'Перец чёрный молотый (грамм)':5,
        'Соль поваренная (грамм)':5,
        }

metadict_detail['Начинка из овечьего сыра с черемшой (килограмм)'] = {
        'Сыр овечий рассольный (грамм)':500,
        'Черемша бланшированная (грамм)':500,
        '_-Шинковка зелени (килограмм)':1,
        }

metadict_detail['Фарш телячий для хинкали (килограмм)'] = {
        'Телятина шинкованная (грамм)':600,
        'Лук шинкованный (грамм)':100,
        'Зелень пряная сушёная (грамм)':10,
        'Перец чёрный молотый (грамм)':5,
        'Соль поваренная (грамм)':7,
        'Вода для готовки (грамм)':300,
        '_-Вымешивание фарша в миске (килограмм)':1,
        }

#----
# Ингредиенты (зелень):

metadict_detail['Зелень пряная сушёная (килограмм)'] = {
        # Исправить
            # Перенеси в пряности
        'Зелень укропа сушёная (грамм)':1000 / 11,
        'Зелень фенхеля сушёная (грамм)':1000 / 11,
        'Зелень петрушки сушёная (грамм)':1000 / 11,
        'Зелень сельдерея сушёная (грамм)':1000 / 11,
        'Зелень эстрагона сушёная (грамм)':1000 / 11,
        'Зелень кориандра сушёная (грамм)':1000 / 11,
        'Зелень базилика сушёная (грамм)':1000 / 11,
        'Зелень чабреца сушёная (грамм)':1000 / 11,
        'Зелень чабера сушёная (грамм)':1000 / 11,
        'Зелень мяты сушёная (грамм)':1000 / 11,
        'Лист лавра сушёный (грамм)':1000 / 11,
        }

metadict_detail['Зелень весенняя бланшированная шинкованная (килограмм)'] = {
        # Всё, что можно собрать на лугу.
        'Черемша бланшированная (грамм)':1000 / 7,
        'Шпинат бланшированный (грамм)':1000 / 7,
        'Щавель бланшированный (грамм)':1000 / 7,
        'Крапива бланшированная (грамм)':1000 / 7,
        'Лебеда бланшированная (грамм)':1000 / 7,
        'Сныть бланшированная (грамм)':1000 / 7,
        'Ботва свекольная бланшированная (грамм)':1000 / 7,
        '_-Шинковка зелени (килограмм)':1,
        }

metadict_detail['Зелень пряная шинкованная (килограмм)'] = {
        # Исправить
            # Сезоны разные
            # Предполагается, что это дикоросы.
        'Зелень кресса отборная (грамм)':1000 / 13,
        'Зелень укропа отборная (грамм)':1000 / 13,
        'Зелень фенхеля отборная (грамм)':1000 / 13,
        'Зелень петрушки отборная (грамм)':1000 / 13,
        'Зелень базилика отборная (грамм)':1000 / 13,
        'Зелень сельдерея отборная (грамм)':1000 / 13,
        'Зелень кориандра отборная (грамм)':1000 / 13,
        'Зелень эстрагона отборная (грамм)':1000 / 13,
        'Зелень мелиссы отборная (грамм)':1000 / 13,
        'Зелень кервеля отборная (грамм)':1000 / 13,
        'Зелень руколы отборная (грамм)':1000 / 13,
        'Зелень чабера отборная (грамм)':1000 / 13,
        'Зелень мяты отборная (грамм)':1000 / 13,
        '_-Шинковка зелени (килограмм)':1,
        }

#----
# Ингредиенты (бланширование):

metadict_detail['Шпинат бланшированный (килограмм)'] = {
        'Шпинат отборный (грамм)':1000,
        'Вода кипячёная в котелке (грамм)':1000,
        '_-Бланширование зелени в котелке (килограмм)':2,
        '-Кипячение воды в котле (килограмм)':0.2,
        }

metadict_detail['Щавель бланшированный (килограмм)'] = {
        'Щавель отборный (грамм)':1000,
        'Вода кипячёная в котелке (грамм)':1000,
        '_-Бланширование зелени в котелке (килограмм)':2,
        '-Кипячение воды в котле (килограмм)':0.2,
        }

metadict_detail['Крапива бланшированная (килограмм)'] = {
        'Крапива отборная (грамм)':1000,
        'Вода кипячёная в котелке (грамм)':1000,
        '_-Бланширование зелени в котелке (килограмм)':2,
        '-Кипячение воды в котле (килограмм)':0.2,
        }

metadict_detail['Черемша бланшированная (килограмм)'] = {
        'Черемша отборная (грамм)':1000,
        'Вода кипячёная в котелке (грамм)':1000,
        '_-Бланширование зелени в котелке (килограмм)':2,
        '-Кипячение воды в котле (килограмм)':0.2,
        }

metadict_detail['Сныть бланшированная (килограмм)'] = {
        'Сныть отборная (грамм)':1000,
        'Вода кипячёная в котелке (грамм)':1000,
        '_-Бланширование зелени в котелке (килограмм)':2,
        '-Кипячение воды в котле (килограмм)':0.2,
        }

metadict_detail['Лебеда бланшированная (килограмм)'] = {
        'Лебеда отборная (грамм)':1000,
        'Вода кипячёная в котелке (грамм)':1000,
        '_-Бланширование зелени в котелке (килограмм)':2,
        '-Кипячение воды в котле (килограмм)':0.2,
        }

metadict_detail['Ботва свекольная бланшированная (килограмм)'] = {
        'Ботва свекольная отборная (грамм)':1000,
        'Вода кипячёная в котелке (грамм)':1000,
        '_-Бланширование зелени в котелке (килограмм)':2,
        '-Кипячение воды в котле (килограмм)':0.2,
        }

#----
# Ингредиенты (тушение):

metadict_detail['Капуста тушёная (килограмм)'] = {
        'Капуста шинкованная (грамм)':850,
        'Лук шинкованный обжаренный (грамм)':200,
        'Соль поваренная (грамм)':5,
        'Уксус виноградный 3% (грамм)':30,
        'Вода для готовки (грамм)':200,
        '_-Тушение овощей в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Зелёный горошек протёртый тушёный в сливках (килограмм)'] = {
        'Горошек зелёный (грамм)':950,
        'Зелень мяты отборная (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Сливки коровьи (грамм)':300,
        '_-Тушение овощей в котелке (килограмм)':1.3,
        '_-Протирание бобов в ступе (килограмм)':1.0,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1,
        }

#----
# Ингредиенты (тесто):

metadict_detail['Тесто пшеничное бездрожжевое для лаваша (килограмм)'] = {
        # Влажность теста -- 60%; горячая вода;
        # Вымешивать -- 5 минут; расстойка -- 30 минут;
        'Мука пшеничная (грамм)':620,
        'Соль поваренная (грамм)':10,
        'Вода кипячёная в котелке (грамм)':380,
        '_-Приготовление бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшеничное бездрожжевое с яйцом (килограмм)'] = {
        'Мука пшеничная (грамм)':660,
        'Соль поваренная (грамм)':10,
        'Яйцо куриное (грамм)':50,
        'Вода кипячёная в котелке (грамм)':280,
        '_-Приготовление бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшеничное бездрожжевое на сыворотке (килограмм)'] = {
        'Мука пшеничная (грамм)':620,
        'Соль поваренная (грамм)':10,
        'Сыворотка творожная коровья (грамм)':380,
        '_-Приготовление бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшеничное бездрожжевое на кислом молоке (килограмм)'] = {
        # Исправить
            # Вообще-то готовят без дрожжей, но опарным способом.
        'Мука пшеничная (грамм)':660,
        'Соль поваренная (грамм)':5,
        'Масло сливочное коровье (грамм)':25,
        'Молоко коровье кислое (грамм)':310,
        '_-Приготовление бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшеничное бездрожжевое для хачапури (килограмм)'] = {
        # Жидковатое тесто для тонких лепёшек. Готовятся подобно пицце, под раскалённым сводом.
            # Можно добавить ложку поташа, тогда тесто поднимется.
        'Мука пшеничная (грамм)':450,
        'Соль поваренная (грамм)':10,
        'Масло сливочное коровье (грамм)':50,
        'Молоко коровье кислое (грамм)':500,
        '_-Приготовление бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто ячменно-пшеничное бездрожжевое на сыворотке (килограмм)'] = {
        'Мука пшеничная (грамм)':320,
        'Мука ячменная (грамм)':300,
        'Соль поваренная (грамм)':10,
        'Сыворотка творожная коровья (грамм)':380,
        '_-Приготовление бездрожжевого теста (килограмм)':1,
        }

#----
# Ингредиенты (рассолы):

metadict_detail['Рассол 20% (килограмм)'] = {
        'Соль поваренная (грамм)':200,
        'Вода для готовки (грамм)':800,
        }

#----
# Ингредиенты (варка бобов и зерна):

metadict_detail['Горох варёный (килограмм)'] = {
        'Горох замоченный (грамм)':700,
        'Вода для готовки (грамм)':1500,
        '_-Варка гороха в котелке (килограмм)':2.2,
        #'+Бульон бобовый (доступно/килограмм)':0.7,
        '-Испарение воды в котле (килограмм)':0.5,
        '-Кипячение воды в котле (килограмм)':1.7,
        }

metadict_detail['Чечевица варёная (килограмм)'] = {
        'Чечевица замоченная (грамм)':800,
        'Вода для готовки (грамм)':1200,
        '_-Варка чечевицы в котелке (килограмм)':2.0,
        #'+Бульон бобовый (доступно/килограмм)':0.5,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.5,
        }

metadict_detail['Нут варёный (килограмм)'] = {
        'Нут замоченный (грамм)':800,
        'Вода для готовки (грамм)':1200,
        '_-Варка нута в котелке (килограмм)':2.0,
        #'+Бульон бобовый (доступно/килограмм)':0.5,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.5,
        }

metadict_detail['Крупа пшеничная варёная (килограмм)'] = {
        'Крупа пшеничная замоченная (грамм)':800,
        'Вода для готовки (грамм)':1200,
        '_-Варка пшеницы в котелке (килограмм)':2.0,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.5,
        }

metadict_detail['Рис варёный (килограмм)'] = {
        'Рис нешлифованный (грамм)':330,
        'Вода кипячёная в котелке (грамм)':2000,
        '_-Перебор крупы (килограмм)':0.33,
        '_-Промывание крупы (килограмм)':0.33,
        '_-Варка риса в котелке (килограмм)':2.5,
        '-Испарение воды в котле (килограмм)':0.1,
        }

#----
# Ингредиенты (бульоны):

metadict_detail['Бульон костный бараний (килограмм)'] = {
        # The Professional Chef/The Culinary Institute of America. - 8th ed. стр 368
        'Кости бараньи запечённые (грамм)':500,
        'Овощи пряные шинкованные запечённые (грамм)':100,
        'Пряности букета гарни с петрушкой (грамм)':10,
        'Лист лавра сушёный (грамм)':0.6,
        'Вино красное сухое (грамм)':100,
        'Вода для готовки (грамм)':1300,
        '_-Варка костного бульона в котелке (килограмм)':2,
        '_-Процеживание бульона через мешок (килограмм)':1.5,
        '-Испарение воды в котле (килограмм)':0.5,
        '-Кипячение воды в котле (килограмм)':1.5,
        '_~Кости бараньи (фильтрация/грамм)':500,
        '_~Овощи пряные шинкованные запечённые (фильтрация/грамм)':100,
        '_~Пряности букета гарни (фильтрация/грамм)':10,
        '+Мезга овощная (доступно/килограмм)':0.1,
        }

metadict_detail['Бульон костный говяжий (килограмм)'] = {
        'Кости говяжьи запечённые (грамм)':500,
        'Овощи пряные шинкованные запечённые (грамм)':100,
        'Пряности букета гарни с петрушкой (грамм)':10,
        'Лист лавра сушёный (грамм)':0.6,
        'Вино красное сухое (грамм)':100,
        'Вода для готовки (грамм)':1300,
        '_-Варка костного бульона в котелке (килограмм)':2,
        '_-Процеживание бульона через мешок (килограмм)':1.5,
        '-Испарение воды в котле (килограмм)':0.5,
        '-Кипячение воды в котле (килограмм)':1.5,
        '_~Кости бараньи (фильтрация/грамм)':500,
        '_~Овощи пряные шинкованные запечённые (фильтрация/грамм)':100,
        '_~Пряности букета гарни (фильтрация/грамм)':10,
        '+Мезга овощная (доступно/килограмм)':0.1,
        }

#----
# Ингредиенты (наборы):

metadict_detail['Говяжьи субпродукты для хаша (килограмм)'] = {
        'Рубец говяжий чищенный (грамм)':520,
        'Книжка говяжья чищенная (грамм)':200,
        'Вымя говяжье чищенное (грамм)':100,
        'Сычуг говяжий чищенный (грамм)':70,
        'Хвост говяжий чищенный (грамм)':50,
        'Уши говяжьи чищенные (грамм)':50,
        }

metadict_detail['Овощи пряные шинкованные обжаренные (килограмм)'] = {
        # Для каши, плова
        'Морковь шинкованная обжаренная (грамм)':500,
        'Лук шинкованный обжаренный (грамм)':400,
        'Чеснок давленый обжаренный (грамм)':100,
        }

metadict_detail['Овощи пряные шинкованные запечённые (килограмм)'] = {
        # Мирпуа. Запекают на мангале, чтобы усилить вкус:
            # https://en.wikipedia.org/wiki/Mirepoix_(cuisine)
            # The Professional Chef/The Culinary Institute of America. - 8th ed. стр 356
        'Морковь шинкованная печёная (грамм)':500,
        'Лук шинкованный печёный (грамм)':400,
        'Чеснок чищеный печёный (грамм)':100,
        }

#----
# Ингредиенты (запекание):

metadict_detail['Кости бараньи запечённые (килограмм)'] = {
        'Кости бараньи (грамм)':1100,
        '_-Запекание костей на противене (килограмм)':1.1,
        '-Испарение воды на очаге (килограмм)':0.1,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Кости говяжьи запечённые (килограмм)'] = {
        'Кости говяжьи (грамм)':1100,
        '_-Запекание костей на противене (килограмм)':1.1,
        '-Испарение воды на очаге (килограмм)':0.1,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Морковь шинкованная печёная (килограмм)'] = {
        'Морковь шинкованная (грамм)':1300,
        '_-Запекание корнеплодов на противене (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Лук шинкованный печёный (килограмм)'] = {
        'Лук шинкованный (грамм)':1300,
        '_-Запекание овощей на противене (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Чеснок чищеный печёный (килограмм)'] = {
        'Чеснок чищеный (грамм)':1300,
        '_-Запекание овощей на противене (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

#----
# Ингредиенты (обжаривание):

metadict_detail['Баранина нарезанная варёная обжаренная (килограмм)'] = {
        'Баранина нарезанная варёная (грамм)':1200,
        'Жир бараний курдючный топлёный (грамм)':50,
        '_-Обжаривание мяса в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Баранина нарезанная припущенная обжаренная (килограмм)'] = {
        'Баранина нарезанная припущенная (грамм)':1200,
        'Жир бараний курдючный топлёный (грамм)':50,
        '_-Обжаривание мяса в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Говядина нарезанная припущенная обжаренная (килограмм)'] = {
        # Исправить
            # Скорее уж солонина.
            # Можно использовать нутряной/почечный жир (или сохранить для более ценных блюд)
            # Льняное масло нефильтрованное, нужно прокаливать.
        'Говядина нарезанная припущенная (грамм)':1200,
        'Масло оливковое (грамм)':50,
        '_-Обжаривание мяса в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Телятина нарезанная припущенная обжаренная (килограмм)'] = {
        'Телятина нарезанная припущенная (грамм)':1200,
        'Масло оливковое (грамм)':50,
        '_-Обжаривание мяса в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Лук шинкованный обжаренный (килограмм)'] = {
        # Масло отчаянно экономим. Нужно вдвое больше
        'Лук шинкованный (грамм)':1200,
        'Масло оливковое (грамм)':50,
        '_-Обжаривание овощей в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Чеснок давленый обжаренный (килограмм)'] = {
        'Чеснок давленый (грамм)':1000,
        'Масло оливковое (грамм)':50,
        '_-Обжаривание овощей в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Морковь шинкованная обжаренная (килограмм)'] = {
        'Морковь шинкованная (грамм)':1200,
        'Масло оливковое (грамм)':50,
        '_-Шинковка овощей (килограмм)':1.2,
        '_-Обжаривание овощей в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Орех грецкий шинкованный обжаренный (килограмм)'] = {
        'Орех грецкий шинкованный (грамм)':1000,
        '_-Обжаривание орехов в казане (килограмм)':1.0,
        '-Испарение воды на очаге (килограмм)':0.0,
        '-Кипячение воды на очаге (килограмм)':1,
        }

#----
# Ингредиенты (варка):

metadict_detail['Баранина нарезанная варёная (килограмм)'] = {
        'Баранина нарезанная (грамм)':1500,
        'Вода для готовки (грамм)':2500,
        '+Бульон мясной бараний (доступно/килограмм)':2.0,
        '_-Варка мяса в котелке (килограмм)':4.0,
        '-Испарение воды в котле (килограмм)':1.0,
        '-Кипячение воды в котле (килограмм)':3.0,
        '_~Баранина нарезанная (варка/грамм)':1500,
        }

metadict_detail['Курица нарезанная варёная (килограмм)'] = {
        'Курица нарезанная (грамм)':1500,
        'Вода для готовки (грамм)':2500,
        '+Бульон мясной куриный (доступно/килограмм)':2.0,
        '_-Варка мяса в котелке (килограмм)':4.0,
        '-Испарение воды в котле (килограмм)':1.0,
        '-Кипячение воды в котле (килограмм)':3.0,
        '_~Курица нарезанная (варка/грамм)':1500,
        }

#----
# Ингредиенты (припускание, тушение):

metadict_detail['Говядина нарезанная солёная тушёная (килограмм)'] = {
        # Мясо зрелого животного -- 60 минут.
        'Говядина нарезанная солёная замоченная (грамм)':1300,
        'Вода для готовки (грамм)':500,
        '_-Тушение мяса в котле (килограмм)':1.8,
        '-Испарение воды в котле (килограмм)':0.8,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Баранина нарезанная припущенная (килограмм)'] = {
        # Мясо зрелого животного -- 60 минут.
        'Баранина нарезанная (грамм)':1300,
        'Вода для готовки (грамм)':200,
        '_-Припускание мяса в казане (килограмм)':1.5,
        '-Испарение воды на очаге (килограмм)':0.5,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Говядина нарезанная припущенная (килограмм)'] = {
        'Говядина нарезанная (грамм)':1300,
        'Вода для готовки (грамм)':200,
        '_-Припускание мяса в казане (килограмм)':1.5,
        '-Испарение воды на очаге (килограмм)':0.5,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Телятина нарезанная припущенная (килограмм)'] = {
        'Телятина нарезанная (грамм)':1300,
        'Вода для готовки (грамм)':200,
        '_-Припускание мяса в казане (килограмм)':1.5,
        '-Испарение воды на очаге (килограмм)':0.5,
        '-Кипячение воды на очаге (килограмм)':1,
        }

#----
# Ингредиенты (прокаливание):

metadict_detail['Мука пшеничная прокаленная (килограмм)'] = {
        'Мука пшеничная (грамм)':1000,
        '_-Прокаливание муки на сковороде (килограмм)':1,
        }

metadict_detail['Крупа перловая замоченная прокаленная (килограмм)'] = {
        'Крупа перловая замоченная (грамм)':1100,
        '_-Прокаливание крупы на сковороде (килограмм)':1.1,
        }

metadict_detail['Масло льняное прокаленное (килограмм)'] = {
        # Исправить
            # Не используется
        # Фильтровать не умеют, прокаливают. На слабейшем огне, не менее часа.
        'Масло льняное (грамм)':1000,
        '_-Прокаливание масла на сковороде (килограмм)':1.0,
        }

#----
# Ингредиенты (карамель):

metadict_detail['Карамель медовая (килограмм)'] = {
        'Мёд луговой (грамм)':1200,
        '_-Уваривание мёда в сотейнике (килограмм)':1.2,
        '-Испарение воды в котле (килограмм)':0.2,
        '-Кипячение воды в котле (килограмм)':1,
        }

#----
# Ингредиенты (вытапливание):

metadict_detail['Жир бараний курдючный топлёный (килограмм)'] = {
        'Жир бараний курдючный (грамм)':1100,
        '_-Вытапливание жира в казане (килограмм)':1.1,
        '_~Жир бараний курдючный (фильтрация/грамм)':1100,
        }

#----
# Ингредиенты (уваривание):

metadict_detail['Сок виноградный уваренный с мукой (килограмм)'] = {
        # Татара, пеламуши, пекмез
        'Сок виноградный (грамм)':2700,
        'Мука пшеничная (грамм)':300,
        '_-Уваривание виноградного сока в котле (килограмм)':3,
        '-Испарение воды в котле (килограмм)':2,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Алыча уваренная протёртая (килограмм)'] = {
        'Алыча отборная (грамм)':2000,
        '_-Уваривание фруктов в котелке (килограмм)':2,
        '_-Протирание фруктов в ступе (килограмм)':1,
        '-Испарение воды в котле (килограмм)':2,
        '-Кипячение воды в котле (килограмм)':1,
        }

#----
# Ингредиенты (отжим):

metadict_detail['Сок гранатовый (килограмм)'] = {
        'Гранат отборный (грамм)':2000,
        '_-Отжим фруктов (килограмм)':2,
        '_~Гранат отборный (фильтрация/грамм)':2000,
        '+Мезга гранатовая (доступно/килограмм)':1,
        }

metadict_detail['Сок виноградный (килограмм)'] = {
        # Исправить
            # Из залитого водой жмыха можно сделать ещё немного браги.
            # Виноградные выжимку сушат и на корм скоту
        'Виноград отборный (грамм)':1500,
        '_-Отжим фруктов (килограмм)':1.5,
        '_~Виноград отборный (фильтрация/грамм)':1500,
        '+Мезга виноградная (доступно/килограмм)':1,
        }

#----
# Ингредиенты (помол):

metadict_detail['Перец чёрный молотый (килограмм)'] = {
        'Перец чёрный сушёный (грамм)':1000,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

#----
# Ингредиенты (измельчение):

metadict_detail['Ливер бараний нарезанный (килограмм)'] = {
        'Рубец бараний чищенный (грамм)':320,
        'Печень баранья чищенная (грамм)':230,
        'Лёгкие бараньи чищенные (грамм)':180,
        'Сердце баранье чищенное (грамм)':100,
        'Диафрагма баранья чищенная (грамм)':70,
        'Селезёнка баранья чищенная (грамм)':50,
        'Почки бараньи чищенные (грамм)':50,
        '_-Нарезка мяса (килограмм)':1,
        }

metadict_detail['Ливер говяжий нарезанный (килограмм)'] = {
        'Печень говяжья чищенная (грамм)':350,
        'Лёгкие говяжьи чищенные (грамм)':230,
        'Сердце говяжье чищенное (грамм)':150,
        'Диафрагма говяжья чищенная (грамм)':120,
        'Селезёнка говяжья чищенная (грамм)':60,
        'Почки говяжьи чищенные (грамм)':90,
        '_-Нарезка мяса (килограмм)':1,
        }

metadict_detail['Ноги говяжьи нарубленные (килограмм)'] = {
        'Ноги говяжьи чищенные (грамм)':1000,
        '_-Нарезка мяса (килограмм)':1,
        }

metadict_detail['Орех грецкий шинкованный (килограмм)'] = {
        'Орех грецкий чищенный (грамм)':1000,
        '_-Шинковка орехов (килограмм)':1,
        }

metadict_detail['Орех грецкий толчёный (килограмм)'] = {
        'Орех грецкий чищенный (грамм)':1000,
        '_-Измельчение орехов в ступе (килограмм)':1,
        }

metadict_detail['Капуста шинкованная (килограмм)'] = {
        'Капуста чищеная (грамм)':1000,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Лук шинкованный (килограмм)'] = {
        'Лук чищеный (грамм)':1000,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Зелень лука шинкованная (килограмм)'] = {
        'Зелень лука отборная (грамм)':1000,
        '_-Шинковка зелени (килограмм)':1,
        }

metadict_detail['Морковь шинкованная (килограмм)'] = {
        'Морковь чищеная (грамм)':1000,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Чеснок давленый (килограмм)'] = {
        'Чеснок чищеный (грамм)':1000,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Баранина нарезанная (килограмм)'] = {
        'Баранина вырезка (грамм)':1000,
        '_-Нарезка мяса (килограмм)':1,
        }

metadict_detail['Курица нарезанная (килограмм)'] = {
        'Курица филе (грамм)':1000,
        '_-Нарезка мяса (килограмм)':1,
        }

metadict_detail['Баранина шинкованная (килограмм)'] = {
        'Баранина вырезка (грамм)':1000,
        '_-Шинковка мяса (килограмм)':1,
        }

metadict_detail['Говядина нарезанная (килограмм)'] = {
        'Говядина вырезка (грамм)':1000,
        '_-Нарезка мяса (килограмм)':1,
        }

metadict_detail['Телятина шинкованная (килограмм)'] = {
        'Телятина вырезка (грамм)':1000,
        '_-Шинковка мяса (килограмм)':1,
        }

metadict_detail['Телятина нарезанная (килограмм)'] = {
        'Телятина вырезка (грамм)':1000,
        '_-Нарезка мяса (килограмм)':1,
        }

#----
# Ингредиенты (замачивание, регидрация, проращивание):

metadict_detail['Говядина нарезанная солёная замоченная (килограмм)'] = {
        'Говядина нарезанная солёная (грамм)':700,
        'Вода для готовки (грамм)':2300,
        '_-Замачивание солонины (килограмм)':3,
        }

metadict_detail['Крупа перловая замоченная (килограмм)'] = {
        # Воду кипятят и сливают после нескольких часов замачивания
        'Крупа перловая (грамм)':700,
        'Вода кипячёная в котелке (грамм)':2300,
        '_-Перебор крупы (килограмм)':0.7,
        '_-Промывание крупы (килограмм)':0.7,
        '_-Замачивание зерна (килограмм)':3,
        }

metadict_detail['Крупа пшеничная замоченная (килограмм)'] = {
        'Крупа пшеничная (грамм)':700,
        'Вода для готовки (грамм)':2300,
        '_-Перебор зерна (килограмм)':0.7,
        '_-Замачивание зерна (килограмм)':3,
        }

metadict_detail['Рис замоченный (килограмм)'] = {
        # 100 грамм риса впитывают 50 мл воды при 60°C
        'Рис нешлифованный (грамм)':650,
        'Вода для готовки (грамм)':1000,
        '_-Перебор крупы (килограмм)':0.7,
        '_-Промывание крупы (килограмм)':0.7,
        '_-Замачивание риса (килограмм)':1.7,
        }

metadict_detail['Чечевица замоченная (килограмм)'] = {
        'Чечевица сухая (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Перебор бобов (килограмм)':0.5,
        '_-Замачивание бобов (килограмм)':1,
        }

metadict_detail['Горох замоченный (килограмм)'] = {
        'Горох сухой (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Перебор бобов (килограмм)':0.5,
        '_-Замачивание бобов (килограмм)':1,
        }

metadict_detail['Нут замоченный (килограмм)'] = {
        'Нут сухой (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Перебор бобов (килограмм)':0.5,
        '_-Замачивание бобов (килограмм)':1,
        }

#----
# Ингредиенты (соление):

metadict_detail['Говядина нарезанная солёная (килограмм)'] = {
        # Исправить
            # Допилить
            # Уточнить расход соли.
        # Солонина
        'Говядина нарезанная (грамм)':1500,
        'Соль поваренная (грамм)':200,
        '_-Соление мяса всухую (килограмм)':1.7,
        '-Испарение воды на воздухе (килограмм)':0.7,
        }

#----
# Ингредиенты (сушка на воздухе):

metadict_detail['Белуга вяленая (килограмм)'] = {
        # Исправить
            # Соль забыл. Уточни пропорции.
        'Белуга филе (грамм)':2000,
        '_-Вяление рыбы (килограмм)':2,
        '-Испарение воды на воздухе (килограмм)':1,
        }

metadict_detail['Осётр вяленый (килограмм)'] = {
        'Осётр филе (грамм)':2000,
        '_-Вяление рыбы (килограмм)':2,
        '-Испарение воды на воздухе (килограмм)':1,
        }

metadict_detail['Севрюга вяленая (килограмм)'] = {
        'Севрюга филе (грамм)':2000,
        '_-Вяление рыбы (килограмм)':2,
        '-Испарение воды на воздухе (килограмм)':1,
        }

metadict_detail['Алыча сушёная (килограмм)'] = {
        'Алыча отборная (грамм)':4000,
        '_-Сушка фруктов (килограмм)':4,
        '-Испарение воды на воздухе (килограмм)':4,
        }

metadict_detail['Виноград сушёный (килограмм)'] = {
        'Виноград отборный (грамм)':4000,
        '_-Сушка ягод (килограмм)':4,
        '-Испарение воды на воздухе (килограмм)':4,
        #'|=Бочка изюма (килограмм)':1,
        }

#----
# Ингредиенты (специи сушёные):

metadict_detail['Лист малины сушёный (килограмм)'] = {
        'Лист малины отборный (грамм)':10000,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Лист рябины сушёный (килограмм)'] = {
        'Лист рябины отборный (грамм)':10000,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Лист шиповника сушёный (килограмм)'] = {
        'Лист шиповника отборный (грамм)':10000,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень эстрагона сушёная (килограмм)'] = {
        # Тархун
        'Зелень эстрагона отборная (грамм)':11000,
        '_-Сушка трав (килограмм)':11,
        '-Испарение воды на воздухе (килограмм)':11,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Чеснок сушёный (килограмм)'] = {
        'Чеснок чищеный (грамм)':2300,
        '_-Нарезка овощей (килограмм)':2.3,
        '_-Сушка овощей (килограмм)':2.3,
        '-Испарение воды на воздухе (килограмм)':2.3,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Лук сушёный (килограмм)'] = {
        'Лук чищеный (грамм)':4600,
        '_-Нарезка овощей (килограмм)':4.6,
        '_-Сушка овощей (килограмм)':4.6,
        '-Испарение воды на воздухе (килограмм)':4.6,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень чабера сушёная (килограмм)'] = {
        'Зелень чабера отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень кориандра сушёная (килограмм)'] = {
        'Зелень кориандра отборная (грамм)':10000,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень фенугрека сушёная (килограмм)'] = {
        'Зелень фенугрека отборная (грамм)':10000,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень петрушки сушёная (килограмм)'] = {
        'Зелень петрушки отборная (грамм)':6000,
        '_-Сушка трав (килограмм)':6,
        '-Испарение воды на воздухе (килограмм)':6,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень укропа сушёная (килограмм)'] = {
        'Зелень укропа отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень сельдерея сушёная (килограмм)'] = {
        'Зелень сельдерея отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Крапива сушёная (килограмм)'] = {
        'Крапива отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лаванда сушёная (килограмм)'] = {
        'Лаванда отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Любисток сушёный (килограмм)'] = {
        'Любисток отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Зелень чабреца сушёная (килограмм)'] = {
        'Зелень чабреца отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Зелень руколы сушёная (килограмм)'] = {
        'Зелень руколы отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Зелень фенхеля сушёная (килограмм)'] = {
        'Зелень фенхеля отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Таволга сушёная (килограмм)'] = {
        'Таволга отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Иссоп сушёный (килограмм)'] = {
        'Иссоп отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Зелень мяты сушёная (килограмм)'] = {
        'Зелень мяты отборная (грамм)':6000,
        '_-Сушка трав (килограмм)':6,
        '-Испарение воды на воздухе (килограмм)':6,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Зверобой сушёный (килограмм)'] = {
        'Зверобой отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Ромашка сушёная (килограмм)'] = {
        'Ромашка отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Кипрей сушёный (килограмм)'] = {
        # Иван-чай
        'Кипрей отборный (грамм)':5000,
        '_-Сушка трав (килограмм)':5,
        '-Испарение воды на воздухе (килограмм)':5,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Клевер сушёный (килограмм)'] = {
        'Клевер отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Одуванчик сушёный (килограмм)'] = {
        'Одуванчик чищеный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лист смородины сушёный (килограмм)'] = {
        'Лист смородины отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лист вишни сушёный (килограмм)'] = {
        'Лист вишни отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лист лавра сушёный (килограмм)'] = {
        'Лист лавра (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень базилика сушёная (килограмм)'] = {
        'Зелень базилика отборная (грамм)':8000,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Орегано сушёный (килограмм)'] = {
        # Душица
        'Орегано (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Тимьян сушёный (килограмм)'] = {
        'Тимьян (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Майоран сушёный (килограмм)'] = {
        'Майоран (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Розмарин сушёный (килограмм)'] = {
        'Розмарин (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Шалфей сушёный (килограмм)'] = {
        'Шалфей (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Мелисса сушёная (килограмм)'] = {
        'Зелень мелиссы отборная (грамм)':6000,
        '_-Сушка трав (килограмм)':6,
        '-Испарение воды на воздухе (килограмм)':6,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Паприка сушёная (килограмм)'] = {
        'Перец нежгучий отборный (грамм)':8000,
        '_-Сушка овощей (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Перец острый сушёный (килограмм)'] = {
        'Перец острый отборный (грамм)':8000,
        '_-Сушка овощей (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Шафран сушёный (килограмм)'] = {
        'Рыльца шафрана (килограмм)':10,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Лист карри сушёный (килограмм)'] = {
        'Лист карри (грамм)':6000,
        '_-Сушка трав (килограмм)':6,
        '-Испарение воды на воздухе (килограмм)':6,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Гвоздика сушёная (килограмм)'] = {
        'Гвоздика (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Перец душистый сушёный (килограмм)'] = {
        'Плоды пименты лекарственной (килограмм)':8,
        '_-Сушка фруктов (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Бадьян сушёный (килограмм)'] = {
        'Плоды бадьяна (килограмм)':8,
        '_-Сушка фруктов (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Перец чёрный сушёный (килограмм)'] = {
        'Плоды чёрного перца (килограмм)':8,
        '_-Сушка фруктов (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

#----
# Ингредиенты (чистка рыбы и мяса):

metadict_detail['Белуга филе (килограмм)'] = {
        'Туша белужья (килограмм)':1.2,
        '_-Разделка крупной рыбы (килограмм)':1.2,
        '+Кости рыбьи (доступно/килограмм)':0.2,
        }

metadict_detail['Осётр филе (килограмм)'] = {
        'Туша осетровая (килограмм)':1.2,
        '_-Разделка крупной рыбы (килограмм)':1.2,
        '+Кости рыбьи (доступно/килограмм)':0.2,
        }

metadict_detail['Севрюга филе (килограмм)'] = {
        'Туша севрюжья (килограмм)':1.2,
        '_-Разделка крупной рыбы (килограмм)':1.2,
        '+Кости рыбьи (доступно/килограмм)':0.2,
        }

metadict_detail['Форель филе (килограмм)'] = {
        'Туша форели (килограмм)':1.4,
        '_-Разделка мелкой рыбы (килограмм)':1.4,
        '+Кости рыбьи (доступно/килограмм)':0.5,
        }

metadict_detail['Курица филе (килограмм)'] = {
        'Туша куриная (килограмм)':1.5,
        '_-Разделка птицы (килограмм)':1.5,
        '+Кости куриные (доступно/килограмм)':0.5,
        }

metadict_detail['Баранина вырезка (килограмм)'] = {
        'Туша баранья (килограмм)':1.6,
        '_-Разделка мяса (килограмм)':1.6,
        '+Кости бараньи (доступно/килограмм)':0.6,
        }

metadict_detail['Говядина вырезка (килограмм)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Мясо
        'Туша говяжья (килограмм)':1.4,
        '_-Разделка мяса (килограмм)':1.4,
        '+Кости говяжьи (доступно/килограмм)':0.4,
        }

metadict_detail['Телятина вырезка (килограмм)'] = {
        'Туша телячья (килограмм)':1.5,
        '_-Разделка мяса (килограмм)':1.5,
        '+Кости говяжьи (доступно/килограмм)':0.5,
        }

#----
# Ингредиенты (ливер и субпродукты):

metadict_detail['Диафрагма баранья чищенная (килограмм)'] = {
        'Диафрагма баранья (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Лёгкие бараньи чищенные (килограмм)'] = {
        'Лёгкие бараньи (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Печень баранья чищенная (килограмм)'] = {
        'Печень баранья (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Почки бараньи чищенные (килограмм)'] = {
        'Почки бараньи (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Рубец бараний чищенный (килограмм)'] = {
        'Рубец бараний (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Селезёнка баранья чищенная (килограмм)'] = {
        'Селезёнка баранья (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Сердце баранье чищенное (килограмм)'] = {
        'Сердце баранье (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Вымя говяжье чищенное (килограмм)'] = {
        'Вымя говяжье (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Диафрагма говяжья чищенная (килограмм)'] = {
        'Диафрагма говяжья (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Книжка говяжья чищенная (килограмм)'] = {
        'Книжка говяжья (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Лёгкие говяжьи чищенные (килограмм)'] = {
        'Лёгкие говяжьи (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Ноги говяжьи чищенные (килограмм)'] = {
        'Ноги говяжьи (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Печень говяжья чищенная (килограмм)'] = {
        'Печень говяжья (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Почки говяжьи чищенные (килограмм)'] = {
        'Почки говяжьи (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Рубец говяжий чищенный (килограмм)'] = {
        'Рубец говяжий (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Селезёнка говяжья чищенная (килограмм)'] = {
        'Рубец говяжий (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Сердце говяжье чищенное (килограмм)'] = {
        'Сердце говяжье (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Сычуг говяжий чищенный (килограмм)'] = {
        'Сычуг говяжий (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Уши говяжьи чищенные (килограмм)'] = {
        'Уши говяжьи (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

metadict_detail['Хвост говяжий чищенный (килограмм)'] = {
        'Хвост говяжий (килограмм)':1.2,
        '_-Разделка ливера (килограмм)':1.2,
        '+Пищевые отходы мясные (доступно/килограмм)':0.2,
        }

#----
# Ингредиенты (промывание):

metadict_detail['Крупа пшённая промытая (килограмм)'] = {
        # Промывают кипятком
        'Крупа пшённая (грамм)':1000,
        'Вода кипячёная в котелке (грамм)':2000,
        '_-Перебор крупы (килограмм)':1,
        '_-Промывание крупы (килограмм)':3,
        }

metadict_detail['Крупа ячневая промытая (килограмм)'] = {
        'Крупа ячневая (грамм)':1000,
        'Вода для готовки (грамм)':2000,
        '_-Перебор крупы (килограмм)':1,
        '_-Промывание крупы (килограмм)':3,
        }

#----
# Ингредиенты (чистка):

metadict_detail['Капуста чищеная (килограмм)'] = {
        'Капуста белокочанная (килограмм)':1.25,
        '_-Чистка овощей (килограмм)':1.25,
        '+Пищевые отходы овощные (доступно/килограмм)':0.25,
        }

metadict_detail['Лук чищеный (килограмм)'] = {
        'Лук репчатый (килограмм)':1.3,
        '_-Чистка корнеплодов (килограмм)':1.3,
        '+Пищевые отходы овощные (доступно/килограмм)':0.3,
        }

metadict_detail['Морковь чищеная (килограмм)'] = {
        'Морковь (килограмм)':1.3,
        '_-Чистка корнеплодов (килограмм)':1.3,
        '+Пищевые отходы корнеплодов (доступно/килограмм)':0.3,
        }

metadict_detail['Чеснок чищеный (килограмм)'] = {
        'Чеснок (килограмм)':1.3,
        '_-Чистка овощей (килограмм)':1.3,
        '+Пищевые отходы овощные (доступно/килограмм)':0.3,
        }

metadict_detail['Яблоко чищеное (килограмм)'] = {
        'Яблоко (килограмм)':1.5,
        '_-Чистка фруктов (килограмм)':1.5,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.5,
        }

metadict_detail['Слива чищеная (килограмм)'] = {
        'Слива (килограмм)':1.3,
        '_-Чистка фруктов (килограмм)':1.3,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.3,
        }

metadict_detail['Гранат чищеный (килограмм)'] = {
        'Гранат (килограмм)':1.8,
        '_-Чистка фруктов (килограмм)':1.8,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.8,
        }

metadict_detail['Груша чищеная (килограмм)'] = {
        'Груша (килограмм)':1.3,
        '_-Чистка фруктов (килограмм)':1.3,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.3,
        }

metadict_detail['Миндаль чищенный (килограмм)'] = {
        # Миндаль нужно залить кипятком и просушить, чтобы снять шкурку
        'Орех миндаля (килограмм)':1.3,
        'Вода кипячёная в котелке (грамм)':1000,
        '_-Чистка орехов (килограмм)':1.3,
        '+Пищевые отходы ореховые (доступно/килограмм)':0.3,
        '_-Бланширование орехов в котелке (килограмм)':1,
        }

metadict_detail['Орех грецкий чищенный (килограмм)'] = {
        'Орех грецкий (килограмм)':1.3,
        '_-Чистка орехов (килограмм)':1.3,
        '+Пищевые отходы ореховые (доступно/килограмм)':0.3,
        }


#----
# Ингредиенты (отбор):

metadict_detail['Инжир отборный (килограмм)'] = {
        'Инжир (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

#----
# Ингредиенты (отбор):

metadict_detail['Рыльца шафрана (килограмм)'] = {
        # Килограмм рылец шафрана = 80 000 цветов
        # Много ручной работы -- 2-12 тысяч евро/килограмм (2016 год)
            # https://en.wikipedia.org/wiki/Saffron
        'Цветы шафрана (килограмм)':100,
        '_-Перебор трав (килограмм)':100,
        '+Пищевые отходы травяные (доступно/килограмм)':99,
        }

metadict_detail['Корень имбиря отборный (килограмм)'] = {
        'Имбирь (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Корень куркумы (килограмм)'] = {
        # Исправить
            # Вспомни. Куркуму как-то обрабатывают, прежде чем применять.
            # И да, везде и повсюду используют её в порошке.
        'Куркума (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Корица палочкой (килограмм)'] = {
        'Корица (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист смородины отборный (килограмм)'] = {
        'Лист смородины (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист вишни отборный (килограмм)'] = {
        'Лист вишни (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист винограда отборный (килограмм)'] = {
        'Лист винограда (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист малины отборный (килограмм)'] = {
        'Лист малины (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист рябины отборный (килограмм)'] = {
        'Лист рябины (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист шиповника отборный (килограмм)'] = {
        'Лист шиповника (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист дуба отборный (килограмм)'] = {
        'Лист дуба (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист хрена отборный (килограмм)'] = {
        'Хрен (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень базилика отборная (килограмм)'] = {
        'Базилик (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень эстрагона отборная (килограмм)'] = {
        'Эстрагон (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень кервеля отборная (килограмм)'] = {
        'Кервель (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень кресса отборная (килограмм)'] = {
        'Кресс-салат (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Крапива отборная (килограмм)'] = {
        'Крапива (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Черемша отборная (килограмм)'] = {
        'Черемша (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лебеда отборная (килограмм)'] = {
        'Лебеда отборная (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Сныть отборная (килограмм)'] = {
        'Сныть отборная (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Щавель отборный (килограмм)'] = {
        'Щавель (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Шпинат отборный (килограмм)'] = {
        'Шпинат (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Салат-латук отборный (килограмм)'] = {
        'Латук посевной (килограмм)':1.2,
        '_-Чистка овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень фенхеля отборная (килограмм)'] = {
        'Фенхель (килограмм)':1.2,
        '_-Чистка овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }

metadict_detail['Ботва свекольная отборная (килограмм)'] = {
        'Ботва свекольная (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Ботва морковная отборная (килограмм)'] = {
        'Ботва морковная (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень сельдерея отборная (килограмм)'] = {
        'Сельдерей (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень мелиссы отборная (килограмм)'] = {
        'Мелисса (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень петрушки отборная (килограмм)'] = {
        'Петрушка (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень кориандра отборная (килограмм)'] = {
        'Кориандр (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень фенугрека отборная (килограмм)'] = {
        'Фенугрек (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень чабера отборная (килограмм)'] = {
        'Чабер (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Земляника отборная (килограмм)'] = {
        'Земляника (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Гранат отборный (килограмм)'] = {
        'Гранат (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        }

metadict_detail['Лимон отборный (килограмм)'] = {
        'Лимон (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        }

metadict_detail['Зелень лука отборная (килограмм)'] = {
        'Лук зелёный (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Огурцы отборные (килограмм)'] = {
        'Огурцы (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Горошек зелёный (килограмм)'] = {
        # Молодой горох сладких сортов.
        'Бобы гороха в стручках (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Фасоль стручковая отборная (килограмм)'] = {
        'Бобы фасоли в стручках (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Фасоль свежая (килограмм)'] = {
        'Бобы фасоли в стручках (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Смородина отборная (килограмм)'] = {
        'Смородина (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Крыжовник отборный (килограмм)'] = {
        'Крыжовник (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Рябина отборная (килограмм)'] = {
        'Рябина (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Шиповник отборный (килограмм)'] = {
        'Шиповник (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Клюква отборная (килограмм)'] = {
        'Клюква (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Малина отборная (килограмм)'] = {
        'Малина (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Морошка отборная (килограмм)'] = {
        'Морошка (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Ревень отборный (килограмм)'] = {
        'Ревень (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Яблоко отборное (килограмм)'] = {
        'Яблоко (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        }

metadict_detail['Груша отборная (килограмм)'] = {
        'Груша (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        }

metadict_detail['Томаты отборные (килограмм)'] = {
        'Томаты (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }

metadict_detail['Артишоки отборные (килограмм)'] = {
        'Артишоки (килограмм)':1.2,
        '_-Чистка овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }

metadict_detail['Каперсы отборные (килограмм)'] = {
        'Каперсы (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень укропа отборная (килограмм)'] = {
        'Укроп (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Черника отборная (килограмм)'] = {
        'Черника (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Вишня отборная (килограмм)'] = {
        'Вишня (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Виноград отборный (килограмм)'] = {
        'Виноград (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Алыча отборная (килограмм)'] = {
        'Алыча (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Слива отборная (килограмм)'] = {
        'Слива (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Персик отборный (килограмм)'] = {
        'Персик (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Абрикос отборный (килограмм)'] = {
        'Абрикос (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Инжир отборный (килограмм)'] = {
        'Инжир (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Зверобой отборный (килограмм)'] = {
        'Зверобой (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Клевер отборный (килограмм)'] = {
        'Клевер (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Иссоп отборный (килограмм)'] = {
        'Иссоп (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Ромашка отборная (килограмм)'] = {
        'Ромашка (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Кипрей отборный (килограмм)'] = {
        'Кипрей (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Таволга отборная (килограмм)'] = {
        'Таволга (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень руколы отборная (килограмм)'] = {
        'Рукола (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень чабреца отборная (килограмм)'] = {
        'Чабрец (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень мяты отборная (килограмм)'] = {
        'Мята (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лаванда отборная (килограмм)'] = {
        'Лаванда (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Любисток отборный (килограмм)'] = {
        'Любисток (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Сморчки отборные (килограмм)'] = {
        'Сморчки (килограмм)':1.2,
        'Вода для готовки (грамм)':1000,
        'Соль поваренная (грамм)':10,
        '_-Перебор грибов (килограмм)':1.2,
        '_-Промывание грибов (килограмм)':1,
        '_-Замачивание грибов (килограмм)':2,
        '+Пищевые отходы грибные (доступно/килограмм)':0.2,
        }

metadict_detail['Вёшенки отборные (килограмм)'] = {
        'Вёшенки (килограмм)':1.2,
        'Вода для готовки (грамм)':1000,
        'Соль поваренная (грамм)':10,
        '_-Перебор грибов (килограмм)':1.2,
        '_-Замачивание грибов (килограмм)':2,
        '+Пищевые отходы грибные (доступно/килограмм)':0.2,
        }

metadict_detail['Морская капуста отборная (килограмм)'] = {
        'Морская капуста (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Перец острый отборный (килограмм)'] = {
        'Стручки острого перца (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }

metadict_detail['Перец нежгучий отборный (килограмм)'] = {
        'Стручки нежгучего перца (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }
