#----
# Потребление (пища):

metadict_army['Едоки-женщины (горожане)'] = {
        'Городской рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (горожане)'] = {
        'Городской рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-женщины (знатные)'] = {
        'Богатый рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (знатные)'] = {
        'Богатый рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (селяне)'] = {
        'Сельский рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (скотоводы)'] = {
        'Скотоводческий рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (рыбаки)'] = {
        'Рыбацкий рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-женщины (селяне)'] = {
        'Сельский рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-женщины (скотоводы)'] = {
        'Скотоводческий рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-женщины (рыбаки)'] = {
        'Рыбацкий рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-женщины (карлы)'] = {
        'Рабский рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (карлы)'] = {
        # Исправить
            # Карлов будем кормить рыбой и ячменём.
            # "Вино" из выжимок, пустой хлеб на завтрак, пустая каша на ужин.
        'Рабский рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-женщины (рабы)'] = {
        # Домашние рабы. Обычно их кормят из общего котла.
        'Сельский рацион (человек/год)':1 / 2,
        'Рабский рацион (человек/год)':1 / 2,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (рабы)'] = {
        'Сельский рацион (человек/год)':1 / 2,
        'Рабский рацион (человек/год)':1 / 2,
        '-Едоки':1,
        }
