#----
# Богатый рацион:

metadict_detail['Богатый рацион (человек/год)'] = {
        'Богатый весенний рацион (человек/день)':90,
        'Богатый летний рацион (человек/день)':90,
        'Богатый осенний рацион (человек/день)':90,
        'Богатый зимний рацион (человек/день)':90,
        }

#----
# Богатый рацион (времена года):

metadict_detail['Богатый весенний рацион (человек/день)'] = {
        'Городской весенний повседневный рацион (человек/день)':5 / 7,
        'Городской весенний праздничный рацион (человек/день)':2 / 7,
        }

metadict_detail['Богатый летний рацион (человек/день)'] = {
        'Городской летний повседневный рацион (человек/день)':5 / 7,
        'Городской летний праздничный рацион (человек/день)':2 / 7,
        }

metadict_detail['Богатый зимний рацион (человек/день)'] = {
        'Городской зимний повседневный рацион (человек/день)':5 / 7,
        'Городской зимний праздничный рацион (человек/день)':2 / 7,
        }

metadict_detail['Богатый осенний рацион (человек/день)'] = {
        'Городской осенний повседневный рацион (человек/день)':5 / 7,
        'Городской осенний праздничный рацион (человек/день)':2 / 7,
        }
