#----
# Сельский рацион:

metadict_detail['Сельский рацион (человек/год)'] = {
        'Сельский весенний рацион (человек/день)':90,
        'Сельский летний рацион (человек/день)':90,
        'Сельский осенний рацион (человек/день)':90,
        'Сельский зимний рацион (человек/день)':90,
        }

#----
# Сельский рацион (времена года):

metadict_detail['Сельский весенний рацион (человек/день)'] = {
        'Сельский весенний повседневный рацион (человек/день)':7 / 7,
        'Сельский весенний праздничный рацион (человек/день)':1 / 30,
        }

metadict_detail['Сельский летний рацион (человек/день)'] = {
        'Сельский летний повседневный рацион (человек/день)':7 / 7,
        'Сельский летний праздничный рацион (человек/день)':1 / 30,
        }

metadict_detail['Сельский зимний рацион (человек/день)'] = {
        'Сельский зимний повседневный рацион (человек/день)':7 / 7,
        'Сельский зимний праздничный рацион (человек/день)':1 / 30,
        }

metadict_detail['Сельский осенний рацион (человек/день)'] = {
        'Сельский осенний повседневный рацион (человек/день)':7 / 7,
        'Сельский осенний праздничный рацион (человек/день)':1 / 30,
        }

#----
# Сельский рацион (дни недели):

metadict_detail['Сельский весенний повседневный рацион (человек/день)'] = {
        'Сельский весенний повседневный завтрак':1,
        'Сельский весенний повседневный обед':1,
        'Сельский весенний повседневный ужин':1,
        }

metadict_detail['Сельский весенний праздничный рацион (человек/день)'] = {
        'Сельский весенний праздничный завтрак':1,
        'Сельский весенний праздничный обед':1,
        'Сельский весенний праздничный ужин':1,
        }

metadict_detail['Сельский зимний повседневный рацион (человек/день)'] = {
        'Сельский зимний повседневный завтрак':1,
        'Сельский зимний повседневный обед':1,
        'Сельский зимний повседневный ужин':1,
        }

metadict_detail['Сельский зимний праздничный рацион (человек/день)'] = {
        'Сельский зимний праздничный завтрак':1,
        'Сельский зимний праздничный обед':1,
        'Сельский зимний праздничный ужин':1,
        }

metadict_detail['Сельский летний повседневный рацион (человек/день)'] = {
        'Сельский летний повседневный завтрак':1,
        'Сельский летний повседневный обед':1,
        'Сельский летний повседневный ужин':1,
        }

metadict_detail['Сельский летний праздничный рацион (человек/день)'] = {
        'Сельский летний праздничный завтрак':1,
        'Сельский летний праздничный обед':1,
        'Сельский летний праздничный ужин':1,
        }

metadict_detail['Сельский осенний повседневный рацион (человек/день)'] = {
        'Сельский осенний повседневный завтрак':1,
        'Сельский осенний повседневный обед':1,
        'Сельский осенний повседневный ужин':1,
        }

metadict_detail['Сельский осенний праздничный рацион (человек/день)'] = {
        'Сельский осенний праздничный завтрак':1,
        'Сельский осенний праздничный обед':1,
        'Сельский осенний праздничный ужин':1,
        }

#----
# Сельский рацион (весна):
    # Март, апрель, май

metadict_detail['Сельский весенний повседневный завтрак'] = {
        'Капуста тушёная (грамм)':500,
        'Молоко коровье кислое (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Сельский весенний повседневный обед'] = {
        'Суп-пюре чечевичный с пряной зеленью (грамм)':250 * 2,
        'Молоко коровье (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Сельский весенний повседневный ужин'] = {
        'Каша ячнево-гороховая (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Сельский весенний праздничный завтрак'] = {
        'Пирог закрытый с бараниной (грамм)':250,
        'Зелень весенняя с пряным соусом (грамм)':250,
        'Вино красное сухое (грамм)':250,
        '||Блюдо твёрдое горячее (250-грамм/порция)':1,
        '||Блюдо густое холодное (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        }

metadict_detail['Сельский весенний праздничный обед'] = {
        # Весна -- яйца домашней и дикой птицы
        'Суп из баранины с чечевицей и пряностями (грамм)':250 * 2,
        'Вино красное сухое (грамм)':250,
        'Пирог закрытый с творогом, зеленью и яйцом (грамм)':250,
        'Козинаки медовые с грецкими орехами (грамм)':50,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка свежая (250-грамм/порция)':1,
        '||Сладости (50-грамм/порция)':1,
        }

metadict_detail['Сельский весенний праздничный ужин'] = {
        'Каша пшённая с изюмом (грамм)':250,
        'Вино красное сухое (грамм)':250,
        'Лепёшки пшеничные с овечьим сыром (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка свежая (50-грамм/порция)':4,
        }

#----
# Сельский рацион (лето):
    # Июнь, июль, август

metadict_detail['Сельский летний повседневный завтрак'] = {
        'Капуста тушёная (грамм)':500,
        'Молоко коровье кислое (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Сельский летний повседневный обед'] = {
        'Суп-пюре нутовый с пряной зеленью (грамм)':250 * 2,
        'Молоко коровье (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        'Фрукты закавказские летние (грамм)':250,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        '||Фрукты (250-грамм/порция)':1,
        }

metadict_detail['Сельский летний повседневный ужин'] = {
        'Каша ячневая с овощами (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Сельский летний праздничный завтрак'] = {
        'Форель фаршированная рисом и изюмом (грамм)':250,
        'Капуста тушёная с пряным соусом (грамм)':250,
        'Вино красное разбавленное (грамм)':250 * 2,
        '||Блюдо твёрдое горячее (250-грамм/порция)':1,
        '||Блюдо густое холодное (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Сельский летний праздничный обед'] = {
        'Суп из курицы с яичной заправкой (грамм)':250,
        'Вино красное сухое (грамм)':250,
        'Пирог закрытый со сливками и зелёным горошком (грамм)':250,
        'Фрукты закавказские летние (грамм)':250,
        '||Блюдо жидкое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (250-грамм/порция)':1,
        '||Фрукты (250-грамм/порция)':1,
        }

metadict_detail['Сельский летний праздничный ужин'] = {
        'Каша пшённая с фруктами (грамм)':250 * 2,
        'Вино красное сухое (грамм)':250,
        'Лепёшки пшеничные с овечьим сыром (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }

#----
# Сельский рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Сельский осенний повседневный завтрак'] = {
        'Капуста тушёная (грамм)':250,
        'Молоко коровье кислое (грамм)':250,
        'Лепёшки пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Сельский осенний повседневный обед'] = {
        'Суп крупяно-бобовый с грецкими орехами (грамм)':250,
        'Молоко коровье (грамм)':250,
        'Лепёшки пшеничные на сыворотке (грамм)':50 * 4,
        'Фрукты закавказские летние (грамм)':250,
        '||Блюдо жидкое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        '||Фрукты (250-грамм/порция)':1,
        }

metadict_detail['Сельский осенний повседневный ужин'] = {
        'Каша ячневая с овощами (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Сельский осенний праздничный завтрак'] = {
        # Исправить
            # Хинкали на что-нибудь заменить
            # Блюдо 17-18 века, сильно выбирвается из сеттинга.
        'Хинкали с телятиной варёные (грамм)':50 * 10,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Соус алычовый (грамм)':50,
        '||Мясо-мучные изделия (50-грамм/порция)':10,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Соус (50-грамм/порция)':1,
        }

metadict_detail['Сельский осенний праздничный обед'] = {
        'Суп из баранины с рисом и зеленью (грамм)':250 * 2,
        'Вино красное сухое (грамм)':250,
        'Пирог закрытый с овечьим сыром и черемшой (грамм)':250,
        'Фрукты закавказские летние (грамм)':250,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка (250-грамм/порция)':1,
        '||Фрукты (250-грамм/порция)':1,
        }

metadict_detail['Сельский осенний праздничный ужин'] = {
        'Каша пшённая с изюмом (грамм)':250,
        'Вино красное сухое (грамм)':250,
        'Лепёшки пшеничные с творогом (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }

#----
# Сельский рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Сельский зимний повседневный завтрак'] = {
        # Скот спускается на зимние пастбища. Забой старых животных.
        'Заливное из говяжьих ног (грамм)':125,
        'Молоко коровье кислое (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Сельский зимний повседневный обед'] = {
        # Избыток молока, делают масло и сыры.
        'Суп чечевичный на сыворотке (грамм)':250 * 2,
        'Молоко коровье (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        '||Сладости (50-грамм/порция)':1,
        }

metadict_detail['Сельский зимний повседневный ужин'] = {
        'Каша пшеничная с говядиной (грамм)':250,
        'Каша перловая с овощами (грамм)':250,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Сельский зимний праздничный завтрак'] = {
        'Хинкали с телятиной варёные (грамм)':50 * 10,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Соус алычовый (грамм)':50,
        '||Мясо-мучные изделия (50-грамм/порция)':10,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Соус (50-грамм/порция)':1,
        }

metadict_detail['Сельский зимний праздничный обед'] = {
        'Суп из баранины с чечевицей и пряностями (грамм)':250 * 2,
        'Вино красное сухое (грамм)':250,
        'Лепёшки пшеничные с творогом (грамм)':50 * 4,
        'Чурчхела с грецкими орехами (грамм)':50,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }

metadict_detail['Сельский зимний праздничный ужин'] = {
        'Каша пшённая с изюмом (грамм)':250,
        'Вино красное сухое (грамм)':250,
        'Лепёшки пшеничные с творогом (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }
