#----
# Рабский рацион:

metadict_detail['Рабский рацион (человек/год)'] = {
        'Рабский весенний рацион (человек/день)':90,
        'Рабский летний рацион (человек/день)':90,
        'Рабский осенний рацион (человек/день)':90,
        'Рабский зимний рацион (человек/день)':90,
        }

#----
# Рабский рацион (времена года):

metadict_detail['Рабский весенний рацион (человек/день)'] = {
        'Рыбацкий весенний повседневный рацион (человек/день)':7 / 7,
        }

metadict_detail['Рабский летний рацион (человек/день)'] = {
        'Рыбацкий летний повседневный рацион (человек/день)':7 / 7,
        }

metadict_detail['Рабский зимний рацион (человек/день)'] = {
        'Рыбацкий зимний повседневный рацион (человек/день)':7 / 7,
        }

metadict_detail['Рабский осенний рацион (человек/день)'] = {
        'Рыбацкий осенний повседневный рацион (человек/день)':7 / 7,
        }
