#----
# Скотоводческий рацион:

metadict_detail['Скотоводческий рацион (человек/год)'] = {
        'Скотоводческий весенний рацион (человек/день)':90,
        'Скотоводческий летний рацион (человек/день)':90,
        'Скотоводческий осенний рацион (человек/день)':90,
        'Скотоводческий зимний рацион (человек/день)':90,
        }

#----
# Скотоводческий рацион (времена года):

metadict_detail['Скотоводческий весенний рацион (человек/день)'] = {
        'Скотоводческий весенний повседневный рацион (человек/день)':6 / 7,
        'Скотоводческий весенний праздничный рацион (человек/день)':1 / 7,
        }

metadict_detail['Скотоводческий летний рацион (человек/день)'] = {
        'Скотоводческий летний повседневный рацион (человек/день)':6 / 7,
        'Скотоводческий летний праздничный рацион (человек/день)':1 / 7,
        }

metadict_detail['Скотоводческий зимний рацион (человек/день)'] = {
        'Скотоводческий зимний повседневный рацион (человек/день)':6 / 7,
        'Скотоводческий зимний праздничный рацион (человек/день)':1 / 7,
        }

metadict_detail['Скотоводческий осенний рацион (человек/день)'] = {
        'Скотоводческий осенний повседневный рацион (человек/день)':6 / 7,
        'Скотоводческий осенний праздничный рацион (человек/день)':1 / 7,
        }

#----
# Скотоводческий рацион (дни недели):

metadict_detail['Скотоводческий весенний повседневный рацион (человек/день)'] = {
        'Скотоводческий весенний повседневный завтрак':1,
        'Скотоводческий весенний повседневный обед':1,
        'Скотоводческий весенний повседневный ужин':1,
        }

metadict_detail['Скотоводческий весенний праздничный рацион (человек/день)'] = {
        'Скотоводческий весенний праздничный завтрак':1,
        'Скотоводческий весенний праздничный обед':1,
        'Скотоводческий весенний праздничный ужин':1,
        }

metadict_detail['Скотоводческий зимний повседневный рацион (человек/день)'] = {
        'Скотоводческий зимний повседневный завтрак':1,
        'Скотоводческий зимний повседневный обед':1,
        'Скотоводческий зимний повседневный ужин':1,
        }

metadict_detail['Скотоводческий зимний праздничный рацион (человек/день)'] = {
        'Скотоводческий зимний праздничный завтрак':1,
        'Скотоводческий зимний праздничный обед':1,
        'Скотоводческий зимний праздничный ужин':1,
        }

metadict_detail['Скотоводческий летний повседневный рацион (человек/день)'] = {
        'Скотоводческий летний повседневный завтрак':1,
        'Скотоводческий летний повседневный обед':1,
        'Скотоводческий летний повседневный ужин':1,
        }

metadict_detail['Скотоводческий летний праздничный рацион (человек/день)'] = {
        'Скотоводческий летний праздничный завтрак':1,
        'Скотоводческий летний праздничный обед':1,
        'Скотоводческий летний праздничный ужин':1,
        }

metadict_detail['Скотоводческий осенний повседневный рацион (человек/день)'] = {
        'Скотоводческий осенний повседневный завтрак':1,
        'Скотоводческий осенний повседневный обед':1,
        'Скотоводческий осенний повседневный ужин':1,
        }

metadict_detail['Скотоводческий осенний праздничный рацион (человек/день)'] = {
        'Скотоводческий осенний праздничный завтрак':1,
        'Скотоводческий осенний праздничный обед':1,
        'Скотоводческий осенний праздничный ужин':1,
        }

#----
# Скотоводческий рацион (весна):
    # Март, апрель, май

metadict_detail['Скотоводческий весенний повседневный завтрак'] = {
        # Исправить
            # Допиливай.
            # Больше молока и масла, меньше зерна. Меньше овощей, но больше зелени.
            # Творог, катык, пшеницу в булгур (его быстрее готовить)
            # Козий сыр на праздники (коз вдесятеро меньше, чем овец)
        'Сыр овечий толчёный с травами (грамм)':125,
        'Молоко коровье кислое (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий весенний повседневный обед'] = {
        'Суп-пюре чечевичный с пряной зеленью (грамм)':250 * 2,
        'Молоко коровье (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий весенний повседневный ужин'] = {
        'Каша пшеничная с бараниной (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий весенний праздничный завтрак'] = {
        'Баранина запечённая с ливером, луком и пряностями (грамм)':250,
        'Зелень весенняя с пряным соусом (грамм)':250,
        'Вино красное разбавленное (грамм)':250 * 2,
        '||Блюдо твёрдое горячее (250-грамм/порция)':1,
        '||Блюдо густое холодное (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Скотоводческий весенний праздничный обед'] = {
        # Весна -- яйца домашней и дикой птицы
        'Суп из баранины с чечевицей и пряностями (грамм)':250 * 2,
        'Вино красное сухое (грамм)':250,
        'Пирог закрытый с творогом, зеленью и яйцом (грамм)':250,
        'Козинаки медовые с грецкими орехами (грамм)':50,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка свежая (250-грамм/порция)':1,
        '||Сладости (50-грамм/порция)':1,
        }

metadict_detail['Скотоводческий весенний праздничный ужин'] = {
        'Каша пшённая с изюмом (грамм)':250,
        'Вино красное сухое (грамм)':250,
        'Лепёшки пшеничные с овечьим сыром (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка свежая (50-грамм/порция)':4,
        }

#----
# Скотоводческий рацион (лето):
    # Июнь, июль, август

metadict_detail['Скотоводческий летний повседневный завтрак'] = {
        'Сыр овечий толчёный с травами (грамм)':125,
        'Молоко коровье кислое (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий летний повседневный обед'] = {
        # Фруктов на повседневном столе нет, садов вне городов мало.
        'Суп-пюре нутовый с пряной зеленью (грамм)':250 * 2,
        'Молоко коровье (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий летний повседневный ужин'] = {
        'Каша перловая с говядиной и овощами (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий летний праздничный завтрак'] = {
        'Форель фаршированная рисом и изюмом (грамм)':250,
        'Капуста тушёная с пряным соусом (грамм)':250,
        'Вино красное разбавленное (грамм)':250 * 2,
        '||Блюдо твёрдое горячее (250-грамм/порция)':1,
        '||Блюдо густое холодное (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Скотоводческий летний праздничный обед'] = {
        'Суп из курицы с яичной заправкой (грамм)':250,
        'Вино красное сухое (грамм)':250,
        'Пирог закрытый со сливками и зелёным горошком (грамм)':250,
        'Фрукты закавказские летние (грамм)':250,
        '||Блюдо жидкое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (250-грамм/порция)':1,
        '||Фрукты (250-грамм/порция)':1,
        }

metadict_detail['Скотоводческий летний праздничный ужин'] = {
        'Каша пшённая с фруктами (грамм)':250 * 2,
        'Молоко коровье (грамм)':250 * 2,
        'Лепёшки пшеничные с овечьим сыром (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }

#----
# Скотоводческий рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Скотоводческий осенний повседневный завтрак'] = {
        'Сыр овечий толчёный с травами (грамм)':125,
        'Молоко коровье кислое (грамм)':250,
        'Лепёшки пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий осенний повседневный обед'] = {
        'Суп крупяно-бобовый с грецкими орехами (грамм)':250,
        'Молоко коровье (грамм)':250,
        'Лепёшки пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий осенний повседневный ужин'] = {
        'Каша перловая с говядиной и овощами (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий осенний праздничный завтрак'] = {
        # Исправить
            # Хинкали на что-нибудь заменить
            # Блюдо 17-18 века, сильно выбирвается из сеттинга.
        'Хинкали с телятиной варёные (грамм)':50 * 10,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Соус алычовый (грамм)':50,
        '||Мясо-мучные изделия (50-грамм/порция)':10,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Соус (50-грамм/порция)':1,
        }

metadict_detail['Скотоводческий осенний праздничный обед'] = {
        'Суп из баранины с рисом и зеленью (грамм)':250 * 2,
        'Вино красное сухое (грамм)':250,
        'Пирог закрытый с овечьим сыром и черемшой (грамм)':250,
        'Фрукты закавказские летние (грамм)':250,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка (250-грамм/порция)':1,
        '||Фрукты (250-грамм/порция)':1,
        }

metadict_detail['Скотоводческий осенний праздничный ужин'] = {
        'Каша рисовая с телятиной и овощами (грамм)':250,
        'Молоко коровье (грамм)':250 * 2,
        'Лепёшки пшеничные с творогом (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }

#----
# Скотоводческий рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Скотоводческий зимний повседневный завтрак'] = {
        # Забой старых животных
        'Заливное из говяжьих ног (грамм)':125,
        'Молоко коровье кислое (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий зимний повседневный обед'] = {
        # Избыток молока, делают масло и сыры.
        'Суп чечевичный на сыворотке (грамм)':250 * 2,
        'Молоко коровье (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        '||Сладости (50-грамм/порция)':1,
        }

metadict_detail['Скотоводческий зимний повседневный ужин'] = {
        'Каша перловая с бараниной (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Скотоводческий зимний праздничный завтрак'] = {
        'Хинкали с телятиной варёные (грамм)':50 * 10,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Соус алычовый (грамм)':50,
        '||Мясо-мучные изделия (50-грамм/порция)':10,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Соус (50-грамм/порция)':1,
        }

metadict_detail['Скотоводческий зимний праздничный обед'] = {
        'Суп из баранины с чечевицей и пряностями (грамм)':250 * 2,
        'Вино красное сухое (грамм)':250,
        'Лепёшки пшеничные с творогом (грамм)':50 * 4,
        'Чурчхела с грецкими орехами (грамм)':50,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        '||Фрукты (250-грамм/порция)':1,
        }

metadict_detail['Скотоводческий зимний праздничный ужин'] = {
        'Каша пшённая с изюмом (грамм)':250,
        'Молоко коровье (грамм)':250 * 2,
        'Лепёшки пшеничные с творогом (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }
