#----
# Городской рацион:

metadict_detail['Городской рацион (человек/год)'] = {
        'Городской весенний рацион (человек/день)':90,
        'Городской летний рацион (человек/день)':90,
        'Городской осенний рацион (человек/день)':90,
        'Городской зимний рацион (человек/день)':90,
        }

#----
# Городской рацион (времена года):

metadict_detail['Городской весенний рацион (человек/день)'] = {
        'Городской весенний повседневный рацион (человек/день)':6 / 7,
        'Городской весенний праздничный рацион (человек/день)':1 / 7,
        }

metadict_detail['Городской летний рацион (человек/день)'] = {
        'Городской летний повседневный рацион (человек/день)':6 / 7,
        'Городской летний праздничный рацион (человек/день)':1 / 7,
        }

metadict_detail['Городской зимний рацион (человек/день)'] = {
        'Городской зимний повседневный рацион (человек/день)':6 / 7,
        'Городской зимний праздничный рацион (человек/день)':1 / 7,
        }

metadict_detail['Городской осенний рацион (человек/день)'] = {
        'Городской осенний повседневный рацион (человек/день)':6 / 7,
        'Городской осенний праздничный рацион (человек/день)':1 / 7,
        }

#----
# Городской рацион (дни недели):

metadict_detail['Городской весенний повседневный рацион (человек/день)'] = {
        'Городской весенний повседневный завтрак':1,
        'Городской весенний повседневный обед':1,
        'Городской весенний повседневный ужин':1,
        }

metadict_detail['Городской весенний праздничный рацион (человек/день)'] = {
        'Городской весенний праздничный завтрак':1,
        'Городской весенний праздничный обед':1,
        'Городской весенний праздничный ужин':1,
        }

metadict_detail['Городской зимний повседневный рацион (человек/день)'] = {
        'Городской зимний повседневный завтрак':1,
        'Городской зимний повседневный обед':1,
        'Городской зимний повседневный ужин':1,
        }

metadict_detail['Городской зимний праздничный рацион (человек/день)'] = {
        'Городской зимний праздничный завтрак':1,
        'Городской зимний праздничный обед':1,
        'Городской зимний праздничный ужин':1,
        }

metadict_detail['Городской летний повседневный рацион (человек/день)'] = {
        'Городской летний повседневный завтрак':1,
        'Городской летний повседневный обед':1,
        'Городской летний повседневный ужин':1,
        }

metadict_detail['Городской летний праздничный рацион (человек/день)'] = {
        'Городской летний праздничный завтрак':1,
        'Городской летний праздничный обед':1,
        'Городской летний праздничный ужин':1,
        }

metadict_detail['Городской осенний повседневный рацион (человек/день)'] = {
        'Городской осенний повседневный завтрак':1,
        'Городской осенний повседневный обед':1,
        'Городской осенний повседневный ужин':1,
        }

metadict_detail['Городской осенний праздничный рацион (человек/день)'] = {
        'Городской осенний праздничный завтрак':1,
        'Городской осенний праздничный обед':1,
        'Городской осенний праздничный ужин':1,
        }

#----
# Городской рацион (весна):
    # Март, апрель, май

metadict_detail['Городской весенний повседневный завтрак'] = {
        # Потребление вина в Грузии конца 19 века -- 0.34 литра/человека в сутки
        'Сыр овечий толчёный с чесноком (грамм)':125,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Городской весенний повседневный обед'] = {
        'Суп-пюре чечевичный с пряной зеленью (грамм)':250 * 2,
        'Молоко коровье кислое (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской весенний повседневный ужин'] = {
        # Каша -- шавля.
        'Каша перловая с солониной (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лаваш пшеничный (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской весенний праздничный завтрак'] = {
        # Исправить
        # Допилить
            # Сациви. Курица варёная, соус из орехов
            # Гурули. Курица тушёная с орехами в вине
            # Буглама. Тушёная баранина.
            # Плаки. Тушёная форель, припускание,
            # Долма. Голубцы из виноградных листьев с говядиой.
            # Чуду. Лепёшки с начинкой. Творогом, пряной зеленью.
            # Чашушули. Говядина, тушёная с зеленью и пряностями.
            # Лывжа. Тушёная баранина с чесноком и чабером.
            # Чемква -- мучная каша с измельчённым сыром на кислом молоке.
        'Пирог закрытый с бараниной (грамм)':250,
        'Зелень весенняя с пряным соусом (грамм)':250,
        'Вино красное сухое (грамм)':250,
        '||Выпечка свежая (250-грамм/порция)':1,
        '||Блюдо густое холодное (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городской весенний праздничный обед'] = {
        # Весна -- яйца домашней и дикой птицы
        'Суп из баранины с чечевицей и пряностями (грамм)':250 * 2,
        'Вино красное сухое (грамм)':250,
        'Пирог закрытый с творогом, зеленью и яйцом (грамм)':250,
        'Козинаки медовые с грецкими орехами (грамм)':50,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка свежая (250-грамм/порция)':1,
        '||Сладости (50-грамм/порция)':1,
        }

metadict_detail['Городской весенний праздничный ужин'] = {
        'Каша пшённая с изюмом (грамм)':250,
        'Молоко коровье (грамм)':250 * 2,
        'Лепёшки пшеничные с овечьим сыром (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }

#----
# Городской рацион (лето):
    # Июнь, июль, август

metadict_detail['Городской летний повседневный завтрак'] = {
        # Осетровых бьют весной, во время хода в устье местной Волги, объёмы огромны.
            # https://ru.wikisource.org/wiki/ЭСБЕ/Осетр,_рыбы_из_семейства_осетровых
            # РИ (1880-е годы) белуги, осетра, севрюги и шипа 600000 пд. (10k тонн)
            # Из них икры 40000 пд (650 тонн, 6.7% массы улова)
        # Пантикапей (нынешняя Керчь), житница эллинских колоний. Рабов кормили преимущественно рыбой.
            # Полагаю, осетровыми, добытыми ради икры:
            # https://www.youtube.com/watch?v=6X4SXoQqiRc
        'Рыба морская красная вяленая (грамм)':125,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо твёрдое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Городской летний повседневный обед'] = {
        # Пригородные сады -- для горожан фрукты повседневная пища.
        'Суп-пюре нутовый с пряной зеленью (грамм)':250 * 2,
        'Молоко коровье кислое (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        'Фрукты закавказские летние (грамм)':125,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        '||Фрукты (125-грамм/порция)':1,
        }

metadict_detail['Городской летний повседневный ужин'] = {
        'Каша перловая с рыбой и овощами (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лаваш пшеничный (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской летний праздничный завтрак'] = {
        'Форель фаршированная рисом и изюмом (грамм)':250,
        'Капуста тушёная с пряным соусом (грамм)':250,
        'Вино красное сухое (грамм)':250,
        '||Блюдо твёрдое горячее (250-грамм/порция)':1,
        '||Блюдо густое холодное (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городской летний праздничный обед'] = {
        'Суп из курицы с яичной заправкой (грамм)':250,
        'Вино красное сухое (грамм)':250,
        'Пирог закрытый со сливками и зелёным горошком (грамм)':250,
        'Фрукты закавказские летние (грамм)':250,
        '||Блюдо жидкое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (250-грамм/порция)':1,
        '||Фрукты (250-грамм/порция)':1,
        }

metadict_detail['Городской летний праздничный ужин'] = {
        'Каша пшённая с фруктами (грамм)':250,
        'Молоко коровье (грамм)':250 * 2,
        'Лепёшки пшеничные с овечьим сыром (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }

#----
# Городской рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Городской осенний повседневный завтрак'] = {
        # Сбор урожая, дешёвая пшеница в городах.
        'Сыр овечий толчёный с чесноком (грамм)':125,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Городской осенний повседневный обед'] = {
        'Суп крупяно-бобовый с грецкими орехами (грамм)':250 * 2,
        'Молоко коровье кислое (грамм)':250,
        'Пирог закрытый с капустой и грецкими орехами (грамм)':250,
        'Фрукты закавказские летние (грамм)':125,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка (250-грамм/порция)':1,
        '||Фрукты (125-грамм/порция)':1,
        }

metadict_detail['Городской осенний повседневный ужин'] = {
        # Исправить
            # Перловка да перловка. Полбу от пшеницы отдели.
            # Нет, для горожан телятина нехарактерна. Телятина для селян.
            # Кстати, убойный вес скота в 50-тысячных городах РИ 1913 года -- 60 кг/человека
            # https://ic.pics.livejournal.com/pyhalov/31027164/10534/10534_original.jpg
        # Забой годовалых телят, солонина.
        'Каша перловая с говядиной и овощами (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лаваш пшеничный (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской осенний праздничный завтрак'] = {
        # Исправить
            # Хинкали на что-нибудь заменить
            # Блюдо 17-18 века, сильно выбирвается из сеттинга.
        'Хинкали с телятиной варёные (грамм)':50 * 10,
        'Вино красное сухое (грамм)':250,
        'Соус алычовый (грамм)':50,
        '||Мясо-мучные изделия (50-грамм/порция)':10,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Соус (50-грамм/порция)':1,
        }

metadict_detail['Городской осенний праздничный обед'] = {
        'Суп из баранины с рисом и зеленью (грамм)':250 * 2,
        'Вино красное сухое (грамм)':250,
        'Пирог закрытый с овечьим сыром и черемшой (грамм)':250,
        'Фрукты закавказские летние (грамм)':250,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка (250-грамм/порция)':1,
        '||Фрукты (250-грамм/порция)':1,
        }

metadict_detail['Городской осенний праздничный ужин'] = {
        'Каша рисовая с телятиной и овощами (грамм)':250,
        'Молоко коровье (грамм)':250 * 2,
        'Лепёшки пшеничные с творогом (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }

#----
# Городской рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Городской зимний повседневный завтрак'] = {
        'Заливное из говяжьих ног (грамм)':125,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Городской зимний повседневный обед'] = {
        # Избыток молока, делают масло и сыры.
        'Суп чечевичный на сыворотке (грамм)':250 * 2,
        'Молоко коровье (грамм)':250,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Хлеб свежий (50-грамм/порция)':4,
        '||Сладости (50-грамм/порция)':1,
        }

metadict_detail['Городской зимний повседневный ужин'] = {
        # Забой старых животных
        'Каша перловая с солониной (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лаваш пшеничный (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской зимний праздничный завтрак'] = {
        'Хинкали с телятиной варёные (грамм)':50 * 10,
        'Вино красное сухое (грамм)':250,
        'Соус алычовый (грамм)':50,
        '||Мясо-мучные изделия (50-грамм/порция)':10,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Соус (50-грамм/порция)':1,
        }

metadict_detail['Городской зимний праздничный обед'] = {
        'Суп из баранины с чечевицей и пряностями (грамм)':250 * 2,
        'Вино красное сухое (грамм)':250,
        'Лепёшки пшеничные с творогом (грамм)':50 * 4,
        'Чурчхела с грецкими орехами (грамм)':50,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        '||Фрукты (250-грамм/порция)':1,
        }

metadict_detail['Городской зимний праздничный ужин'] = {
        'Каша пшённая с изюмом (грамм)':250,
        'Молоко коровье (грамм)':250 * 2,
        'Лепёшки пшеничные с творогом (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка свежая (50-грамм/порция)':4,
        }
