#----
# Награблено:

metadict_army['Награблено (Битва за Лемнос)'] = {
        'Владение Ианты':1,
        'Владение Павсания':1,
        'Владение Гая Юлия':1,
        # Братья-мостовики
        'Владение третьего мостовика Отто':1,
        'Владение второго мостовика':1,
        'Владение первого мостовика':1,
        # Нейтралы
        'Владение Сефо (беженцы)':1,
        # Трофеи
        'Флот Кара-Яма (трофеи)':1,
        'Флот Хана-Вама (трофеи)':1,
        # Союзники
        #'Флот Гая Юлия (свои)':1,
        'Флот Патрокла (свои)':1,
        'Флот Фарама (свои)':1,
        'Флот Сакатра (свои)':1,
        }

#----
# Эвакуация владений:

metadict_army['Владение Ианты'] = {
        # Грабила, хм, сама Ианта
        # Всё в процентах от идеального владения:
        '|Ополченцы Ианты (свои) (%)':1,
        '|Люди Ианты (свои) (%)':1,
        '|Триеры Ианты (%)':1,
        '|Торговые суда Ианты (%)':1,
        # Скот:
        'Лошади (%)':0.2,
        'Ослы, мулы (%)':0.3,
        'Волы (%)':0.2,
        'Коровы (%)':0.9,
        'Овцы и козы (%)':0.2,
        'Куры (%)':0.7,
        # Ценности:
        'Керамическая посуда (%)':0.3,
        'Деревянная мебель (%)':0.1,
        'Чугунная утварь (%)':0.3,
        'Железные инструменты (%)':0.3,
        'Шерстяная пряжа (%)':0.3,
        'Бронзовые поделки (%)':0.3,
        # Запасы основные
        'Вино (%)':0.7,
        'Пшеница (%)':0.4,
        'Ячмень (%)':0.7,
        'Бобы (%)':0.9,
        'Рыба вяленая (%)':0.2,
        'Масло оливковое (%)':0.7,
        # Запасы прочие
        #'Овощи (%)':0.7,
        'Фрукты сушёные (%)':0.5,
        'Сыры (%)':0.4,
        'Солонина (%)':0.1,
        'Орехи (%)':0.7,
        'Пряности (%)':0.6,
        }

metadict_army['Владение Гая Юлия'] = {
        # Секундус
        # Грабил сам Гай Юлий
        '|Ополченцы Гая Юлия (свои) (%)':1,
        '|Люди Гая Юлия (свои) (%)':1,
        '|Триеры Гая Юлия (%)':1,
        '|Торговые суда Гая Юлия (%)':1,
        # Скот:
        'Лошади (%)':0.5,
        'Ослы, мулы (%)':0.2,
        'Волы (%)':0.7,
        'Коровы (%)':0.6,
        'Овцы и козы (%)':0.5,
        'Куры (%)':0.7,
        # Ценности:
        'Керамическая посуда (%)':0.3,
        'Деревянная мебель (%)':1.0,
        'Чугунная утварь (%)':0.3,
        'Железные инструменты (%)':0.9,
        'Шерстяная пряжа (%)':1.0,
        'Бронзовые поделки (%)':0.6,
        # Запасы основные
        'Вино (%)':0.9,
        'Пшеница (%)':0.7,
        'Ячмень (%)':1.0,
        'Бобы (%)':0.6,
        'Рыба вяленая (%)':1.0,
        'Масло оливковое (%)':1.0,
        # Запасы прочие
        'Овощи (%)':0.8,
        'Фрукты сушёные (%)':0.9,
        'Сыры (%)':1.0,
        'Солонина (%)':1.0,
        'Орехи (%)':1.0,
        'Пряности (%)':0.7,
        }

metadict_army['Владение Павсания'] = {
        # Грабил Гай Юлий
        # Всё в процентах от идеального владения:
        '|Ополченцы Павсания (свои) (%)':0.85,
        '|Люди Павсания (свои) (%)':0.7,
        '|Сатиры Павсания (свои) (%)':1.0,
        '|Торговые суда Павсания (%)':0.2,
        # Ценности:
        'Керамическая посуда (%)':1.0,
        'Деревянная мебель (%)':1.0,
        'Чугунная утварь (%)':0.7,
        'Железные инструменты (%)':0.5,
        'Шерстяная пряжа (%)':0.8,
        'Бронзовые поделки (%)':0.8,
        # Скот:
        'Лошади (%)':0.8,
        'Ослы, мулы (%)':0.5,
        'Волы (%)':1.0,
        'Коровы (%)':0.3,
        'Овцы и козы (%)':0.6,
        'Куры (%)':0.9,
        # Запасы основные
        'Вино (%)':0.8,
        'Пшеница (%)':0.8,
        'Ячмень (%)':1.0,
        'Бобы (%)':1.0,
        'Рыба вяленая (%)':0.9,
        'Масло оливковое (%)':0.5,
        # Запасы прочие
        #'Овощи (%)':0.6,
        'Фрукты сушёные (%)':1.0,
        'Сыры (%)':0.6,
        'Солонина (%)':0.6,
        'Орехи (%)':0.6,
        'Пряности (%)':0.9,
        }

metadict_army['Владение Сефо (беженцы)'] = {
        # Сами к Ианте прибились. Накормила ведь.
        '|Ополченцы Сефо (свои) (%)':0.4,
        '|Люди Сефо (свои) (%)':0.4,
        # Ценности:
        #'Керамическая посуда (%)':0.3,
        #'Деревянная мебель (%)':0.1,
        'Чугунная утварь (%)':1.0,
        'Железные инструменты (%)':1.0,
        'Шерстяная пряжа (%)':0.5,
        'Бронзовые поделки (%)':0.5,
        # Скот:
        'Лошади (%)':0.7,
        'Ослы, мулы (%)':0.5,
        'Волы (%)':0.6,
        'Коровы (%)':0.2,
        'Овцы и козы (%)':0.4,
        'Куры (%)':0.8,
        # Запасы основные
        #'Вино (%)':0.1,
        #'Пшеница (%)':0.1,
        #'Ячмень (%)':0.0,
        #'Бобы (%)':0.1,
        #'Рыба вяленая (%)':0.1,
        #'Масло оливковое (%)':0.1,
        # Запасы прочие
        #'Овощи (%)':0.4,
        'Фрукты сушёные (%)':0.5,
        'Сыры (%)':0.9,
        'Солонина (%)':0.4,
        'Орехи (%)':0.1,
        'Пряности (%)':0.4,
        }

metadict_army['Владение третьего мостовика Отто'] = {
        # Грабил Фарам
        # Всё в процентах от идеального владения:
        '|Ополченцы мостовика Отто (свои) (%)':0.5,
        '|Люди мостовика Отто (свои) (%)':0.5,
        '|Торговые суда Отто (%)':0.1,
        # Скот:
        'Лошади (%)':0.3,
        'Ослы, мулы (%)':0.4,
        'Волы (%)':0.1,
        'Коровы (%)':0.7,
        'Овцы и козы (%)':0.8,
        'Куры (%)':0.7,
        # Ценности:
        'Керамическая посуда (%)':0.1,
        'Деревянная мебель (%)':0.4,
        'Чугунная утварь (%)':0.4,
        'Железные инструменты (%)':0.5,
        'Шерстяная пряжа (%)':0.7,
        'Бронзовые поделки (%)':0.2,
        # Запасы основные
        #'Вино (%)':0.7,
        #'Пшеница (%)':0.4,
        #'Ячмень (%)':0.7,
        #'Бобы (%)':0.9,
        #'Рыба вяленая (%)':0.2,
        #'Масло оливковое (%)':0.7,
        # Запасы прочие
        #'Овощи (%)':0.7,
        'Фрукты сушёные (%)':0.2,
        'Сыры (%)':0.3,
        'Солонина (%)':0.2,
        'Орехи (%)':0.2,
        'Пряности (%)':0.4,
        }

metadict_army['Владение второго мостовика'] = {
        # Грабила Филлис
        # Всё в процентах от идеального владения:
        '|Ополченцы мостовика Отто (свои) (%)':0.8,
        '|Люди мостовика Отто (свои) (%)':0.8,
        '|Торговые суда Отто (%)':0.3,
        # Скот:
        'Лошади (%)':0.2,
        'Ослы, мулы (%)':0.8,
        'Волы (%)':0.2,
        'Коровы (%)':0.5,
        'Овцы и козы (%)':0.2,
        'Куры (%)':0.3,
        # Ценности:
        'Керамическая посуда (%)':0.3,
        'Деревянная мебель (%)':0.9,
        'Чугунная утварь (%)':0.2,
        'Железные инструменты (%)':0.3,
        'Шерстяная пряжа (%)':0.9,
        'Бронзовые поделки (%)':0.6,
        # Запасы основные
        'Вино (%)':0.9,
        'Пшеница (%)':0.3,
        'Ячмень (%)':0.4,
        'Бобы (%)':0.1,
        'Рыба вяленая (%)':0.1,
        'Масло оливковое (%)':0.2,
        # Запасы прочие
        #'Овощи (%)':0.2,
        'Фрукты сушёные (%)':0.7,
        'Сыры (%)':0.2,
        'Солонина (%)':0.8,
        'Орехи (%)':0.6,
        'Пряности (%)':0.8,
        }

metadict_army['Владение первого мостовика'] = {
        # Грабил Гай Юлий
        # Всё в процентах от идеального владения:
        '|Ополченцы мостовика Отто (свои) (%)':0.8,
        '|Люди мостовика Отто (свои) (%)':0.8,
        '|Торговые суда Отто (%)':0.9,
        # Скот:
        'Лошади (%)':0.8,
        'Ослы, мулы (%)':0.4,
        'Волы (%)':0.4,
        'Коровы (%)':0.9,
        'Овцы и козы (%)':0.2,
        'Куры (%)':0.9,
        # Ценности:
        'Керамическая посуда (%)':0.5,
        'Деревянная мебель (%)':0.8,
        'Чугунная утварь (%)':0.4,
        'Железные инструменты (%)':0.7,
        'Шерстяная пряжа (%)':0.3,
        'Бронзовые поделки (%)':0.8,
        # Запасы основные
        'Вино (%)':0.8,
        'Пшеница (%)':0.8,
        'Ячмень (%)':1.0,
        'Бобы (%)':0.7,
        'Рыба вяленая (%)':0.9,
        'Масло оливковое (%)':0.7,
        # Запасы прочие
        #'Овощи (%)':0.4,
        'Фрукты сушёные (%)':0.9,
        'Сыры (%)':1.0,
        'Солонина (%)':0.7,
        'Орехи (%)':0.1,
        'Пряности (%)':0.7,
        }

#----
# Наши флоты:

metadict_army['Флот Патрокла (свои)'] = {
        # Патрокл призвал всех способных держать оружие.
        '|Триеры Патрокла (%)':1,
        '|Торговые суда Патрокла (%)':1,
        '|Ополченцы Патрокла (свои) (%)':2.4,
        }

metadict_army['Флот Фарама (свои)'] = {
        '|Триеры Фарама (%)':1,
        '|Торговые суда Фарама (%)':0.5,
        '|Ополченцы Фарама (свои) (%)':0.6,
        }

metadict_army['Флот Гая Юлия (свои)'] = {
        '|Триеры Гая Юлия (%)':1,
        '|Торговые суда Гая Юлия (%)':0.5,
        '|Ополченцы Гая Юлия (свои) (%)':0.6,
        }

metadict_army['Флот Сакатра (свои)'] = {
        '|Щебеки Сакатра (%)':1,
        '|Торговые суда Сакатра (%)':0.5,
        '|Ополченцы Сакатра (свои) (%)':0.6,
        }

#----
# Трофейные флоты:

metadict_army['Флот Кара-Яма (трофеи)'] = {
        '|Пентеры Кара-Яма (%)':1,
        '|Триеры Кара-Яма (%)':2,
        '|Торговые суда Кара-Яма (%)':0.2,
        }

metadict_army['Флот Хана-Вама (трофеи)'] = {
        # Плюс затонувшая триера
        '|Пентеры Хана-Вама (%)':1,
        '|Триеры Хана-Вама (%)':3,
        }

#----
# Основное:

metadict_detail['|Сатиры Павсания (свои) (%)'] = {
        # Малое племя
        '|Сатиры (свои)':3000,
        }

metadict_detail['|Люди Ианты (свои) (%)'] = {
        '|Люди (свои)':5500,
        }

metadict_detail['|Люди Павсания (свои) (%)'] = {
        # Малое племя
        '|Люди (свои)':3000,
        }

metadict_detail['|Люди Гая Юлия (свои) (%)'] = {
        '|Люди (свои)':5000,
        }

metadict_detail['|Люди Патрокла (свои) (%)'] = {
        '|Люди (свои)':5300,
        }

metadict_detail['|Люди Сефо (свои) (%)'] = {
        '|Люди (свои)':6000,
        }

metadict_detail['|Люди мостовика Отто (свои) (%)'] = {
        '|Люди (свои)':6000,
        }

metadict_detail['|Ополченцы Гая Юлия (свои) (%)'] = {
        # В среднем владении 500 ополченцев
        '|Ополченцы (свои)':500,
        }

metadict_detail['|Ополченцы Ианты (свои) (%)'] = {
        '|Ополченцы (свои)':500,
        }

metadict_detail['|Ополченцы Павсания (свои) (%)'] = {
        '|Ополченцы (свои)':500,
        }

metadict_detail['|Ополченцы Патрокла (свои) (%)'] = {
        '|Ополченцы (свои)':500,
        }

metadict_detail['|Ополченцы Фарама (свои) (%)'] = {
        '|Ополченцы (свои)':500,
        }

metadict_detail['|Ополченцы Сакатра (свои) (%)'] = {
        '|Ополченцы (свои)':500,
        }

metadict_detail['|Ополченцы Сефо (свои) (%)'] = {
        '|Ополченцы (свои)':500,
        }

metadict_detail['|Ополченцы мостовика Отто (свои) (%)'] = {
        '|Ополченцы (свои)':500,
        }

metadict_detail['|Пентеры Кара-Яма (%)'] = {
        '|Пентеры':1,
        }

metadict_detail['|Пентеры Хана-Вама (%)'] = {
        '|Пентеры':1,
        }

metadict_detail['|Торговые суда Гая Юлия (%)'] = {
        '|Торговые суда':20,
        }

metadict_detail['|Торговые суда Фарама (%)'] = {
        '|Торговые суда':20,
        }

metadict_detail['|Торговые суда Сакатра (%)'] = {
        '|Торговые суда':20,
        }

metadict_detail['|Торговые суда Ианты (%)'] = {
        '|Торговые суда':20,
        }

metadict_detail['|Торговые суда Кара-Яма (%)'] = {
        '|Торговые суда':20,
        }

metadict_detail['|Торговые суда Павсания (%)'] = {
        '|Торговые суда':20,
        }

metadict_detail['|Торговые суда Патрокла (%)'] = {
        '|Торговые суда':20,
        }

metadict_detail['|Торговые суда Отто (%)'] = {
        # У братьев-мостовиков небольшие флоты:
        '|Торговые суда':10,
        }

metadict_detail['|Триеры Гая Юлия (%)'] = {
        # Во владении, обычно, единственная триера
        '|Триеры':1,
        }

metadict_detail['|Триеры Ианты (%)'] = {
        '|Триеры':1,
        }

metadict_detail['|Триеры Патрокла (%)'] = {
        '|Триеры':1,
        }

metadict_detail['|Триеры Фарама (%)'] = {
        '|Триеры':1,
        }

metadict_detail['|Щебеки Сакатра (%)'] = {
        '|Щебеки':1,
        }

metadict_detail['|Триеры Хана-Вама (%)'] = {
        '|Триеры':1,
        }

metadict_detail['|Триеры Кара-Яма (%)'] = {
        '|Триеры':1,
        }

#----
# Ценности:

metadict_detail['Керамическая посуда (%)'] = {
        # Только имеющие ценность предметы.
        'Керамическая посуда (тонн)':240,
        }

metadict_detail['Деревянная мебель (%)'] = {
        'Деревянная мебель (тонн)':80,
        }

metadict_detail['Чугунная утварь (%)'] = {
        'Чугунная утварь (тонн)':30,
        }

metadict_detail['Железные инструменты (%)'] = {
        'Железные инструменты (тонн)':15,
        }

metadict_detail['Шерстяная пряжа (%)'] = {
        'Шерстяная пряжа (тонн)':9,
        }

metadict_detail['Бронзовые поделки (%)'] = {
        'Бронзовые поделки (тонн)':3,
        }

#----
# Скот:

metadict_detail['Лошади (%)'] = {
        'Лошади (голов)':10,
        }

metadict_detail['Ослы, мулы (%)'] = {
        'Ослы, мулы (голов)':40,
        #'Ослы, мулы (тонн)':12,
        }

metadict_detail['Волы (%)'] = {
        'Волы (голов)':300,
        #'Волы (тонн)':150,
        }

metadict_detail['Коровы (%)'] = {
        'Коровы (голов)':600,
        #'Коровы (тонн)':180,
        }

metadict_detail['Овцы и козы (%)'] = {
        'Овцы и козы (голов)':6000,
        #'Овцы и козы (тонн)':180,
        }

metadict_detail['Куры (%)'] = {
        'Куры (голов)':10000,
        #'Куры (тонн)':12,
        }

#----
# Запасы основные:

metadict_detail['Вино (%)'] = {
        'Вино (тонн)':500,
        }

metadict_detail['Пшеница (%)'] = {
        'Пшеница (тонн)':500,
        }

metadict_detail['Ячмень (%)'] = {
        'Ячмень (тонн)':400,
        }

metadict_detail['Бобы (%)'] = {
        'Бобы (тонн)':120,
        }

metadict_detail['Рыба вяленая (%)'] = {
        'Рыба вяленая (тонн)':110,
        }

metadict_detail['Масло оливковое (%)'] = {
        'Масло оливковое (тонн)':40,
        }

#----
# Запасы прочие:


metadict_detail['Овощи (%)'] = {
        'Овощи (тонн)':650,
        }

metadict_detail['Фрукты сушёные (%)'] = {
        'Фрукты сушёные (тонн)':40,
        }

metadict_detail['Сыры (%)'] = {
        'Сыры (тонн)':16,
        }

metadict_detail['Солонина (%)'] = {
        'Солонина (тонн)':16,
        }

metadict_detail['Орехи (%)'] = {
        'Орехи (тонн)':15,
        }

metadict_detail['Пряности (%)'] = {
        'Пряности (тонн)':5,
        }

#----
# Основное:

metadict_detail['|Ополченцы (свои)'] = {
        '!!+Экипажи (доступны)':1,
        '!!+Ополченцы (готовы)':1,
        }

metadict_detail['|Люди (свои)'] = {
        '!!!+Люди (свои)':1,
        '-Пассажиры (ждут)':0.8,
        '!!+Экипажи (доступны)':0.2,
        }

metadict_detail['|Сатиры (свои)'] = {
        '!!!+Люди (свои)':1,
        '-Пассажиры (ждут)':0.8,
        '!!+Экипажи (доступны)':0.2,
        }

metadict_detail['|Торговые суда'] = {
        '!+Торговые суда (доступны)':1,
        '-Экипажи (требуется)':50,
        '+Пассажировместимость':200,
        '+Грузовместимость (корабли) (тонн)':50,
        }

metadict_detail['|Триеры'] = {
        '!+Триеры (доступны)':1,
        '-Экипажи (требуется)':50,
        '+Пассажировместимость':200,
        '+Грузовместимость (корабли) (тонн)':25,
        }

metadict_detail['|Щебеки'] = {
        '!+Щебеки (доступны)':1,
        '-Экипажи (требуется)':50,
        '+Пассажировместимость':200,
        '+Грузовместимость (корабли) (тонн)':25,
        }

metadict_detail['|Пентеры'] = {
        '!+Пентеры (доступны)':1,
        '-Экипажи (требуется)':50,
        '+Пассажировместимость':300,
        '+Грузовместимость (корабли) (тонн)':65,
        }

#----
# Ценности:

metadict_detail['Керамическая посуда (тонн)'] = {
        'Керамическая посуда (эфесов)':0.3,
        '-Грузы (ценности) (тонн)':1,
        }

metadict_detail['Деревянная мебель (тонн)'] = {
        'Деревянная мебель (эфесов)':1,
        '-Грузы (ценности) (тонн)':1,
        }

metadict_detail['Чугунная утварь (тонн)'] = {
        'Чугунная утварь (эфесов)':2.5,
        '-Грузы (ценности) (тонн)':1,
        }

metadict_detail['Железные инструменты (тонн)'] = {
        'Железные инструменты (эфесов)':5.6,
        '-Грузы (ценности) (тонн)':1,
        }

metadict_detail['Шерстяная пряжа (тонн)'] = {
        'Шерстяная пряжа (эфесов)':8.3,
        '-Грузы (ценности) (тонн)':1,
        }

metadict_detail['Бронзовые поделки (тонн)'] = {
        'Бронзовые поделки (эфесов)':28,
        '-Грузы (ценности) (тонн)':1,
        }

#----
# Скот:

metadict_detail['Лошади (голов)'] = {
        'Лошади (эфесов)':1,
        #'-Грузы (скот) (тонн)':0.3,
        '-Перегон скота (голов)':1,
        '+Грузовместимость (скот) (тонн)':0.3,
        }

metadict_detail['Ослы, мулы (голов)'] = {
        'Ослы, мулы (эфесов)':0.5,
        #'-Грузы (скот) (тонн)':0.3,
        '-Перегон скота (голов)':1,
        '+Грузовместимость (скот) (тонн)':0.3,
        }

metadict_detail['Волы (голов)'] = {
        'Волы (эфесов)':0.3,
        #'-Грузы (скот) (тонн)':0.5,
        '-Перегон скота (голов)':1,
        '+Грузовместимость (скот) (тонн)':0.3,
        }

metadict_detail['Коровы (голов)'] = {
        'Коровы (эфесов)':0.2,
        #'-Грузы (скот) (тонн)':0.3,
        '-Перегон скота (голов)':1,
        '+Грузовместимость (скот) (тонн)':0.05,
        }

metadict_detail['Овцы и козы (голов)'] = {
        'Овцы и козы (эфесов)':0.02,
        '-Грузы (скот) (тонн)':0.03,
        }

metadict_detail['Куры (голов)'] = {
        'Куры (эфесов)':0.001,
        '-Грузы (скот) (тонн)':0.0012,
        }

#----
# Запасы основные:

metadict_detail['Вино (тонн)'] = {
        'Вино (эфесов)':0.3,
        '-Грузы (запасы основные) (тонн)':1,
        }

metadict_detail['Пшеница (тонн)'] = {
        'Пшеница (эфесов)':0.3,
        '-Грузы (запасы основные) (тонн)':1,
        }

metadict_detail['Ячмень (тонн)'] = {
        'Ячмень (эфесов)':0.2,
        '-Грузы (запасы основные) (тонн)':1,
        }

metadict_detail['Бобы (тонн)'] = {
        'Бобы (эфесов)':0.3,
        '-Грузы (запасы основные) (тонн)':1,
        }

metadict_detail['Рыба вяленая (тонн)'] = {
        'Рыба вяленая (эфесов)':0.7,
        '-Грузы (запасы основные) (тонн)':1,
        }

metadict_detail['Масло оливковое (тонн)'] = {
        'Масло оливковое (эфесов)':1.2,
        '-Грузы (запасы основные) (тонн)':1,
        }

#----
# Запасы прочие:

metadict_detail['Овощи (тонн)'] = {
        'Овощи (эфесов)':0.04,
        '-Грузы (запасы прочие) (тонн)':1,
        }

metadict_detail['Фрукты сушёные (тонн)'] = {
        'Фрукты сушёные (эфесов)':0.35,
        '-Грузы (запасы прочие) (тонн)':1,
        }

metadict_detail['Сыры (тонн)'] = {
        'Сыры (эфесов)':0.7,
        '-Грузы (запасы прочие) (тонн)':1,
        }

metadict_detail['Солонина (тонн)'] = {
        'Солонина (эфесов)':0.8,
        '-Грузы (запасы прочие) (тонн)':1,
        }

metadict_detail['Орехи (тонн)'] = {
        'Орехи (эфесов)':1.2,
        '-Грузы (запасы прочие) (тонн)':1,
        }

metadict_detail['Пряности (тонн)'] = {
        'Пряности (эфесов)':2.4,
        '-Грузы (запасы прочие) (тонн)':1,
        }

#----
# Суммарная стоимость:

#----
# Ценности:

metadict_army['Бронзовые поделки (эфесов)'] = {
        '-Грузы (ценности) (эфесов)':1,
        }

metadict_army['Деревянная мебель (эфесов)'] = {
        '-Грузы (ценности) (эфесов)':1,
        }

metadict_army['Железные инструменты (эфесов)'] = {
        '-Грузы (ценности) (эфесов)':1,
        }

metadict_army['Керамическая посуда (эфесов)'] = {
        '-Грузы (ценности) (эфесов)':1,
        }

metadict_army['Чугунная утварь (эфесов)'] = {
        '-Грузы (ценности) (эфесов)':1,
        }

metadict_army['Шерстяная пряжа (эфесов)'] = {
        '-Грузы (ценности) (эфесов)':1,
        }

#----
# Скот:

metadict_army['Волы (эфесов)'] = {
        '-Грузы (скот) (эфесов)':1,
        }

metadict_army['Коровы (эфесов)'] = {
        '-Грузы (скот) (эфесов)':1,
        }

metadict_army['Куры (эфесов)'] = {
        '-Грузы (скот) (эфесов)':1,
        }

metadict_army['Лошади (эфесов)'] = {
        '-Грузы (скот) (эфесов)':1,
        }

metadict_army['Овцы и козы (эфесов)'] = {
        '-Грузы (скот) (эфесов)':1,
        }

metadict_army['Ослы, мулы (эфесов)'] = {
        '-Грузы (скот) (эфесов)':1,
        }

#----
# Запасы основные:

metadict_army['Вино (эфесов)'] = {
        '-Грузы (запасы основные) (эфесов)':1,
        }

metadict_army['Пшеница (эфесов)'] = {
        '-Грузы (запасы основные) (эфесов)':1,
        }

metadict_army['Ячмень (эфесов)'] = {
        '-Грузы (запасы основные) (эфесов)':1,
        }

metadict_army['Бобы (эфесов)'] = {
        '-Грузы (запасы основные) (эфесов)':1,
        }

metadict_army['Рыба вяленая (эфесов)'] = {
        '-Грузы (запасы основные) (эфесов)':1,
        }

metadict_army['Масло оливковое (эфесов)'] = {
        '-Грузы (запасы основные) (эфесов)':1,
        }

#----
# Запасы прочие:

metadict_army['Овощи (эфесов)'] = {
        '-Грузы (запасы прочие) (эфесов)':1,
        }

metadict_army['Фрукты сушёные (эфесов)'] = {
        '-Грузы (запасы прочие) (эфесов)':1,
        }

metadict_army['Сыры (эфесов)'] = {
        '-Грузы (запасы прочие) (эфесов)':1,
        }

metadict_army['Солонина (эфесов)'] = {
        '-Грузы (запасы прочие) (эфесов)':1,
        }

metadict_army['Орехи (эфесов)'] = {
        '-Грузы (запасы прочие) (эфесов)':1,
        }

metadict_army['Пряности (эфесов)'] = {
        '-Грузы (запасы прочие) (эфесов)':1,
        }

#----
# Суммируем:

metadict_detail['-Грузы (ценности) (тонн)'] = {
        '-Грузы (тонн)':1,
        }

metadict_detail['-Грузы (скот) (тонн)'] = {
        '-Грузы (тонн)':1,
        }

metadict_detail['-Грузы (запасы основные) (тонн)'] = {
        '-Грузы (тонн)':1,
        }

metadict_detail['-Грузы (запасы прочие) (тонн)'] = {
        '-Грузы (тонн)':1,
        }

metadict_detail['-Грузы (запасы основные) (эфесов)'] = {
        '--Грузы (эфесов)':1,
        '---Грузы (exp)':25,
        }

metadict_detail['-Грузы (запасы прочие) (эфесов)'] = {
        '--Грузы (эфесов)':1,
        '---Грузы (exp)':25,
        }

metadict_detail['-Грузы (скот) (эфесов)'] = {
        '--Грузы (эфесов)':1,
        '---Грузы (exp)':25,
        }

metadict_detail['-Грузы (ценности) (эфесов)'] = {
        '--Грузы (эфесов)':1,
        '---Грузы (exp)':25,
        }
